Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: HERO: Przeppp... raszam...
de: HERO: Ähem ... Verzeihung.
ru: HERO: Кхм… Простите…

source: OTHER: Nie ma mowy. Idź sobie. Nie widzisz, że|staram się ciebie ignorować?
de: OTHER: Schweig still!|Siehst du denn nicht, daß ich versuche|dich zu ignorieren?
ru: OTHER: Заткнись! Не видишь,|я пытаюсь тебя игнорировать!

source: HERO: Ale ja nic...
de: HERO: Aber ich habe doch nichts...
ru: HERO: Но я не...

source: OTHER: Wiedziałem.
de: OTHER: Daß du nichts drauf hast, war mir schon klar.
ru: OTHER: Знаю.

source: $0: Co to za miejsce?
de: $0: Was ist das für ein Ort?
ru: $0: Что это за место?

source: $4: Jak to, szaleńców?
de: $4: Was denn, ein Ort der Wahnsinnigen?
ru: $4: Что, сумасшедший дом?

source: $1: Proszę, musi mi pan pomóc wydostać się stąd!
de: $1: Bitte, du mußt mir helfen hier herauszukommen!
ru: $1: Пожалуйста, помоги мне выбраться отсюда!

source: $2: Tu chyba nie jest zbyt bezpiecznie, prawda?
de: $2: Hier ist man nicht besonders sicher, nicht wahr?
ru: $2: Тут не очень-то безопасно, не так ли?

source: $3: Nie chcę przeszkadzać.
de: $3: Ich möchte nicht weiter stören.
ru: $3: Я больше не буду отвлекать.

source: $5: Kahem, ma pan zieloną skórę.
de: $5: Ähem, deine Haut ist so ... grün.
ru: $5: Эмм… ваша кожа такая… зелёная.

source: $6: 99 procent ludzi tutaj nie żyje.
de: $6: Nun ja... 99 Prozent der Leute hier leben nicht mehr.
ru: $6: Ну да… 99 процентов людей здесь уже не живы .

source: $7: Tak tylko sobie pomyślałem.
de: $7: Ich habe nur so nachgedacht.
ru: $7: Всего лишь догадка.

source: OTHER: Nie twój interes. Zgiń, przepadnij,|siło nieczysta!
de: OTHER: Das geht dich gar nichts an. Verschwinde|lieber... Weiche von mir, unreine Macht!
ru: OTHER:Не твоё дело. Пошёл вон, згинь,|нечистая сила!

source: HERO: Wygląda to chyba na cmentarz.
de: HERO: Tja, sieht ganz nach einem Friedhof aus hier, was?
ru: HERO: Похоже на кладбище.

source: OTHER: Poważnie? Zawsze myślałem, że mieszkam|na kolorowym i radosnym placu zabaw.
de: OTHER: Wirklich? Ich dachte immer, daß ich auf|einem bunten und fröhlichen Spielplatz wohne.
ru: OTHER: Да ладно? А я-то всегда думал, что живу|на детской игровой площадке.

source: HERO: Placu zabaw? Ach, rozumiem. Staramy|się być dowcipni.
de: HERO: Spielplatz!? Ach, ich verstehe.|Wirklich ein guter Witz. Ha ha.
ru: HERO: Детская площадка?! Ах да, понимаю. Хорошая|шутка. Ха-ха.

source: OTHER: Jesteśmy dowcipni. A teraz idź już stąd.|To nie miejsce dla szaleńców.#E4#B0
de: OTHER: Selbst für einen Normalsterblichen hast du eine ziemlich|lange Leitung... Und jetzt verschwinde lieber von hier.|Das ist kein Platz für Idioten.#E4#B0
ru: OTHER: Да ты прям шутник.|Вали-ка лучше отсюда. Здесь не место для идиотов.#E4#B0

source: OTHER: Wróć, którędy przyszedłeś.
de: OTHER: Verschwinde dahin, wo du hergekommen bist...
ru: OTHER: Уйди откуда пришёл.

source: HERO: Ale tam...
de: HERO: Aber da...
ru: HERO: Но…

source: HERO: Kiedy nie mogę, naprawdę, proszę mi|wierzyć!
de: HERO: Ich kann doch nicht, wirklich,|bitte glaube mir!
ru: HERO: Но я не могу этого сделать, правда!|Поверь мне!

source: OTHER: Och, zamknij się już. Spróbuję kogoś|obudzić.#X1
de: OTHER: Ach, laß mich jetzt endlich in Ruhe.|Ich versuche jemanden aufzuwecken.#X1
ru: OTHER: Ну хорошо, хорошо, только заткнись уже.|Я сейчас попробую воскресить кого-нибудь.#X1

source: OTHER: A to niby dlaczego?#B1
de: OTHER: Wie kommst du denn darauf?#B1
ru: OTHER: Почему это?#B1

source: OTHER: Wy, ludzie, jesteście wszyscy szaleni.
de: OTHER: Ihr Menschen seid alle wahnsinnig.
ru: OTHER: Все вы, люди, какие-то сумасшедшие.

source: OTHER: Żyjecie jakieś marne dwieście czy ile tam|lat i to źle na was działa.
de: OTHER: Ihr lebt ein paar jämmerliche ein-|zweihundert Jahre, und das bekommt|euch gar nicht gut.
ru: OTHER: Вы живете всего-то одну-две сотни лет,|да и то хреново.

source: OTHER: Ciągle gnacie tu i tam, spieszycie się i|nie potraficie usiedzieć nawet stu lat|w jednym miejscu.
de: OTHER: Ständig wuselt ihr herum, habt es eilig|und könnt nicht mal hundert Jahre still auf|einem Platz sitzen.
ru: OTHER: Всё время куда-то спешите, не можете даже|какую-нибудь сотню лет спокойно побыть|на месте.

source: HERO: Stu lat?
de: HERO: Hundert Jahre?
ru: HERO: Сотню лет?

source: P#HERO: Rozumiem...|Więc pan jest jedną z tych legendarnych|długowiecznych istot!
de: P#HERO: Wow, ich verstehe,...|Also, bist du eines dieser legendären Wesen,|die uralt werden können!
ru: P#HERO: Ага, теперь я понимаю. Ты, должно быть,|один из тех легендарных долгожителей?

source: HERO: Pewnie ma pan z tysiąc lat albo więcej!
de: HERO: Sicher bist du tausend Jahre alt oder mehr!
ru: HERO: Тебе, наверное, не меньше тысячи лет!

source: OTHER: Kiedy się rodziłem ludzie byli jeszcze cali|owłosieni, chodzili po drzewach, podpierali|się ogonami, a na banana mówili jup-jup!
de: OTHER: Als ich geboren wurde, waren die Menschen|noch ganz behaart, hüpften auf den Bäumen herum,|und stützten sich mit den Schwänzen ab - und die|Bananen nannten sie Jup-Jup!
ru: OTHER: Когда я родился, люди ещё были волосатыми,|прыгали по деревьям и называли бананы яп-яп!

source: OTHER: Tak, to było jakiś czasu temu.#B0
de: OTHER: Tja, das ist schon eine Weile her.#B0
ru: OTHER: Так что да, это было очень давно.#B0

source: OTHER: A ty masz białą. Zupełnie jak zdechła ryba.
de: OTHER: Und deine ist weiß wie die eines toten Fisches.
ru: OTHER: А твоя кожа белая как у мертвой рыбы.

source: HERO: Nie ma powodu, żeby być nieuprzejmym.
de: HERO: Es gibt keinen Grund, unhöflich zu werden.
ru: HERO: У вас нет причины быть грубым.

source: OTHER: Jest. Ty.#E2#B0
de: OTHER: Doch, der Grund steht vor mir.#E2#B0
ru: OTHER: Есть. Эта причина — ты.#E2#B0

source: OTHER: Chcesz z tego zrobić sto procent?
de: OTHER: Willst du daraus vielleicht hundert Prozent machen?
ru: OTHER: Я гляжу,|ты хочешь увеличить процент неживых здесь до 100 процентов.

source: HERO: Erm, nie dziękuję.#E2#B0
de: HERO: Ähem, nein danke.#E2#B0
ru: HERO: Нет, спасибо.#E2#B0

source: OTHER: Nie trudź tego malutkiego, ludzkiego|móżdżku takimi rzeczami jak myślenie.
de: OTHER: Versuch erst gar nicht nachzudenken.,|Das strengt euer kleines Menschenhirn|viel zu sehr an.
ru: OTHER: Не надрывай свой человеческий мозг,|не пытайся думать.

source: OTHER: To się nie może udać.#B0
de: OTHER: Glaub mir, das wird nix.#B0
ru: OTHER: Всё равно ничего не получится.#B0

source: OTHER: Chi-n-chi-ku-ri-n!...
ru: OTHER: Чи-н-чи-ку-ри-н!

source: OTHER: Hmmm...
ru: OTHER: Хммм...

source: OTHER: Precipitevolissimebalmente!
ru: OTHER: Превысокомногорассмотрительствующий!

source: OTHER: Cholerne dusze.
de: OTHER: Verdammte Seelen.
ru: OTHER: Чёртовы души.

source: OTHER: Nigdy ich nie ma, gdy są|potrzebne.
de: OTHER: Sie sind nie da, wenn man sie braucht.
ru: OTHER: Их никогда нет, когда они нужны.

source: OTHER: Przykro mi, człowieczku, ale nie|mogę ci pomóc.
de: OTHER: Tut mir leid, Menschlein,|aber ich kann dir nicht helfen.
ru: OTHER: Извини, человечек, но я тебе|ничем не могу помочь.

source: $0: Może trzeba z nimi inaczej porozmawiać?
de: $0: Vielleicht mußt du einen anderen Ton anschlagen?
ru: $0: Может надо с ними как-то иначе поговорить?

source: $1: Czy one się przypadkiem pana nie boją?
de: $1: Vielleicht haben sie ja Angst vor dir?
ru: $1: А может они тебя боятся?

source: $2: Błagam, proszę spróbować jeszcze raz!
de: $2: Ich bitte dich, probiere es noch einmal!
ru: $2: Я прошу тебя, попробуй еще раз!

source: $3: Rozumiem. Więc zostanę tu na wieki...
de: $3: Verstehe. Also muß ich für immer hier bleiben...
ru: $3: Понятно. Значит, я останусь тут навсегда…

source: $4: Przecież to stek bzdur.
de: $4: Das ist doch ein Haufen Schwachsinn.
ru: $4: Вот дерьмо…

source: $5: Nie, oczywiście nie.
de: $5: Nein, selbstverständlich nicht.
ru: $5: Нет, конечно нет.

source: OTHER: Sztuka konwersacji to umiejętność, którą|posiadłem w niewiarygodnym stopniu.
de: OTHER: Die Konversation ist eine Kunst, in der|ich es zur Formvollendung gebracht habe.
ru: OTHER: Искусство общения — это то искусство,|которым я владею в совершенстве.

source: OTHER: Moja mowa jest jak płatki fiołków padające|na jedwabną poduszkę, a jej słodycz wprost|proporcjonalna do mojej urody.
de: OTHER: Meine Worte sind wie Veilchenblätter, die auf|ein Seidenkissen sinken und ihre Süße ist|geradewegs proportional zu meiner Schönheit.
ru: OTHER: Моя речь подобна листьям фиалки,|падающим на шёлковую подушку, а моё красноречие|прямо пропорционально моей красоте.

source: OTHER: A sam przyznasz, że nie można nic odmówić|temu szlachetnemu obliczu, które widzisz|przed sobą.
de: OTHER: Du mußt selbst zugeben, daß man diesem|meinem edlen Antlitz nichts entgegensetzen|kann.
ru: OTHER: И ты должен признать, что тебе не по силам|устоять перед моим благоодным лицом.

source: OTHER: Zresztą zawsze wyróżniałem się osobistym|wdziękiem i czarem.
de: OTHER: Ja, es ist wahr. Ich stach schon immer durch|persönliche Anmut und Zauber hervor.
ru: OTHER: Во всяком случае, я всегда славился своей грацией и обаянием.

source: OTHER: Jakieś pięćset lat temu zakochała się nawet|we mnie pewna wiedźma. Była niezwykle|przystojna.
de: OTHER: Ungefähr vor fünfhundert Jahren hat sich|sogar eine Hexe in mich verliebt. Sie war|ungewöhnlich wohlgestaltet.
ru: OTHER: Около пятисот лет назад в меня влюбилась|одна ведьма. Она была очень красива.

source: OTHER: Może tylko miała nos zbyt blisko brody.
de: OTHER: Vielleicht hatte sie nur die Nase zu nah am|Kinn.
ru: OTHER: Ну разве что нос у неё был немного|близко к подбородку.

source: P#OTHER: Masz z tym jakiś problem?#B1
de: P#OTHER: Hast Du damit vielleicht ein Problem?#B1
ru: P#OTHER: У тебя с этим проблемы?#B1

source: OTHER: Mnie? Nawet gdyby mnie nie znały, to jest|chyba oczywiste, że musiałaby zaufać komuś|tak czarującemu, przystojnemu i błyskotliwemu.
de: OTHER: Vor mir?|Das kann nicht sein. Einem so einnehmenden|Wesen muß man einfach vertrauen. Du redest|Unsinn.
ru: OTHER: У меня? Да хоть бы меня вообще никто не знал,|всё равно она бы доверилась тому, кто столь|очарователен, красив и блистателен.|Это же очевидно!

source: OTHER: Wiem, że jestem niczego sobie. Zwłaszcza|z profilu, chociaż en face też mi nic nie|brakuje.
de: OTHER: Ich weiß, daß ich ohnegleichen bin. Vor allem|im Profil ... Man hat eben oder man hat nicht.
ru: OTHER: Я знаю, что я весьма неплох.|Особенно в профиль,|хотя и анфас я в порядке.

source: OTHER: Zresztą zawsze wyróżniałem się osobistym|wdziękiem i czarem wewnętrznym.
de: OTHER: Tja und ich habe mich schon immer durch|persönliche Anmut und inneren Zauber ausgezeichnet.
ru: OTHER: Я всегда отличался особенным обаянием и утончённостью.

source: P#OTHER: <westchnienie>
de: P#OTHER: ...Seufz...
ru: P#OTHER: ...Ап...

source: P#OTHER: <WESTCHNIENIE>#X1
de: P#OTHER: ...Seufz...#X1
ru: P#OTHER: ...Ап...#X1

source: OTHER: Co takiego, człowieczku? Chyba|nie dosłyszałem?
de: OTHER: Was beliebtest du zu sagen, Menschlein?
ru: OTHER: Ты что-то сказал, человечек?

source: HERO: Nie, nic, nic... Naprawdę...
de: HERO: Ach nichts, gar nichts...
ru: HERO: Нет, ничего… Совсем ничего…

source: OTHER: Ależ powiedz, powiedz proszę...
de: OTHER: Sprich dich ruhig aus...
ru: OTHER: Да нет, ты говори, говори…

source: OTHER: Chętnie posłucham.
de: OTHER: Ich höre.
ru: OTHER: Я слушаю.

source: HERO: Powiedziałem "bez dwóch"...
de: HERO: Ich sagte "Haufen"...
ru: HERO: Погода сегодня хорошая…

source: HERO: Chodziło mi o to, że bez dwóch zdań.
de: HERO: Diese Seelen müssen ein Haufen Irrer sein.
ru: HERO: Я про погоду говорил.

source: P#OTHER: Achhh...
de: P#OTHER: Ach so.
ru: P#OTHER: А, это…

source: P#OTHER: W porządku.#X1
de: P#OTHER: In Ordnung.#X1
ru: P#OTHER: Ну и отлично.#X1

source: OTHER: I słusznie!#X1
de: OTHER: In Ordnung!#X1
ru: OTHER: Отлично!#X1

source: OTHER: A może tak: Saippuakivikauppias!
de: OTHER: Vielleicht so: Saippuakivikauppias!
ru: OTHER: Попробую ещё так: Аргентинаманитнегра!

source: OTHER: ...Cholera!
de: OTHER: ...Verdammt noch mal!
ru: OTHER: Чёрт!

source: OTHER: Nic z tego nie będzie.
de: OTHER: Da wird nichts draus.
ru: OTHER: Из этого ничего не выйдет.

source: OTHER: Nareszcie!...
de: OTHER: Das wurde aber auch Zeit!...
ru: OTHER: Это потребует немало времени!

source: OTHER: Witaj, młody człowieku.
de: OTHER: Sei gegrüßt, junger Mensch.
ru: OTHER: Бывай, парень.

source: OTHER: Kim jesteś, złodziejem grobowców?
de: OTHER: Was bist du, ein Grabräuber?
ru: OTHER: Ты кто, расхититель гробниц?

source: HERO: Ależ nie! Jestem...
de: HERO: Aber nein! Ich bin...
ru: HERO: О, нет! Я…

source: P#HERO: Uch, to nie tak łatwo wytłumaczyć, bo...
de: P#HERO: Tja, das ist nicht so einfach zu erklären, weil...
ru: P#HERO: Ну, это не так-то легко объяснить, потому что…

source: OTHER: O, zawsze wydawało mi się, że to|najprostsze pytanie na świecie.
de: OTHER: Schau an, dabei kam es mir immer so vor,|als ob das die leichteste Frage der Welt sei.
ru: OTHER: Интересно, я всегда думал,|что легче вопроса быть не может!

source: HERO: Demon zmienił moje ciało... To znaczy|właściwie, moja dusza...
de: HERO: Ein Dämon hat meinen Körper... Das heißt, nein...|eigentlich hat er meine Seele...
ru: HERO: Один демон украл мое тело…|то есть… на самом деле|он украл мою душу…

source: OTHER: Na pogawędki o drobiazgach czas będzie|potem.
de: OTHER: Über Details können wir später plauschen,|mein Junge.
ru: OTHER: О деталях мы можем поговорить позже,|мой друг.

source: OTHER: A co do twoich czarodziejskich sztuczek, to|jak mówi stare przysłowie, nie chwal się|dokonaniami dnia wczorajszego...
de: OTHER: Wenn es um Dämonen geht|so sagt ein altes Sprichwort,
ru: OTHER: А про твои фокусы есть старая поговорка:|не хвались вчерашними подвигами…

source: OTHER: ...gdyż nie będziesz miał się czym|chełpić jutro.
de: OTHER: ...man soll den Morgen|nicht vor dem Abend loben...
ru: OTHER: …а то нечем будет хвалиться завтра.

source: OTHER: Wniosek z tego taki, że czas|napić się piwa.
de: OTHER: Und die Moral von der Geschicht',|es ist höchste Zeit für ein gepflegtes|Bierchen.
ru: OTHER: А мораль такова: самое время|выпить по пивку.

source: OTHER: Bywaj.
de: OTHER: Auf bald.
ru: OTHER: Пока.

source: HERO: Ale...
de: HERO: Aber...
ru: HERO: Но…

source: OTHER: Ha, też odczuwasz pragnienie?
de: OTHER: Hoho, hast du etwa auch Durst?
ru: OTHER: Ха, тебя тоже мучает жажда?

source: HERO: Chyba nie...
de: HERO: Ich glaube nicht...
ru: HERO: Я так не думаю…

source: OTHER: Nie wiesz kim jesteś i nie wiesz|czy odczuwasz pragnienie?
de: OTHER: Du weißt nicht wer du bist|und ob du Durst hast?
ru: OTHER: Так ты не знаешь,|кто ты такой и не знаешь,|есть ли у тебя жажда?

source: OTHER: Może porozmawiajmy o tym CO wiesz.
de: OTHER: Laß uns mal darüber reden|WAS du eigentlich weißt.
ru: OTHER: Ты вообще хоть что-нибудь знаешь?

source: HERO: Wiem, że chcę się stąd wydostać.
de: HERO: Ich weiß nur, daß ich hier|herauskommen möchte.
ru: HERO: Я знаю только, что я должен|отсюда выбраться.

source: OTHER: O! Coś nas łączy. To miłe.
de: OTHER: Oh! Da haben wir ja etwas gemeinsam.|Das ist ja nett.
ru: OTHER: О! У нас есть что-то общее! Это приятно.

source: OTHER: Tysiąc lat temu było niedaleko stąd miasto,|a w tym mieście była sobie miła,|przytulna, cieplutka karczma.
de: OTHER: Vor tausend Jahren lag nicht weit von hier|eine Stadt und in dieser Stadt gab es ein nettes,|gemütliches und warmes Wirtshaus.
ru: OTHER: Тысячу лет назад недалеко отсюда|был город, и в этом городе была одна|тёплая и уютная таверна.

source: OTHER: Podawali piwo, krasnoludzki spirytus z piwem|i pyszną golonkę z chrzanem gotowaną w piwie.
de: OTHER: Dort wurde Bier, Zwergenspiritus mit Bier|und in Bier gesottenes Eisbein mit Meerrettich|serviert.
ru: OTHER: Там подавали пиво,|гномий спирт с пивом и|свиную рульку с хреном, тушённую в пиве.

source: OTHER: Pod ścianą siedziało piwo, to znaczy|bard i pisał poemat.
de: OTHER: Ganz hinten im Wirtshaus saß meist der Barde|und verfaßte Gedichte.
ru: OTHER: А у стены сидело пиво,|то есть бард сидел у стены, и писал стихи.

source: OTHER: Najczęściej o mnie.
de: OTHER: Die meisten waren über mich.
ru: OTHER: В основном обо мне.

source: HERO: Byłeś sławny?
de: HERO: Du warst also berühmt?
ru: HERO: Вы были знамениты?

source: OTHER: Pytasz ptaka czy umie latać albo|rybę czy umie pływać?
de: OTHER: Fragst du einen Vogel, ob er fliegen kann|oder einen Fisch, ob er schwimmen kann?
ru: OTHER: Ты бы ещё спросил у птицы,|умеет ли та летать, или у рыбы,|умеет ли та плавать.

source: OTHER: Oczywiście, że byłem sławny! Ręka mdlała mi|od udzielania autografów.
de: OTHER: Selbstverständlich war ich berühmt!|Meine Hand erlahmte vom Autogramme geben.
ru: OTHER: Конечно же я был знаменит! Бывало,|что моя рука немела|от долгой раздачи автографов.

source: OTHER: Zaszczytem dla książąt i królów było, jeżeli|zechciałem przechylić z nimi kufelek.
de: OTHER: Sogar Prinzen und Könige fühlten sich geehrt,|wenn ich mich dazu herabließ, mit ihnen|einen Krug zu leeren.
ru: OTHER: Для принцев и королей было честью|опрокинуть со мной пинту-другую.

source: OTHER: Sam Adanor Wszobrody odmówił mi trzydziestego|siódmego kubeczka krasnoludzkiego spirytusu.
de: OTHER: Und selbst Adanor Lausbart mußte beim dreißigsten|Becher Zwergenspiritus aufgeben, wenn du verstehst...
ru: OTHER: Даже Аданор Вшебрадый слился на тридцать седьмой|нашей с ним кружке гномьего спирта.

source: OTHER: Następnego dnia zresztą uroczyście ślubował|abstynencję do końca życia.
de: OTHER: Am nächsten Tag hat er übrigens Abstinenz|bis zum Lebensende gelobt, he he he.
ru: OTHER: На следующий день он поклялся завязать|с алкоголем на всю оставшуюся жизнь.

source: HERO: Moglibyśmy razem sprawdzić, czy ta karczma|jeszcze stoi.
de: HERO: Wir könnten doch gemeinsam nachschauen,|ob dieses Wirtshaus noch steht.
ru: HERO: Давай посмотрим, стоит ли ещё та пивнушка.

source: OTHER: Ho, ho, chłopcze. Nie dasz rady nadążyć za|spragnionym czarodziejem!
de: OTHER: Ho, ho, Junge. Du kannst doch nicht mit einem|durstigen Zauberer gleichziehen!
ru: OTHER: Сказать по правде, парень, против жаждущего пива|волшебника у тебя шансов нет!

source: OTHER: Ale zostawię ci pewną użyteczną rzecz.
de: OTHER: Aber ich überlasse dir eine gewisse nützliche Sache.
ru: OTHER: Но я дам тебе одну полезную вещь.

source: OTHER: To mapa, magiczna, ale każdy może z niej|korzystać. Trochę przeleżała, więc uaktywni|się dopiero za dłuższą chwilę.
de: OTHER: Das ist eine magische Landkarte,|aber jeder kann von ihr Gebrauch machen.|Sie hat ein bißchen lange herumgelegen,|deswegen aktiviert sie sich erst nach einer Weile.
ru: OTHER: Это волшебная карта. Каждый|может её использовать. Только|она немного залежалась, поэтому до полной её активации|пройдёт некоторое время.

source: OTHER: Przez ten czas możesz sobie przeszukać|tutejsze groby.
de: OTHER: In der Zwischenzeit kannst du die Gräber hier absuchen.
ru: OTHER: А пока ты можешь покопаться в могилах.

source: OTHER: Skoro w moim było coś tak ciekawego jak|ja, może i w innych coś się znajdzie.
de: OTHER: Schließlich hast du mich hier gefunden.|Vielleicht findest du noch was Interessantes.
ru: OTHER: Ты ведь нашёл в моей могиле меня,|может и в других что-нибудь полезное найдёшь.

source: HERO: Co?!...
de: HERO: Was soll ich?!...
ru: HERO: Чего?!...

source: OTHER: Och, nie bój się, są od dawna puste.
de: OTHER: Ach, hab doch keine Angst,|die Gräber sind längst ... unbewohnt.
ru: OTHER: Да ты не бойся. Там давно уже пусто.

source: OTHER: Nie chodzi mi o żadnego z mieszkańców,|ale może coś interesującego, coś|magicznego?
de: OTHER: Mir geht es nicht um einen meiner ... Kollegen.|Vielleicht findest du etwas Magisches.
ru: OTHER: Вдруг найдёшь там что-нибудь волшебное?|Речь не о жителях могил, конечно же.

source: OTHER: Czuję jakąś aurę, ale szczerze mówiąc mam|za dużą ochotę na piwo, aby móc spokojnie|myśleć.
de: OTHER: Ich spüre irgendeine Aura, aber ehrlich gesagt|ich habe viel zu große Lust auf ein Bier,|als daß ich in Ruhe nachdenken könnte.
ru: OTHER: Я чую здесь некую ауру, но только я|сейчас так хочу пива, что ни о чём другом|думать не могу.

source: OTHER: Jak chciałbyś jeszcze pogadać, to|będę w mieście.
de: OTHER: Falls du noch reden möchtest,|ich werde in der Stadt sein.
ru: OTHER: Захочешь чего спросить — ищи меня в городе.

source: HERO: A jeśli tam nie ma już miasta?
de: HERO: Und wenn es da keine Stadt mehr gibt?
ru: HERO: А если города больше нет?

source: OTHER: To znajdziesz mnie w najbliższej karczmie.|Chyba nie wprowadzono tu prohibicji?
de: OTHER: Dann findest du mich im nächsten Wirtshaus.|Hier wurde doch wohl keine Prohibition eingeführt?
ru: OTHER: Тогда найдёшь меня в любой ближайшей таверне.|Надеюсь, сухой закон тут ещё не ввели.

source: OTHER: Do zobaczenia i pamiętaj: jeżeli dzieje|się coś złego, usiądź sobie spokojnie|i wychyl kufelek piwa.
de: OTHER: Auf Wiedersehen mein Junge und denk daran:|wenn etwas Schlimmes passiert, dann setz dich erst mal|hin und trinke einen Krug Bier.
ru: OTHER: До скорого! И запомни: если что пойдёт не так,|первым делом присядь и опрокинь кружку пива.

source: OTHER: Świat od razu stanie się lepszy.
de: OTHER: Die Welt wird dann sofort besser aussehen.
ru: OTHER: Мир сразу станет лучше.

source: OTHER: Przy okazji: jestem Arivald z Silmaniony.|Arcymag Tajemnego Bractwa i mistrz sztuk|magicznych.
de: OTHER: Ach übrigens, ich bin Arivald von Silmanion.|Erzmagier der Geheimen Bruderschaft|und Meister der magischen Künste.
ru: OTHER: Кстати, меня зовут Аривальд из Силманиона.|Архимаг Тайного Братства и магистр волшебных искусств.

source: HERO: A ja ...chyba Galador...
de: HERO: Und ich... Galador, glaube ich.
ru: HERO: А я… Галадор… вроде бы…

source: $0: Został jeszcze jeden grób, proszę...
de: $0: Es ist noch ein Grab übriggeblieben, hier...
ru: $0: Осталась еще одна могила…

source: $1: Skoro tak, to chyba zamieszkamy tu razem.
de: $1: Tja, dann sind wir ab jetzt wohl enge Nachbarn...
ru: $1: Если это так, то тогда мы будем жить здесь вместе.

source: $2: Wiedziałem, że całe to czarowanie to bujda.
de: $2: Die Zauberei zählt doch zu den Ammenmärchen.
ru: $2: Эта ваша магия чушь полная.

source: $3: <chlip, chlip>
de: $3: Bla, bla, bla.
ru: $3: <хнык, хнык>

source: OTHER: Nie ma mowy, to grób czarodzieja Arivalda.
de: OTHER: Kommt nicht in Frage, das ist das Grab|des Zauberers Arivald.
ru: OTHER: Ни в коем случае, это могила волшебника Аривальда.

source: OTHER: Mówiono o nim, że ma niemiły zwyczaj|zamieniania w stonogi tych, którzy|przeszkadzają mu we śnie.
de: OTHER: Man sagt ihm die unfreundliche Angewohnheit|nach, Störenfriede in Tausendfüßler zu|verwandeln.
ru: OTHER: Говорили, что он любит превращать тех, кто тревожит его сон, в сороконожек.

source: OTHER: Swoją drogą zjadłbym jakąś tłuściutką|stonogę.
de: OTHER: Nebenbei erwähnt, so einen leckeren fetten|Tausendfüßler könnte ich jetzt gut verspeisen.
ru: OTHER: О, кстати, я бы сейчас с удовольствием покушал жирной сороконожки.

source: P#OTHER: Chyba lepiej zaryzykować niż znosić|dłużej twoją obecność.#X1
de: P#OTHER: Besser ich riskiere es. Alles besser als deine|Anwesenheit noch länger ertragen zu müssen.#X1
ru: P#OTHER: Всё же я рискну. Не могу больше|выносить твоего присутствия здесь.#X1

source: P#OTHER: Wstrętny szantażysta.#X1
de: P#OTHER: Schändlicher Erpresser.#X1
ru: P#OTHER: Грязный вымогатель.#X1

source: OTHER: Ha!
de: OTHER: Pah!
ru: OTHER: Ха!

source: OTHER: Igrasz z moją ambicją, człowieczku.
de: OTHER: Du willst mich wohl bei meinem|Ehrgeiz packen, Menschlein.
ru: OTHER: Ты играешь на моих чувствах, человечек.

source: P#OTHER: Udało ci się.#X1
de: P#OTHER: Es ist dir gelungen.#X1
ru: P#OTHER: Тебе это удалось.#X1

source: OTHER: Na wszystkie demony piekieł! To najbardziej|odrażający widok w moim krótkim życiu.
de: OTHER: Bei allen Höllendämonen! Das ist wohl der|abstoßendste Anblick in meinem kurzen Leben.
ru: OTHER: Адские черти! Никогда не было|в моей жизни момента жутче этого.
