Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: dłuższy kawałek linki - Trudno w to uwierzyć, ale jest to dłuższy|kawałek linki.
de: Ein längeres Seilstück - Kaum zu glauben, aber das ist ein|längeres Seilstück.
ru: Длинная веревка - Не верю своим глазам! Это - длинная|веревка!

source: krótszy kawałek linki - Mimo długotrwałego wpatrywania się wciąż|jest to krótszy kawałek linki.
de: Ein kürzeres Seilstück - Trotz längerwährendem Hinschauen ist|es immer noch ein kurzes Seilstück.
ru: Короткая веревка - Это еще и короткая веревка

source: krzyż - Doskonała broń przeciw wszelkiemu Złu!
de: Kreuz - Vorzügliches Mittel gegen jegliches Böse!
ru: Крест - Хорошее средство от всякого зла!

source: poświęcony krzyż - Wzmocniony duchowo odstraszacz Zła.
de: Gesegnetes Kreuz - Ein geistlich verstärktes Mittel|gegen das Böse.
ru: Освященный крест - Очень сильное средство против всякого|зла

source: krzyż z czosnkiem - Wzmocniony zapachowo odstraszacz Zła.
de: Kreuz mit Knoblauch - Durch den unvergleichlichen Duft verstärktes|Mittel gegen das Böse.
ru: Крест с чесноком - Усиленное средство против зла

source: Nieustraszony Zabójca Wampirów - DO DZIEŁA!
de: Patentierter Vampirkiller - AN'S WERK!
ru: Бесстрашный Убийца Вампиров - ВРЕМЯ ДЕЙСТВОВАТЬ!

source: czosnek - Mała, niedorozwinięta, śmierdząca cebula.
de: Knoblauch - Eine unterentwickelte, stinkende Zwiebel.
ru: Чеснок - Вонючий!

source: mapa - Magiczna mapa od Arivalda.
de: Landkarte - Die magische Landkarte von Arivald.
ru: Карта - Волшебная карта Аривальда

source: miecz - Ha! Drżyjcie wrogowie!
de: Schwert - Ha! Erzittert vor mir ihr Feinde!
ru: Меч - Ха! Берегись враги!

source: kartka - To brakująca kartka pamiętnika nekromanty!|Opisuje czar "Utłuszczenie", który ponoć na|chwilkę odwraca gabaryty zaklętego nim obiektu...
de: Buchseite - Das ist die fehlende Seite aus dem Tagebuch des|Nekromanten! Sie beschreibt den "Dickmach"-Zauber,|der angeblich für einen Moment die Maße des|verzauberten Objektes verändert...
ru: страница - Это - недостающая страница из дневника Некроманта!|Она описывает заклинание "Жирение", которое, по-видимому, на минутку|меняет размеры заклятого объекта...

source: linka - Długa, mocna linka.
de: Seil - Langes, starkes Seil.
ru: Канат - Длинный, прочный канат.

source: poemat - Słowa, słowa, słowa...
de: Gedicht - Worte, Worte, Worte...
ru: Стих - Слова-слова-слова..

source: flakonik z perfumami - Jak znam żonę barda to równie dobrze|może to być kwas.
de: Flakon mit Parfüm - So wie ich die Frau des Barden kenne,|könnte das genauso gut Säure sein.
ru: Флакон духов - Насколько я разбираюсь, это - неплохие|духи..

source: szlafmyca - Co za gustowny ubiór na noc.
de: Schlafmütze - Was für eine geschmackvolle Bekleidung|für die Nacht.
ru: Ночная рубашка - Какая роскошная вещь!

source: trzonek siekiery - Wykonany jest z bardzo twardego drewna.
de: Axtstiel - Er ist aus sehr hartem Holz gefertigt.
ru: Рукоять топора - Она сделана из очень твердого дерева.

source: łuska - Jest prawie tak wielka, jak liść klonu!
de: Drachenschuppe - Sie ist fast so groß, wie ein Ahornblatt!
ru: Чешуя дракона - Она большая, как лист бумаги!

source: kartka z księgi - Smoki, żmije i jaszczury. Wszystko o...
de: Seite aus dem Buch - Alles über... Drachen... Schlangen und Echsen.
ru: Страница из книги - Все о.. драконах, змеях и ящерицах!

source: fragment kartki - Ten smok nie wygląda przyjaźnie...
de: Teil einer Buchseite - Dieser Drache sieht nicht sehr freundlich aus...
ru: Часть страницы - Этот дракон не очень-то дружелюбен!

source: księga czarów - Księga nafaszerowana czarami jak|ja dobrymi pomysłami.
de: Zauberbuch - Das Buch ist so mit Zaubereien gefüllt,|wie ich mit guten Ideen.
ru: Книга Заклинаний - Эта книга полна магии, как я - хороших идей!

source: trzonek z linką - Linka przywiązana do środka trzonka.
de: Stiel mit Seil - Das Seil ist in der Mitte des Stiels festgebunden.
ru: Якорь на канате - Это - якорь, прочно привязанный к канату

source: szczur - Roznoszące choroby obrzydlistwo.
de: Ratte - Ein krankheitenübertragendes Scheusal.
ru: Крыска - Мерзкое создание, разносчик заразы

source: dwa obole - Mam nadzieję, że nie zostały zabrane|spod czyjegoś języka.
de: Zwei Obolusse - Ich hoffe, daß sie nicht schon unter der Zunge|eines Toten lagen.
ru: Два гроша - Надеюсь, их не клали на глаза мертвецу...

source: eliksir szybkości - Będę mknął niczym gazela. Szkoda, że|efekt jest krótkotrwały.
de: Schnelligkeitselixier - Ich werde eilen wie eine Gazelle.|Nur schade, daß der Effekt so schnell vorbei ist.
ru: Эликсир скорости - Я стану быстр как газель! Жаль, только,|что ненадолго...

source: kufel krasnoluda - Masywny i pojemny kufel, prawie|dzieło sztuki.
de: Der Becher des Zwergen - Ein massiver, sehr aufnahmefähiger Becher,|fast ein Kunstobjekt.
ru: Кубок гномов - Хорошая, надежная вещь, почти предмет искусства!

source: kufel pełen mazi - Dobrze, że to coś nie przeżarło go na|wylot. Widocznie został dobrze|zaimpregnowany piwem.
de: Becher voller Schlamm - Gut, daß dieses Irgendetwas ihn nicht|gänzlich zerfressen hat. Anscheinend|war er gut mit Bier imprägniert.
ru: Кубок с грязью - Хорошо? что ее всю не съели. С пивом|- очень хорошая вещь!

source: mieszek ze złotem - Ciężki i miło brzęczący. Witajcie|słodkie dukatki!
de: Säckchen mit Gold - Es ist schwer und klimpert angenehm.|Seid gegrüßt, ihr süßen Dukaten!
ru: Мешок золота - Он тяжелый и звенит. Полон дукатов!

source: puzderko z trucizną - Ciekawe, dla kogo to było|przeznaczone?
de: Schachtel mit Gift - Interessant. - Für wen das|wohl bestimmt war?
ru: Отравленный предмет - Интересно, кому он предназначался?

source: diamentowy kastet - Trwalszy niż życie...
de: Diamanten-Schlagring - Beständiger als das Leben...
ru: Бриллиантовое кольцо - Вечное и прекрасное, как жизнь....

source: kamienny udziec - Nieco twardawy.
de: Steinerne Widderkeule - Ziemlich hart.
ru: Шипованая дубина - Очень жестокая вещь

source: świeczka - Ucięta świeczka.
de: Kerze - Abgeschnittene Kerze.
ru: Свеча - Красивая свеча

source: rogi - Co dwa rogi to nie jeden.
de: Hörner - Zwei Hörner sind besser als eins.
ru: Рога - Два рога - лучше, чем один!

source: róg - Diabelskiego miotu.
de: Horn - Dieser Kopfschmuck gehörte mal|einem Teufel.
ru: Рог - Он раньше принадлежал дьяволу!

source: ułamany róg - Nadkruszony, ale podstawa się ostała.
de: Abgebrochenes Horn - Etwas angeknackst, aber der Rest ist in Ordnung.
ru: Разбитый рог - Немного покоцан, но еще в порядке

source: rogi - Co róg i pół to nie jeden.
de: Hörner - Anderthalb Hörner sind besser als eins.
ru: Рога - Много рогов, лучше, чем мало..

source: woalka - Bardzo delikatna materia.
de: Schleier - Ein sehr zartes Material.
ru: Вуаль - Очень тонкий материал

source: dziewczyna - Ciekawe, jak wygląda bez tej maski...
de: Mädchen - Interessant. - Wie sie wohl ohne Maske aussieht?!
ru: Девушка - Интересно. Как она выглядит без маски?

source: Shandria - Ech... Co tu dużo gadać...
de: Shandria - Ach... da gibt's nicht viel zu sagen...
ru: Шандрия - Ах! У меня нет слов!

source: Moneta - Dobry początek...
de: Münze - Ein guter Anfang...
ru: Монета - Хорошее начало

source: 2 monety - Początek za mną...
de: Zwei Münzen - Das Glück ist mit mir...
ru: Две монеты - Удача со мной...

source: 3 monety - Środek możliwości.
de: Drei Münzen - Nicht schlecht.
ru: Три монеты - Неплохо

source: 4 monety - Prawie absolut.
de: Vier Münzen - Fast das Höchste der Gefühle.
ru: Четыре монеты - Я на вершине блаженства...

source: 5 monet - Ideał.
de: Fünf Münzen - Geradezu ideal.
ru: Пять монет - Почти идеально...

source: powłoka - Niewielki kawałek materiału.
de: Überzug - Ein nicht sehr großes Stück Stoff.
ru: Чехол - Небольшой кусок материи

source: powłoka - Ćwiczenia rozciągające czynią cuda.
de: Überzug - Stretchübungen wirken Wunder.
ru: Чехол - Это может оказаться волшебным

source: powłoka - Coś zaczyna się wykluwać...
de: Überzug - Irgend etwas tut sich da...
ru: Чехол - Иногда это....

source: powłoka - Ryzykowne wdzianko...
de: Überzug - Riskantes Kleidungsstück...
ru: Чехол - Рискованная одежда...

source: świeczka - Magiczna - nigdy nie gaśnie.
de: Kerze - Magisch, sie geht nie aus.
ru: Свеча - Магия. Оно никак не выходит.

source: rozgrzany węgiel - Cieplutki.
de: Erhitzte Kohle - Richtig warm.
ru: Горячий уголь - Раскаленный уголь

source: letni węgiel - Prawie zimny.
de: Lauwarme Kohle - Fast kalt.
ru: Теплый уголь - Почти холодный

source: grabarz - Wygląda gorzej niż ja się czuję.
de: Totengräber - Er sieht schlechter aus als ich mich fühle.
ru: Копальщик могил. - Он выглядит хуже, чем я себя чувствую.

source: grabarz - Brzydki i strachliwy.
de: Totengräber - Häßlich und einsam.
ru: Копальщик могил. - Покинут и одинок...

source: łopata - Błyskotliwa dedukcja wskazuje, iż ta|łopata należy do grabarza.
de: Schaufel - Durch scharfsinnige Deduktion|kann man herausfinden, daß die Schaufel|dem Totengräber gehört.
ru: Лопата - Посредством могучей дедукции можно| предположить, что лопата| принадлежит гробокопателю.

source: łopata - Teraz już nikt jej nie pilnuje.
de: Schaufel - Nun paßt niemand auf sie auf.
ru: Лопата - Никто не смотрит.

source: sowa - Mądry ptak, ale trochę się go boję.+Zwłaszcza w takim miejscu jak to...
de: Eule - Ein kluger Vogel, aber ich habe|ein bißchen Angst vor ihm.+Besonders an einem Ort wie diesem...
ru: Сова. - Не слишком умная птица, но я ее| побаиваюсь.

source: brama - Mam wrażenie, że przez tą bramę|wpadłem z deszczu pod rynnę.
de: Tor - Ich glaube, ich bin durch dieses Tor|vom Regen in die Traufe geraten.
ru: Ворота. - Я думаю, что через эти ворота| я попал из огня да в полымя.

source: grób - Bardzo stary grobowiec, ale napis się nie zatarł.+"Tu leży pochowany ze swoim mieczem sir Paladar,|Obrońca Dziewic, Pogromca Smoków, Postrach Goblinów."*+Dziewic?!...
de: Grab - Ein sehr altes Grab, doch|die Inschrift ist immer noch lesbar.+"Hier liegt Sir Paladar mit seinem Schwert|begraben, Jungfrauen-Verteidiger, Drachentöter,|und Schrecken der Goblins."*+Jungfrauen?!...
ru: Могила - Очень старая могила, но еще можно| прочитать надпись...

source: grób rycerza - Rycerz pochowany ze swoim mieczem.|To bardzo romantyczne.
de: Rittergrab - Ein mit seinem Schwert begrabener Ritter.|Sehr romantisch...
ru: Могила рыцаря. - Похороненный с мечом рыцарь. Очень| романтично.

source: grób - "Piłem, kradłem i oszukiwałem.|Życie było piękne!"
de: Grab - "Ich war ein Dieb und Betrüger|Das Leben war wunderschön!"
ru: Могила - "Я был вором и мошенником. Жизнь| была прекрасна!"

source: grób złodzieja - Grób jakiegoś większego złoczyńcy.
de: Grab eines Diebes - Grab eines üblen Halunken.
ru: Могила вора. - Могила какого-то негодяя.

source: grób - Bardzo stary grobowiec.
de: Grab - Ein sehr altes Grab.
ru: Могила - Очень старая могила.

source: grób - Grób jakiegoś Arivalda.+"Nigdy nie było na świecie znamienitszego maga|i lepszego przyjaciela".+I jeszcze napis pod spodem: "Zawsze pozostanie|w naszej pamięci - Cech Browarników".
de: Grab - Grab von irgendeinem Arivald.+"Nie gab es einen bedeutenderen|Magier und treueren Freund|in der Welt als ihn".+Und darunter noch eine Inschrift:|"Er bleibt in unserer Erinnerung| - Die Brauergilde".
ru: Могила - Могила некого Аривальда.

source: grób Arivalda - Ten grobowiec wygląda jakby miał z tysiąc lat.
de: Arivalds Grab - Dieses Grab sieht so aus,|als wäre es tausend Jahre alt.
ru: Могила Аривальда. - Эта могила выглядит как простоявшая| тысячу лет.

source: grób Arivalda - Teraz i ten grób jest pusty.
de: Arivalds Grab - Jetzt ist auch dieses Grab leer.
ru: Могила Аривальда. - Теперь эта могила пуста.

source: wyjście - Powrót na drogę.
de: Ausgang - Rückkehr auf den Weg.
ru: Выход. - Назад на дорогу.

source: łania - Chyba oswojona z widokiem ludzi.
de: Hirschkuh - Sie scheint an den Anblick|von Menschen gewöhnt zu sein.
ru: Олень - Похоже, что к виду людей он привык.

source: mostek - Widziałem większe pchły.
de: Kleine Brücke - Ich habe schon größere Flöhe|gesehen.
ru: Маленький мост - Я видел речки и побольше.

source: drzwi - Jest klamka, ale nie ma zamka.*+O, zrymowało mi się.
de: Tür - Es gibt eine Klinke, aber kein Türschloß.
ru: Дверь. - Есть запор, да нет замка.

source: chata - Dziura tu i tam, ale jest za elogo...+Eko... ekoglo...*+No, z drewna.
de: Hütte - Voll löchrig aber elogo...+Eko... ekologo...*+Naja, aus Holz eben.
ru: Чижина - Очень небольшая но эле...

source: sowa - Czy one nigdy nie śpią?
de: Eule - Die schlafen wohl nie?
ru: Сова. - Они не спят?

source: drzewo - To chyba osika.
de: Baum - Das ist wohl eine Espe.
ru: Деревья - Это - осина.

source: wyjście - Wyjście z chaty.
de: Ausgang - Hüttenausgang.
ru: Выход. - Выход их хижины

source: łóżko - Wygląda na mało używane.
de: Nachtlager - Es sieht so aus, als würde es|nur selten benutzt.
ru: Ночной лагерь - Похоже, что пользовались им нечасто.

source: kociołek - Gotuje się w nim jakaś strawa.+Sądząc po zapachu, to coś umarło|ładnych parę wiosen temu.
de: Kleiner Kessel - Darin wird etwas gekocht.+Nach dem Geruch zu urteilen,|ist dieses Etwas vor gut|tausend Jahren krepiert.
ru: Маленький котелок - Тут что-то варили.

source: dziura w dachu - Jak rozumiem, jest to dość toporna|wersja komina.
de: Loch im Dach - Wenn ich es richtig verstehe,|ist das eine ziemlich primitive|Version eines Schornsteins.
ru: Дырка в доске - Если я правильно понимаю, то это| - примитивная версия точила.

source: pustelnik - Wygląda na lekko oszołomionego.+To albo przez jego dietę, albo przez|te zielone roślinki, które hoduje na|zewnątrz.
de: Einsiedler - Er sieht ein bißchen verwirrt aus.+Entweder wegen seiner Diät oder|wegen der grünen Pflänzchen, die|er draußen anbaut.
ru: Отшельник - Он выглядит малость не в себе.

source: alejka - Prowadzi w jeden z zaułków.
de: Straße - Sie führt in eine der Gassen.
ru: Дорога. - Она ведет вдаль.

source: studnia - Studnia w środku miasta? Hmmm...|Mam nadzieje, że nie służy też|za szalet.
de: Brunnen - Ein Brunnen mitten in der Stadt?|Hmmm... Hoffentlich dient er nicht|auch als öffentliche Toilette.
ru: Колодец - Колодец посреди города? Хм...| Надеюсь, его не используют как| туалет?

source: kapeć - Pewnie jest w nim więcej bakterii, grzyba|i robaków niż na zdechłym psie.
de: Schlappen - Sicher gibt es darauf mehr|Pilze, Bakterien und Insekten|als auf einem verwesten Hund.
ru: Нищий. - На нем столько бактерий, инфекциии,| насекомых, как на собаке.

source: żebrak - Trochę mu się włosy przesunęły z czaszki|na brodę, ale poza tym nie widzę żadnych|powodów, dla których musi żebrać.
de: Bettler - Seine Frisur ist ein wenig verrutscht|aber eigentlich sehe ich keinen Grund|dafür, daß er betteln muß.
ru: Игрок. - Его прическа немного странная,| но это еще не повод играть...

source: szyld - Oho, coś mi mówi, że tu właśnie znajdę Arivalda.
de: Schild - Oho, eine innere Stimme sagt mir, daß ich|Arivald bald finden werde.
ru: Вывеска. - Ого, внутренний голос говорит| мне, что я скоро встречу Аривальда!

source: szyld - Jasny i klarowny.
de: Schild - Ein eindeutiges Schild.
ru: Вывеска. - Просто знак.

source: drzwi do karczmy - Drzwi jak drzwi. Mogę tu wejść|albo i nie wejść.
de: Wirtshaustür - Eine Tür ist eine Tür. Ich kann|eintreten oder auch nicht.
ru: Дверь таверны. - Дверь как дверь. Я могу войти,| а могу и не входить.

source: drzwi do sklepu - Nie za duże, ale za to solidnie|zabezpieczone.
de: Ladentür - Sie ist nicht sehr groß, aber|dafür solide und gut abgesichert.
ru: Дверь погреба - Она невелика, но очень толстая.

source: kłódka - Tę kłódkę to się chyba otwiera armatą...
de: Vorhängeschloß - Dieses Vorhängeschloß läßt sich wohl|nur mit einer Kanone öffnen...
ru: Передняя башня. - Эту башню можно разбить только| из пушки...

source: więzień - Publiczne kary są najgorsze.+Ale najbardziej skuteczne.
de: Gefangener - Öffentlich vollstreckte Strafen|sind die schlimmsten.+Aber auch die wirksamsten.
ru: Заключенный. - Обычно, самые заслуженные наказания| самые страшные.

source: być może niewinny człowiek - Wygląda na szczerego człowieka.
de: Womöglich ein unschuldiger Mensch - Er sieht nach einem ehrlichen|Menschen aus.
ru: Может, он и невиновен. - Он похож на честного человека.

source: złodziej - Biedak... Siedzi tu sam, w niewygodnej|pozycji, bez wody, z obtartymi nadgarstkami|i bosymi stopami.*+I DOBRZE MU TAK!
de: Dieb - Armer Schlucker...+Ganz alleine, in einer unbequemen|Haltung, ohne Wasser, mit aufgeschürften|Handgelenken und nackten Füßen.*+GESCHIEHT IHM RECHT!
ru: Вор. - Бедный...

source: ogłoszenie - "Uprasza się uprzejmie o nie rzucanie ciężkimi|lub ostrymi przedmiotami w kierunku więźnia,|tudzież o nie plucie i nie łaskotanie."+"Wykorzystywanie bezsilności więźnia, na przykład|poprzez okradanie go lub nadmierne torturowanie|może ewentualnie zostać ukarane grzywną. Kiedyś."
de: Anzeige - "Es wird gebeten den Gefangenen nicht zu|bespucken oder zu kitzeln oder mit scharfen|Gegenständen zu bewerfen."+"Das Ausnutzen der Wehrlosigkeit des|Gefangenen, z.B. durch Bestehlen oder übermäßiges|Foltern kann vielleicht irgendwann mit Bußgeld|geahndet werden."
ru: Вывеска - "Просьба заключенных не кормить,| не отвлекать и не швыряться| острыми предметами".

source: alejka - Widzę dom z godłem barda nad drzwiami.
de: Straße - Ich sehe das Haus mit dem Wappen|des Barden an der Tür.
ru: Дорога. - Я вижу дом со знаком барда на| двери.

source: drzwi do magazynu - Zamknięte. Zresztą i tak dobrze pilnuje|ich ten gruby kupiec.
de: Ladentür - Geschlossen. Sie wird sowieso gut|von dem dicken Händler bewacht.
ru: Дверь погреба - Закрыто. Но это итак хорошо охраняется| толстым торговцем.

source: tobołek - Pokaźny ładunek, ale kupcy tak się|zafascynowali grą, że zapomnieli go|nawet rozładować.
de: Bündel - Ein riesiges Paket, aber die Händler|waren so sehr vom Spiel fasziniert,|daß sie vergaßen, es auszupacken.
ru: Пакет - Хорошая вещь, но пристально охраняется| торговцем... Хотя они| забыли его распаковать.

source: kram - Wygląda to jak zbiór pamiątek|z dalekich podróży.
de: Stand - Sieht aus wie eine Sammlung|von Reisesouvenirs.
ru: Стойка. - Похоже на собрание сувениров из| путешествий.

source: niski kupiec - No, to Pinokio nam wydoroślał.
de: Kleiner Händler - Na, unser Pinocchio ist|erwachsen geworden.
ru: Маленький торговец. - Наш Пиннокио подрос...

source: wysoki kupiec - Szlachetna twarz, ale w oczach widać|obłęd i żądzę gry.
de: Großer Händler - Ein edles Antlitz, aber in den Augen|funkelt der Wahnsinn und die Spielgier.
ru: Большой торговец. - Солидный человек, но в глазах| безумие азарт игры.

source: gruby kupiec - Wagą, postawą i spojrzeniem wygląda|na kupieckiego przywódcę.
de: Dicker Händler - Seine Statur und sein Blick|verraten, daß er der Anführer|der Händler ist.
ru: Толстый торговец. - Его внешний вид выдает в неистинного| торговца.

source: kupiec - Ależ dziwny typ urody! Pewnie dotarł do|nas z dalekiego południa.
de: Händler - Was für ein merkwürdiges Aussehen!|Er stammt sicher von weit weg.
ru: Торговец - Какой странный человек. Он наверняка| издалека.

source: kości do gry - Zwykłe kości do gry.
de: Spielwürfel - Gewöhnliche Spielwürfel
ru: Кости. - Обычные игральные кости.

source: woalka - To chyba woalka trucicielki...+Widocznie to znana tutaj kobieta.+Wiadomo, że najłatwiej liść schować|w lesie...
de: Schleier - Das ist wohl der Schleier|der Giftmischerin...+Sie muß hier bekannt sein.+Es ist klar, daß sich ein Blatt|am besten im Wald verstecken läßt.
ru: Вуаль - Оно полно яду...

source: tabliczka - "Zamknięte. Badania naukowe."
de: Schild - "Geschlossen. Wissenschaftliche|Forschungen."
ru: Вывеска. - "Закрыто, научные исследования"

source: wyjście - Wyjście z miasteczka.
de: Ausgang - Ausgang aus der Stadt.
ru: Выход. - Выход из города.

source: wyjście - Wyjście na świeże powietrze.
de: Ausgang - Ausgang an die frische Luft.
ru: Выход. - Выход на свежий воздух.

source: ogłoszenie - "Nie obsługujemy na kredyt. Nie przyjmujemy|w zastaw żon, psów ani dzieci. Złote|i srebrne przedmioty mile widziane."
de: Anzeige - "Wir geben keinen Kredit.|Frauen, Hunde und Kinder werden|nicht als Pfand akzeptiert. Gold und|Silber sind immer willkommen."
ru: Вывеска - "Мы не даем в кредит, дети, собаки| и женщины под залог не оставляются.| Золото и серебро| приветствуется"

source: zakonnik - Albo miał nieszczęśliwy wypadek u golibrody,|albo zbyt mocno nachylił się nad ogniskiem.
de: Mönch - Entweder er hatte einen Unfall|beim Barbier oder er hat sich zu nah|an das Lagerfeuer herangewagt...
ru: Человек - Или он попал к плохому парикмахеру,| или он обжег голову.

source: krasnolud - Całkiem spory, jak na krasnoluda.*+Ba, całkiem spory jak na człowieka.
de: Zwerg - Ziemlich groß für einen Zwerg.*+Ja, selbst für einen Menschen|ist er ganz groß.
ru: Гном - Великоват как для гнома.*+Гм, да и великоват как для человека.

source: Arivald - No, nareszcie będziemy mogli dłużej|porozmawiać!
de: Arivald - Na, endlich werden wir länger|sprechen können!
ru: Аривальд - Наконец-то мы сможем нормально| поговорить...

source: Arivald - Mój ukochany przyjaciel, moja ostoja|w trudnych czasach i nieskażone|źródło czystej mądrości.
de: Arivald - Mein Freund und meine Hilfe|in schweren Zeiten. Meine Quelle|reiner Weisheit.
ru: Аривальд - Мой друг и моя помощь в тяжелые| времена. Мое проклятие во все| остальные.

source: ognisko - Cieplutki, przyjemny ogień.
de: Feuerstelle - Angenehm knisterndes Feuer.
ru: Камин - Тёплое, приятное пламя.

source: skrzynka - Skoro stoi na widoku publicznym, to|chyba jest pusta. A pieniądze pewnie|w skarpecie.
de: Kiste - Da sie für alle sichtbar hingestellt|wurde, muß sie wohl leer sein.|Und das Geld wird sicherlich im|Sparstrumpf verwahrt.
ru: Сундук - Раз это выставили, значит, там|пусто, а деньги в кассе.

source: karczmarz - Prawidłowo rozwinięty mięsień piwny...
de: Schankwirt - Ein Prachtexemplar seiner Zunft...
ru: Служащий - Типичный представитель своего| ремесла.

source: beka piwa - Uchh... Imponująca...
de: Großes Bierfaß - Uhh... Imponierend...
ru: Большая кружка - Ух! Впечатляет.

source: drzwi - Zapachy stamtąd docierające zniechęciłyby|nawet najbardziej zdesperowanego złodzieja.
de: Tür - Die von dort kommenden Gerüche|würden sogar einen entschlossenen|Dieb entmutigen.
ru: Дверь. - Идущие оттуда звуки наводят на| мысли о запертом воре...

source: bard - Zakola jak królewski dziedziniec, nos jak|pazur smoka, obślinione usta i czarny wąsik.+Teoretycznie wszystko jest przeciwko niemu,|ale coś mi mówi, że widoczna w jego oczach|pasja zaimponowała niejednej kobiecie...
de: Barde - Geheimratsecken wie ein Schloßhof,|eine Nase wie eine Drachenkralle und|ein versabberter schwarzer Schnurrbart.+Eigentlich macht er nicht viel her, doch|etwas sagt mir, daß seine leidenschaftlichen|Glutaugen schon so mancher Frau|imponiert haben...
ru: Бард - Весь грозный и гордый.

source: plakat - "Kto odnajdzie moją jedyną i ukochaną córkę|Shandrię otrzyma tyle złota, ile potrafi|unieść. Nie będę zmuszał do małżeństwa".+"...Zaginęła roku Kozła, zimą, i do dziś los|jest jej nieznany. Pogrążony w smutku, król|Badurrae, Rawet".+Jest jeszcze portret, ale już mało wyraźny.|Ten plakat wisi tu chyba ładnych parę lat...
de: Anschlag - "Wer meine einzige und geliebte Tochter|Shandria findet, bekommt so viel Gold,|wie er nur tragen kann. Zur Eheschließung|werde ich nicht zwingen."+"...Sie ist im Jahr des Ziegenbocks|im Winter verschollen und bis heute ist ihr|Schicksal unbekannt."+"Der in Trauer vertiefte König|Badurrae, Rawet".+Hier hängt zwar ein Bild von ihr, doch|es ist schon ziemlich verwischt. Dieser|Anschlag hängt hier wohl schon einige Jahre...
ru: Вывеска. - "Кто найдет мою дочь Шандрию,| получит столько денег, сколько| сможет унести. К женитьбе не| принуждаю."

source: butelki - Butelki trochę brudne, ale zawartość|chyba... hm... czysta.
de: Flaschen - Die Flaschen sind ein bißchen dreckig,|doch ihr Inhalt ist wohl... hm... rein.
ru: Бутылки - Бутылки несколько грязноваты,| но содержимое, кажется, нормальным.
