Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: OTHER: W jaki sposób, to nie należy do naszej opowieści.|Zwłaszcza, że aby zrozumieć choć jedną setną|z tego musielibyście...
de: OTHER: Auf welche Weise ihm das gelungen ist,|gehört nicht zu unserer Geschichte.|Außerdem müßtet Ihr,...
ru: OTHER: Как ему это удалось - не столь важно. Кроме|того, вам бы пришлось...

source: OTHER: ...pół życia studiować u jednego|z najwybitniejszych magów świata.|Na przykład...
de: OTHER: ...um auch nur den hundertsten Teil dessen|zu verstehen, was danach geschah, müßtet Ihr|Euer halbes Leben bei einem der besten Magiere|der Welt studieren!|Zum Beispiel...
ru: OTHER: ... чтобы хотя бы понять одну сотую этого дела,|полжизни проучиться у лучших магов мира!|Например...

source: OTHER: ...u mnie.
de: OTHER: ... bei mir.
ru: OTHER: ... у меня.

source: OTHER: W każdym razie w Piekle nastał czas|płaczu i zgrzytania zębów.
de: OTHER: Auf jeden Fall kam es in der Hölle zu einer Zeit|der Tränen und des Zähneknirschens.
ru: OTHER: В общем, пришло время поплакать и поскрипеть зубами| в аду.

source: P#OTHER: Kiedy tak wybitna duszyczka wymyka się|piekielnym sidłom nigdy nie jest to mile|widziane przez zwierzchników.
de: P#OTHER: Wenn ein solch außergewöhnliches Seelchen|den Höllenschlingen entrinnt, wird das|von den Vorgesetzten nie gerne gesehen.
ru: P#OTHER: Когда такой вот душонке удается сбежать, начальство|смотрит на это весьма косо.

source: OTHER: Odpowiedzialnym za cały ten ambaras był pewien|demon charakteryzujący się sporą brawurą i|odwrotnie do niej proporcjonalną sumiennością.
de: OTHER: Verantwortlich für dieses ganze Tohuwabohu war|ein gewisser Dämon, der sich durch große Bravour|und ein dazu umgekehrt proportionales|Verantwortungsbewußtsein auszeichnete.
ru: OTHER: Ответственен за это был один демон, который много|бравировал, но совсем не хотел отвечать за последствия.

source: P#OTHER: W związku z tym nie wahał się nawet|łamać piekielnych przepisów.
de: P#OTHER: Ja, dieser Dämon zögerte nicht einmal,|die Gesetze der Hölle zu brechen!
ru: P#OTHER: Этот демон решил нарушить законы ада!

source: P#OTHER: Co zresztą uczynił w tym wypadku.
de: P#OTHER: Letztendlich tat er das auch in diesem Fall.
ru: P#OTHER: Вот он этим и занялся.

source: OTHER: Krótko mówiąc namówił naszego przyjaciela...
de: OTHER: Kurz gesagt, er überredete unseren Freund...
ru: OTHER: В общем, он убедил нашего друга...

source: P#OTHER: ...Galadora...
de: P#OTHER: ...Galador...
ru: P#OTHER: Галадора...

source: OTHER: ...do podpisania cyrografu w zamian za|życie pełne przygód i tytuł książęcy.
de: OTHER: ...einen Pakt mit dem Teufel zu unterschreiben,|im Tausch für ein Leben voller Abenteuer|und den Titel eines Prinzen.
ru: OTHER: ... Подписать пакт с дьяволом, взамен за жизнь,|полную приключений и титул принца.

source: OTHER: Krew spłynęła po kciuku na pergamin...
de: OTHER: Das Blut rann den Daumen herunter auf das Pergament...
ru: OTHER: Кровь глупца легла на пергамент...

source: P#OTHER: ...piekielny szpon został przybity...
de: P#OTHER: ...die Höllenkralle wurde eingeschlagen...
ru: P#OTHER: ... Адский пакт был подписан...

source: P#OTHER: ...zagrzmiało, błysnęło i nasz...
de: P#OTHER: ...es donnerte und blitzte und unser...
ru: P#OTHER: ... он сверкал и гремел молниями...

source: OTHER: ...Galador...
de: OTHER: ...Galador (He he he!) ...
ru: OTHER: ... А Галадор (хе хе хе)...

source: OTHER: ...a raczej jego dusza weszła w ciało nieznanego|mu, a najbliższego duchem młodego księcia tak|łatwo jak w rozkoszną kotlinkę wchodzi...
de: OTHER: ...oder besser gesagt, seine Seele, fuhr so leicht in den|Körper eines ihm unbekannten, seelenverwandten Prinzen,|als wenn sie in die lustvolle Ritze eindringen würde|(Ähem...)
ru: OTHER: ... А точнее, его душа, отправилась в тело одного неизвестного|слабого душой принца, как и было обещано...

source: P#OTHER: ...khm, zresztą nieważne...
de: P#OTHER: ...Hm, aber egal...
ru: P#OTHER: ... не неважно...

source: OTHER: Eeeee... o czym to ja... ach tak.
de: OTHER: Äääh... Worüber wollte ich noch... ach ja.
ru: OTHER: Э... О чем я? Ах, да...

source: OTHER: Nastąpiła przemiana...
de: OTHER: Es fand also eine Verwandlung statt...
ru: OTHER: Произошла подмена...

source: P#OTHER: ...ale dusza oryginalnego księcia spłynęła|prosto w chciwe diabelskie szpony i demon|rechocząc jak oszalały porwał ją do Piekła!
de: P#OTHER: ...und die Seele des echten Prinzen fuhr|geradewegs in die gierigen teuflischen Krallen...|und der Dämon entführte sie mit irrem Gelächter|in die Hölle!
ru: P#OTHER: ... А душа настоящего принца отправилась в|ад под смех демона!

source: OTHER: Nawiasem mówiąc złamał w ten sposób kilka bardzo|ważnych przepisów wyznaczonych przez samego Arcydemona.|Wydawało mu się jednak, iż ma powody do śmiechu.
de: OTHER: Nebenbei erwähnt hat er damit gegen einige sehr|grundlegende Regeln verstoßen, Regeln, die durch|den Erzdämon selbst aufgestellt worden waren!|Und er meinte noch, er hätte gut Lachen! Ha!
ru: OTHER: Но этим он нарушил некоторые очень важные правила.|Столь важные, что их устанавливал сам Верховный|Демон. А он еще смеялся! Ха!

source: OTHER: Nasz drogi Galador znalazł się bowiem na zamku|tuż przed walką z niepokonanym Czarnym Rycerzem,|słynącym z siły i okrucieństwa.
de: OTHER: Derweil fand sich unser werter Galador auf|einer Burg wieder, kurz vor einer Schlacht mit|dem bis dahin unbesiegten Schwarzen Ritter,|berüchtigt wegen seiner Stärke und Grausamkeit!
ru: OTHER: А наш приятель Галадор обнаружил себя на горе,|готовящимся к битве с непобедимым Черным Рыцарем.

source: OTHER: Cóż mógł więc zrobić?
de: OTHER: Was hätte er tun sollen?
ru: OTHER: Что ему оставалось делать?

source: OTHER: Zrobił to co każdy z was zrobiłby na jego miejscu,|gdyby nagle znalazł się w obcym ciele stojąc przed|dwa razy od siebie wyższym facetem.
de: OTHER: Er tat das, was jeder von Euch an seiner Stelle|auch getan hätte, würde er sich plötzlich in einem|fremden Körper wiederfinden und vor einem zweimal|so großen Schwarzen Ritter stehen.
ru: OTHER: Он поступил так, как поступил любой бы из нас, оказавшись|в другом теле, перед вдвое большим Черным|Рыцарем.

source: OTHER: Uciekł.
de: OTHER: Er rannte weg .
ru: OTHER: Он убежал.

source: OTHER: He he he he he...
ru: OTHER: Хе хе хе хе...

source: OTHER: Gdyby nie ja...
de: OTHER: Wenn ich nicht gewesen wäre,...
ru: OTHER: Если я еще не упоминал...

source: P#OTHER: ...cała ta historia skończyłaby się|jakąś straszną tragedią.
de: P#OTHER: ...hätte die ganze Geschichte|ein tragisches Ende genommen.
ru: P#OTHER: ... у этой истории трагический|конец...

source: OTHER: Jak zwykle przeszedłem do pieśni i legendy,|co nawiasem mówiąc, staje się już nieco nużące.
de: OTHER: Wie immer bin ich in die Legenden und Lieder|eingegangen, was mich ehrlich gesagt allmählich|ziemlich langweilt.
ru: OTHER: И вот, как обычно, в легенду вступаю я, что,|надо признаться, иногда утомляет.

source: OTHER: Kłopotliwy demon też przeszedł do legendy. A raczej|do piekielnych opowieści o okrucieństwie Lucyfera|i karach, jakie spotykają nieposłusznych podwładnych.
de: OTHER: Auch der widerspenstige Dämon ist in die Legende|eingegangen. Besser gesagt in den Höllenklatsch|über Luzifers Grausamkeit und die Strafen, die seinen|ungehorsamen Untergebenen drohen.
ru: OTHER: Но в легенду вступил и демон. Под угрозой наказания|со стороны начальства.

source: OTHER: Ostatnio naszego demona widziano jak występował w roli|głównego testera wyjątkowo wymyślnego koła tortur.
de: OTHER: Unseren Dämon soll man zuletzt in der Rolle|des Haupttesters eines sehr raffinierten Folterrades|gesehen haben.
ru: OTHER: Наш демон хотел посмотреть, как человек поведет|себя в новых, очень странных условиях, для проверки|одной новой теории.

source: OTHER: Zabawne, prawda?
de: OTHER: Spaßig, nicht wahr?
ru: OTHER: Любопытно, не так ли?

source: OTHER: Opowiedzmy po kolei o bohaterach naszej historii.
de: OTHER: Aber, ich will der Reihe nach über|die Helden unserer Geschichte berichten:
ru: OTHER: Но я продолжу с историей по порядку:

source: P#OTHER: Wrócił do dawnego ciała i nieoczekiwanie|ta jego nowa wersja spodobała się pięknej|Shandrii!
de: P#OTHER: Er ist wieder in seinen früheren Körper zurückgekehrt und|von dieser Rückverwandlung war unsere wunderschöne|Shandria erstaunlicherweise äußerst angetan!
ru: P#OTHER: Наш герой был снова возвращен в свое тело|и эта его новая версия понравилась|прекрасной Шандрии!

source: OTHER: Kobiety są nieobliczalne...
de: OTHER: Wie soll jemand diese Frauen verstehen...
ru: OTHER: Кто бы мог понять этих женщин...

source: OTHER: ...a ta kobieta jest szczególnie nieobliczalna.
de: OTHER: ...und diese Shandria ist besonders unberechenbar.
ru: OTHER: ... А Шандрия оказалась на редкость непредсказуемой.

source: OTHER: Miejmy nadzieję, że nie weźmie naszego|bohatera pod swój uroczy pantofelek.
de: OTHER: Hoffentlich nimmt sie unseren Helden nicht|unter ihre reizvollen Pantoffel.
ru: OTHER: Будем надеяться, что она не загонит|нашего героя под свой красивый каблучок...

source: OTHER: Choć znając ją i jego nie jest to wykluczone.
de: OTHER: So wie ich die beiden kenne,|ist das aber nicht auszuschließen.
ru: OTHER: Хотя это еще и возможно...

source: P#OTHER: W zasadzie mogę się nawet założyć o beczkę piwa.
de: P#OTHER: Eigentlich könnte ich darüber sogar eine Wette|um ein Bierfaß eingehen.
ru: P#OTHER: Сейчас, еще кружечку и я продолжу...

source: OTHER: Grabarz...
de: OTHER: Der Totengräber ...
ru: OTHER: Итак, копатель могил...

source: OTHER: ...z cmentarzyska koło zamku Garrahan do dzisiaj|gorąco przyjaźni się ze swoim szczurem i nazywa|go "swoim najdroższym przyjacielem". Podobno|nauczył go nawet mówić komplementy...
de: OTHER: ...vom Friedhof bei Schloß Garrahan ist|noch immer eng mit seiner Ratte befreundet.|Er nennt sie "wertester Freund". Man munkelt|er habe ihr sogar beigebracht, wie man|Komplimente macht...
ru: OTHER: ... с кладбища до замка Гаррахана он прибыл|со "своим лучшим другом" - крысой.

source: P#OTHER: ...choć w to już nie chce mi się wierzyć.
de: P#OTHER: ...obwohl mir das nicht so|glaubhaft vorkommt.
ru: P#OTHER: ... хотя мне это казалось не|очень-то убедительным...

source: OTHER: Czarodziej z miasteczka nigdy już|nie potrafił stworzyć homunkulusa...
de: OTHER: Dem Zauberer aus der Kleinstadt ist es|nicht mehr gelungen, den Homunkulus|neu zu erschaffen ...
ru: OTHER: Маленькому колдуну так и не удалось снова|создать гоммункула...

source: OTHER: ...może zadziałała tu jakaś magia...
de: OTHER: ...vielleicht hatte auch hier die Magie ihre Finger im Spiel...
ru: OTHER: ... Похоже, что магия тоже участвовала в игре...

source: OTHER: ...i załamany wyruszył szukać swego|duchowego mistrza i przewodnika.
de: OTHER: ...und niedergeschlagen machte er sich auf den Weg,|um seinen spirituellen Meister und Führer zu suchen.
ru: OTHER: ... И вот, отчаявшись, он отправился в дорогу, чтобы|поискать своего духовного наставника.

source: P#OTHER: Prędzej czy później trafi do mnie.
de: P#OTHER: Früher oder später wird er mich finden...
ru: P#OTHER: Рано или поздно, он меня найдет...

source: OTHER: Historia barda i jego żony zakończyła|się nad wyraz szczęśliwie.
de: OTHER: Die Geschichte des Barden und seiner Frau|ist außerordentlich glücklich zu Ende gegangen.
ru: OTHER: История с бардом и его женой закончилась|счастливо.

source: OTHER: W niej zakochał się bogaty kupiec z południa,|który szybko zmarł zostawiając jej cały majątek...
de: OTHER: In die Frau des Barden verliebte sich ein|reicher Kaufmann aus dem Süden, der ihr sein|ganzes Vermögen hinterließ, nachdem er starb...
ru: OTHER: В жену барда влюбился богатый купец с юга,|который и оставил ей после смерти все свое|состояние...

source: OTHER: ...w nim najmłodsza i najpiękniejsza córka|nieprzyzwoicie bogatego kasztelana.
de: OTHER: ...In den Barden verliebte sich die jüngste|und schönste Tochter eines unanständig|reichen Burgherrn.
ru: OTHER: ... В самого барда влюбилась юная дочка одного|богатого горожанина.

source: OTHER: Oboje są bardzo szczęśliwi.
de: OTHER: Beide sind sehr glücklich.
ru: OTHER: Оба очень довольны.

source: P#OTHER: Cały dwór Garrahan przyjął z ulgą i radością|swojego księcia i pana, który odzyskał ciało,|będące jego powodem dumy.
de: P#OTHER: Die Hofleute haben mit Freude und|Erleichterung ihren Prinzen und Herrn aufgenommen,|der seinen Körper, auf den er außerordentlich stolz|war, wiedergewonnen hatte.
ru: P#OTHER: Дворяне с радостью встретили своего|принца, который, чем очень гордился, вернул себе|свое тело.

source: P#OTHER: Podobno po wyposzczeniu w Piekle książę postanowił|w najbliższym czasie się ożenić, ale...
de: P#OTHER: Nach der unfreiwilligen Fastenzeit in der Hölle soll|der Prinz angeblich beschlossen haben,|bald zu heiraten, aber...
ru: P#OTHER: После невольного отдыха в аду, принц стал немного замкнутее|и чуть было не женился, но...

source: OTHER: ...ma kłopoty z wyborem pośród dziesiątek kandydatek.
de: OTHER: ...es gab da noch Probleme bei der Auswahl unter|zehn Kandidatinnen.
ru: OTHER: ... не смог выбрать из десяти кандидаток.

source: P#OTHER: Zamczysko Fjord zamieniono w skansen. Stoją tam|teraz wypchane wampiry, a na ścianach wiszą|przerażające ryciny, kołki, pęta czosnku, krzyże|i wiele innych eksponatów.
de: P#OTHER: Schloß Fjord wurde in ein Freilichtmuseum umgewandelt.|Jetzt stehen dort ausgestopfte Vampire und an den|Wänden hängen schreckenerregende Abbildungen, Pfähle,|Knoblauchkränze, Kreuze und viele andere Exponate.
ru: P#OTHER: Из замка Фьорд сделали музей и там теперь стоят чучела вампиров|и продают колья, кресты и чеснок на сувениры.

source: P#OTHER: Kiedy Pan Słońce znajduje trochę czasu unosi się nad|zamkiem Fjord i wygłasza referat zatytułowany...
de: P#OTHER: Immer wenn der Sonnenfürst Zeit findet, geht er über|Schloß Fjord auf und hält bei der Gelegenheit einen|Vortrag mit dem Titel...
ru: P#OTHER: Иногда, когда у него есть время, Солнечник спускается|в замок и читает лекцию под названием...

source: OTHER: "O pomyślnym działaniu palenia wampirów|na reumatyzm i dobre samopoczucie".
de: OTHER: "Über die gutartigen Auswirkungen von|Vampirverbrennungen bei Rheuma und|anderen Leiden".
ru: OTHER: "О положительном влиянии уничтожения вампиров|на ревматизм и отложения солей"

source: OTHER: Pustelnik opuścił swoją chałupkę|i postanowił zamieszkać w młynie...
de: OTHER: Der Einsiedler hat sein Häuschen verlassen|und ist in eine Mühle gezogen,...
ru: OTHER: Отшельник покинул свою хижину и поселился на|мельнице...

source: OTHER: ...tłumacząc wszystkim, że koło młyńskie hipnotyzuje|lepiej, niż jakiekolwiek ziele, a zepsuta mąka i mrówki|są i tak o wiele lepsze niż jego poprzednia dieta.
de: OTHER: ...wobei er allen erklärte, daß ein Mühlrad besser|in Trance versetzt als jedes Kraut und daß das|verdorbene Mehl und die Ameisen viel besser|schmecken als seine frühere Diät.
ru: OTHER: ... Где рассказывает, что медитировать на жернова куда|легче, и что мука и муравьи куда вкуснее его|предыдущей еды.

source: OTHER: Do dziś nie wiadomo, kim była kobieta w woalce...
de: OTHER: Bis zum heutigen Zeitpunkt ist unklar,|wer die Frau mit dem Schleier war...
ru: OTHER: До сих пор не ясно, кто была та женщина|с вуалью...

source: OTHER: ...ale jeden z mieszkańców miasteczka cierpiał na|straszną niestrawność przez ponad dwa miesiące.
de: OTHER: ...doch ein Bewohner unserer kleinen Stadt|hat über zwei Monate hinweg unter einer|schrecklichen Magenverstimmung gelitten.
ru: OTHER: ... но один из горожан внезапно исчез из города|при весьма странных обстоятельствах...

source: OTHER: Nieszczęśliwy krasnolud, naiwnie myślący,|że w mózgu pomieszało mu się od nadmiaru piwa...
de: OTHER: Unser unglücklicher Zwerg, der naiverweise dachte,|den Verstand wegen übermäßigen Bierkonsums|verloren zu haben ...
ru: OTHER: Наш несчастный гном, который по наивности хотел победить|на пивном конкурсе,...

source: OTHER: ...co jest przecież oczywistą brednią,|bo piwo jest zbawiennym i uzdrawiającym likworem...
de: OTHER: ...vollkommener Blödsinn übrigens, da Bier,|wie jeder weiß, ein sehr heilsames Getränk ist,...
ru: OTHER: .. глупый, будто не знал, что пиво для больших...

source: OTHER: ...zdecydował rozpocząć nowe życie.
de: OTHER: ...beschloß, ein neues Leben zu beginnen.
ru: OTHER: ... решил начать новую жизнь.

source: OTHER: A ja?
de: OTHER: Und ich?
ru: OTHER: А я?

source: OTHER: Cóż...|Nigdy nie potrafiłem usiedzieć w jednym miejscu.
de: OTHER: Was soll's...|Ich konnte noch nie an einem Platz stillsitzen.
ru: OTHER: А что я должен...|Я никогда не мог усидеть на месте.

source: OTHER: Być może poszukam dróg w czasie i przestrzeni,|aby rozwiązać zagadkę mojej śmierci.
de: OTHER: Vielleicht suche ich Wege in Raum und Zeit,|um das Rätsel meines Todes zu lösen.
ru: OTHER: Наверное, поищу дыры в пространстве и времени,|чтобы раскрыть тайну собственной смерти.

source: OTHER: Bo nie wiem czy wiecie, że zginąłem|w sposób niezwykle...
de: OTHER: Hab' ich Euch überhaupt erzählt, daß meine|Todesumstände äußerst rätselhaft...
ru: OTHER: Ибо моя смерть очень подозрительна...

source: OTHER: ...dość o tym! Szczerze mówiąc strasznie|zaschło mi w ustach.
de: OTHER: ...Schluß damit! Ehrlich gesagt|hab' ich jetzt eine ziemlich trockene Kehle.
ru: OTHER: Ладно, что-то у меня в горле пересохло!

source: P#OTHER: Jeżeli kiedyś zobaczycie mnie w karczmie|nie wahajcie się przysiąść, zwłaszcza jak|jesteście piękną blondynką.
de: P#OTHER: Wenn ihr mich einmal in einem Wirtshaus sehen|solltet, dann setzt Euch ohne weiteres zu mir,|besonders wenn Ihr eine reizende Blondine seid.
ru: P#OTHER: Если увидите меня в какой пивнушке, подсаживайтесь|смело, особенно, если вы - прекрасная блондинка!

source: OTHER: Jeżeli usłyszycie pieśń o mnie nie|wahajcie się przyłączyć do chóru.
de: OTHER: Wenn ihr einmal ein Lied über mich hören solltet,|dann stimmt nur ein...!
ru: OTHER: Если услышите обо мне песню, то учтите, что считается|только одна!

source: OTHER: O mnie powstają tylko piękne pieśni.
de: OTHER: Über mich entstehen nämlich nur die schönsten Lieder..
ru: OTHER: Обо мне, правда, сочиняют только красивые песни...

source: OTHER: Pamiętasz, ile razy wyciągałem cię z opresji?
de: OTHER: Erinnerst du dich, wie oft ich dich aus|irgendwelchen Schwierigkeiten gezogen habe?
ru: OTHER: Вы помните, как часто я всех спасал от неприятностей?

source: OTHER2: Pamiętam, już ci dziękowałam.
de: OTHER2: Sicher erinnere ich mich, ich habe mich|bei dir ja auch schon bedankt.
ru: OTHER2: Я тоже всегда о вас хорошо думал.

source: OTHER: A pamiętasz, jak byliśmy przytuleni|w jednej z tych komnat w Piekle?
de: OTHER: Und erinnerst du dich, als wir eng umschlungen|in einer der Kammern in der Hölle waren?
ru: OTHER: А помните, как мы были вместе в камере в аду?

source: OTHER2: Pamiętam. Coś nawet zacząłeś mówić...|Bałam się nawet przez chwilę, że mnie pocałujesz.
de: OTHER2: Sicher. Du warst so ... merkwürdig...|Ich hatte sogar einen Moment lang|Angst, daß du mich küssen würdest.
ru: OTHER2: Конечно. Ты была такая... Замечательная...|Я боялся, что ты меня поцелуешь...

source: OTHER: Bałaś się?! Jak to, bałaś się?!
de: OTHER: Du hattest Angst?! Wieso hattest du Angst?!
ru: OTHER: Ты боялась?! Как это, ты боялась?!

source: P#OTHER2: Och, jesteś taki głupiutki...
de: P#OTHER2: Ach, du Dummerchen...
ru: P#OTHER2: Дурашка...

source: P#OTHER: Achhh... Rozumiem.
de: P#OTHER: Hmm.
ru: P#OTHER: Хм...

source: OTHER: No, ale może jeszcze będą z ciebie ludzie.
de: OTHER: Naja, aber aus dir kann schon noch was werden.
ru: OTHER: Ну ладно, глядишь из тебя еще что и выйдет.

source: homunkulus - Nie jest najmądrzejszy, ale przynajmniej|jest magiczny.
de: Homunkulus - Er ist nicht der Klügste,|aber wenigstens magisch.
ru: Гомункул - Он не самый умный, но, по|крайней мере, магический...

source: eliksir nieśmiertelności - Aż trudno uwierzyć, że coś takiego|naprawdę istnieje.
de: Unsterblichkeitselixier - Schwer zu glauben, daß so etwas|wirklich existiert.
ru: Эликсир бессмертия - Тяжело поверить, что что-то подобное|существует.

source: kapeć - Stary, cuchnący, zgrzybiały kapeć.
de: Hausschuh - Ein stinkiger, pilzverseuchter Hausschuh.
ru: Домашний тапочек - Вонючий, заплесневевший домашний тапочек!

source: amulet - Talizman w kształcie głowy wilka.
de: Amulett - Talisman in Form eines Wolfskopfes.
ru: Амулет - Талисман в форме волчьей головы.

source: sztylet - Bardzo oryginalny, ale na pewno bardzo|niebezpieczny.
de: Dolch - Sehr originell, aber auch|wirklich sehr gefährlich.
ru: Дольх - Очень оригинально, но очень|страшно.

source: wytrychy - Nosił wilk razy kilka...
de: Dietriche - Das Handwerkzeug der Diebe...
ru: отмычки - Кто к нам с мечём придёт...

source: księga szarej magii - Szara magia?...
de: Buch der Grauen Magie - Graue Magie?
ru: Книга серой магии - Серая магия?

source: klejnot - Piękny i na pewno wart fortunę.
de: Kleinod - Wunderschön und sicherlich ein Vermögen wert.
ru: Жемчужина - Прекрасная и наверняка дорогая вещь...

source: łopata - Użyteczne narzędzie pracy.
de: Schaufel - Ein nützliches Gerät.
ru: Лопата - Очень полезный инструмент

source: fałszywe kości - Kości są tak wyważone, by zawsze|wypadała szóstka.
de: Gezinkte Würfel - Die Würfel sind so präpariert,|daß immer die Sechs fällt.
ru: Жульнический кубик - Этот кубик всегда падает шестеркой|кверху

source: książka - Cała zapisana w nieznanym mi języku.|Mnóstwo dziwnych rysunków...
de: Buch - Gänzlich in einer mir unbekannten Sprache geschrieben.|Eine Menge merkwürdiger Zeichnungen...
ru: Книга - Естественно, написанная на незнакомом языке...

source: czar - Bez cienia wątpliwości - nic z niego|nie rozumiem.
de: Verwandlungszauber - Hier gibt es keinen Zweifel -|Ich verstehe überhaupt nichts davon.
ru: Магия изменения - Я тут в сомнении... Я ни черта|не понимаю в этих вещах!

source: srebrne lustro - Jest tak gładkie, że nawet moja nowa|twarz zaczyna mi się podobać...
de: Silberner Spiegel - Er macht so glatt, daß sogar mein neues|Gesicht anfängt mir zu gefallen.
ru: Серебряное зеркало - Оно такое гладкое, что даже мое новое лицо|начинает мне нравиться

source: czar - Czar przenosin do siedziby Pana Słońce.
de: Zauber - Ein Versetzungszauber zur Residenz|des Sonnenfürsten.
ru: Волшебство - Волшебство для использования солнечных|лучей

source: lutnia - Żona barda krzyczała coś o lutni-samograjce...|Ale ta tutaj jakoś siedzi cicho...
de: Laute - Die Frau des Barden hat etwas|von einer selbstspielenden Laute gesagt...|Aber bei dieser hier tut sich nichts...
ru: Флейта - Дама рассказывала мне о самоиграющей|флейте... Но с этой у меня не получается.

source: talizman nekromanty - Przepełniony podstępną magią...
de: Talisman des Nekromanten - Prall gefüllt mit heimtückischer Magie...
ru: Талисман Некроманта - Он наполнен магией

source: szal modnisi - Po zapachu sądząc składa się po połowie|z jedwabiu i perfum.
de: Schal des modebewußten Mädchens - Dem Geruch nach zu urteilen, setzt er sich|zur Hälfte aus Seide und Parfum zusammen.
ru: Шаль модниц - Насколько я понимаю, она состоит наполовину|из духов!

source: święcona woda - Wygląda zwyczajnie, ale wiadomo - pozory|mylą.
de: Weihwasser - Sieht ganz gewöhnlich aus, aber es ist ja bekannt,|daß stille Wasser tief sind.
ru: Святая вода - Выглядит обыкновенно, но я-то знаю, что в тихом омуте|черти водятся!

source: siekiera - Latająca gilotyna.
de: Axt - Eine fliegende Guillotine.
ru: Топор - Просто летающая гильотина!

source: gałąź - Zwykła gałąź.
de: Ast - Ein gewöhnlicher Ast.
ru: Ветка - Обычная ветка

source: gałąź - Kawałek osiki.
de: Ast - Ein Espenstock.
ru: Ветка - Осиновый кол

source: zaostrzony kołek - Dobry wampir to martwy wampir. Choć chyba|wampiry i tak są martwe.
de: Angespitzter Pfahl - Nur ein toter Vampir ist ein guter Vampir.|Aber sind sie nicht sowieso schon tot?
ru: Острый! - Только мертвый вампир - хороший вампир! Но|разве они и так не мертвые?
