Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: OTHER: Zawsze uważałem ludzi za słabeuszy.
de: OTHER: Ich habe die Menschen schon immer für|Schwächlinge gehalten.
ru: OTHER: Я всегда считал людей слабаками.

source: OTHER: Nie potrafią nawet zgryźć naprawdę małego|brukowca, żeby od razu nie pluć zębami.
de: OTHER: Sie können nicht einmal einen Pflasterstein|zerbeißen, ohne gleich ihre Zähne auszuspucken.
ru: OTHER: Они даже не могут разгрызть камень, не обломав|зубов.

source: OTHER: I nawet ten tu rycerz nie zmienił mojego|zdania, ale to...
de: OTHER: Selbst dieser Ritter hier konnte meine|Meinung nicht ändern, aber das jetzt...
ru: OTHER: Даже вон тот рыцарь не смог|изменить моего мнения, но ты…

source: OTHER: To już jest niesmaczne.|Par excellence.
de: OTHER: Das ist einfach widerlich.|Abgrundtief widerlich.
ru: OTHER: Ты просто невыносим.|В высшей степени.

source: P#OTHER: Chyba jednak wskrzeszenie nawet tak groźnego|czarodzieja jak Arivald będzie lepsze niż|twoja obecność.#X1
de: P#OTHER: Selbst den furchterregenden Zauberer Arivald|aus seinem Totenschlaf zu wecken kann nicht|schlimmer sein als deine Anwesenheit.#X1
ru: P#OTHER: Даже воскрешение грозного|колдуна Аривальда не сравнится|с тобой и твоим присутствием здесь.#X1

source: OTHER: Na robale i larwy Payehu!
de: OTHER: Bei den Würmern und den Payehu-Larven!
ru: OTHER: Черви гнусные!

source: OTHER: Co tu się działo?!
de: OTHER: Was ist denn hier passiert?!
ru: OTHER: Что тут произошло⁈

source: OTHER: COŚ TY ZROBIŁ, BARBARZYŃCO?!
de: OTHER: WAS HAST DU GETAN DU BARBAR?!
ru: OTHER: ЧТО ТЫ НАДЕЛАЛ, ВАРВАР⁈

source: $0: Eeee... Eeee...
ru: $0: Эээ… Эээ…

source: $1: No co, przecież i tak wszystkie były puste!
de: $1: Was ist denn, sie waren doch sowieso alle leer!
ru: $1: Ну и что, они и так все были пустые!

source: $2: Nie mam pojęcia o czym pan mówi...
de: $2: Ich hab keine Ahnung wovon du sprichst...
ru: $2: Понятия не имею, о чём вы говорите…

source: $3: Cholerne krety, zawsze się gdzieś wkręcą...
de: $3: Blöde Maulwürfe, sie graben immer alles um.
ru: $3: Чёртовы кроты, везде и всюду копают и перекапывают.

source: OTHER: Cmentarna hiena i na dodatek debil!
de: OTHER: Eine Friedhofshyäne sein und dazu noch ein Idiot!
ru: OTHER: Мало того, что он могилы раскапывает,|он ещё и дебил вдобавок!

source: OTHER: O nie, człowieczku...
de: OTHER: Oh nein, Menschlein...
ru: OTHER: Ну уж нет, человечек…

source: OTHER: Nie ujdzie ci to na sucho...
de: OTHER: Das werde ich dir nicht durchgehen lassen...
ru: OTHER: Этого я тебе не прощу.

source: OTHER: Twoja głowa też, a jednak pewnie nie|pozwoliłbyś sobie w niej pogrzebać.
de: OTHER: Genau wie dein Kopf, aber sicherlich würdest|du es nicht begrüßen, daß man darin herumkramt.
ru: OTHER: Твоя голова тоже пуста, но|тебе бы всё равно не понравилось, если бы|кто-нибудь полез в неё с лопатой.

source: OTHER: Zresztą, hańbą byłaby dalsza dysputa...
de: OTHER: Und spar dir weitere dämliche Kommentare...
ru: OTHER: Дальше тут нет смысла дискутировать.

source: OTHER: Nawet kłamać trzeba umieć, złodzieju grobów.
de: OTHER: Auch Lügen will gekonnt sein, du Grabräuber.
ru: OTHER: Ты даже врать не умеешь, могильный вор.

source: OTHER: Mam tu dla ciebie odpowiednią karę, nędzna|kreaturo...
de: OTHER: Ich weiß eine geeignete Strafe für dich,|du elende Kreatur...
ru: OTHER: Я знаю как тебя наказать, жалкая тварь…

source: OTHER: Już od kilkuset lat nie widziałem tu|żadnego kreta.
de: OTHER: Ich habe hier schon seit hundert Jahren|keinen Maulwurf mehr gesehen.
ru: OTHER: Я здесь живу несколько веков,|и кротов ещё ни разу не видел.

source: OTHER: Za wyjątkiem tych, które przyrządzam|w piołunowym sosie.
de: OTHER: Mit Ausnahme einer verwandten Art,|die ich vorzugsweise in Gallensauce zubereite.
ru: OTHER: Хотя иногда попадаются|другого вида землеройные. Я их|обычно готовлю в полынном соусе.

source: OTHER: Więc nie sil się na kłamstwa, ty mała,|biała glisto!
de: OTHER: Und versuch nicht zu lügen, du elender bleicher Wurm!
ru: OTHER: Так что нечего тут врать, ты,|маленький бледный глист!

source: OTHER: I zaznaj smak mojej przewrotności...
de: OTHER: Nun lerne den bitteren Geschmack meiner Rache kennen...
ru: OTHER: Сейчас ты узнаешь горький вкус|моей мести…

source: OTHER: Przeklinam wszystkie rzeczy, jakie|ukradłeś z tego świętego cmentarza!
de: OTHER: Ich verfluche alle Sachen, die du von diesem|heiligen Friedhof geklaut hast!
ru: OTHER: Я проклинаю все, что ты тут нашел!

source: HERO: Dzień dobry!
de: HERO: Guten Tag!
ru: HERO: Добрый день!

source: $0: Miłe gniazdko... Z daleka od smrodu wielkich miast...
de: $0: Nettes Plätzchen! Weg vom Gestank der großen Städte.
ru: $0: Симпатичное местечко. Тут|далеко от смрада больших городов…

source: $3: Skoro jest tak źle, to co tu jeszcze robisz?
de: $3: Was machst du noch hier, wenn es so schlecht läuft?
ru: $3: Тогда что же ты тут делаешь, если всё так плохо?

source: $1: Wszystko w porządku? Dobrze się czujesz?
de: $1: Alles in Ordnung? Fühlst du dich gut?
ru: $1: Всё в порядке?

source: $2: Jeszcze wrócę, ale na razie muszę już iść.
de: $2: Ich werde zurückkommen, aber ich muß jetzt gehen.
ru: $2: Я вернусь, а сейчас мне надо идти.

source: $4: Pustelnikuje?
de: $4: Er siedelt ein?
ru: $4: Отшельничаете?

source: $5: Wariuje?
de: $5: Er wird wahnsinnig?
ru: $5: С ума сходите?

source: $6: Ucieka przed prawem?
de: $6: Läuft er vor dem Gesetz davon?
ru: $6: Скрываетесь от правосудия?

source: $7: Pokutuje?
de: $7: Er tut Buße?
ru: $7: Грехи отмаливаете?

source: $8: Nie, skąd ten pomysł?
de: $8: So war das nicht gemeint!
ru: $8: Нет, с чего вы взяли?

source: $9: Wzorcowo.
de: $9: Nein, ganz ausgezeichnet sogar.
ru: $9: Превосходно.

source: $10: Świeżego powietrza?
de: $10: An frischer Luft?
ru: $10: Свежего воздуха?

source: $11: Niedozwolonych środków dopingujących?
de: $11: An unzulässigen Dopingmitteln?
ru: $11: Запрещённых лекарственных средств?

source: $12: Ziółek?
de: $12: An Kräutern?
ru: $12: Лечебных трав?

source: OTHER: I blisko mrówek, szczypawic, komarów, szerszeni,|much, ciem, korników, glizd, larw...
de: OTHER: Und nah bei den Ameisen, Ohrkneifern, Mücken,|Hornissen, Fliegen, Nachtfaltern, Borkenkäfern,|Würmern, Maden...
ru: OTHER: И вместе с муравьями, двухвостками,|комарами, шершнями,|мухами, мотыльками,|короедами, червями,|личинками…

source: HERO: Dobrze już dobrze, zrozumiałem.
de: HERO: Ist ja schon gut, ich habe verstanden.
ru: HERO: Да-да, я понял.

source: OTHER: ...że nie wspomnę o dzikich zwierzętach, chłodzie|w zimie, powodziach wiosną, podrapaniach od...
de: OTHER: ...nicht zu vergessen die Raubtiere, die Kälte im Winter,|Überschwemmungen im Frühling, Kratzer von...
ru: OTHER: …да, ещё вспомнил о диких зверях, зимнем морозе, весенних паводках, царапинах от…

source: HERO: ZROZUMIAŁEM!#E3#B0
de: HERO: ICH HABE VERSTANDEN!#E3#B0
ru: HERO: Я ПОНЯЛ!#E3#B0

source: OTHER: Mimo wszystko bardzo dobrze.
de: OTHER: Trotz allem sehr gut.
ru: OTHER: Ну а так неплохо в остальном.

source: OTHER: Powiem więcej, czuję się jak w niebie.
de: OTHER: Um genau zu sein, ich fühle mich wie im Himmel.
ru: OTHER: Сказать по правде, вообще чувствую себя как на небесах.

source: OTHER: <głupawy chichot>#B0
de: OTHER: He, he, he, he#B0
ru: OTHER: <дурацкое хихиканье>#B0

source: OTHER: A jak ci się wydaje, co robi pustelnik?#B1
de: OTHER: Was denkst du macht ein Einsiedler?#B1
ru: OTHER: Ну а сам-то как думаешь, что ещё|может делать отшельник?#B1

source: OTHER: Tak, to ciekawe co według ciebie, młodzieńcze,|robi właściciel spółki...
de: OTHER: Tja, was soll man dazu sagen....|Ich würde sagen...
ru: OTHER: Интересный у вас ход мыслей,|молодой человек…

source: OTHER: Próbuj dalej.#B1
de: OTHER: ... einen Versuch hast du noch.#B1
ru: OTHER: Следующая попытка.#B1

source: OTHER: Bez sensu.
de: OTHER: Das ergibt doch keinen Sinn.
ru: OTHER: Бессмысленно.

source: OTHER: Czy ja wyglądam na wariata?#B2
de: OTHER: Sehe ich vielleicht wie ein Wahnsinniger aus?#B2
ru: OTHER: Я что, похож на сумасшедшего?#B2

source: OTHER: Skądże znowu! To się oczywiście czasem|zdarza, ale nie mnie.
de: OTHER: Wie kommst du denn darauf!? Freilich, so was mag es|geben... Aber ich doch nicht.
ru: OTHER: Скажешь тоже!|Может, с кем-нибудь такое и случается,|но только не со мной.

source: OTHER: Co prawda, niewielu wie o mojej pustelni,|ale to jeszcze o niczym nie świadczy.
de: OTHER: Tja, nicht viele wissen von meiner Einsiedelei,|aber das will doch noch nichts heißen.
ru: OTHER: Верно, немногие знают о|моей хижине. Однако|это ещё ни о чём не говорит.

source: OTHER: A, przy okazji, nie przypominaj o mnie|w zamku Garrahan.
de: OTHER: Ach ja, übrigens, erwähne mich lieber nicht, wenn du|ins Schloß Garrahan kommst.
ru: OTHER: Кстати, не упоминай обо мне в замке Гаррахан.

source: OTHER: Kiedyś miałem tam drobny spór dotyczący|kości.
de: OTHER: Ich hatte da mal einen kleinen Streit beim Würfelspiel.
ru: OTHER: Помнится, у меня там|как-то случился небольшой спор|об игре в кости.

source: OTHER: Strażnik twierdził, iż to dziwne, kiedy|czterdzieści trzy razy pod rząd wypada|szóstka.
de: OTHER: Der Wächter meinte, daß es verwunderlich sei,|wenn vierzig Mal hintereinander die Sechs fällt.
ru: OTHER: Стражник очень удивился, когда|сорок три раза подряд выпала шестёрка.

source: OTHER: Czyżby nie wiedział, że istnieje coś takiego|jak szczęśliwy traf?
de: OTHER: Der hatte noch nie was von einer Glückssträhne|gehört, das ist alles.
ru: OTHER: Он что, совсем не знал о существовании|такой вещи, как удача?

source: OTHER: No, ale odeszliśmy od pytania. Więc|czym się zajmuje pustelnik?#B1
de: OTHER: Jetzt sind wir aber von unserer Frage abgekommen.|Also womit beschäftigt sich ein Einsiedler?#B1
ru: OTHER: Однако мы отошли от темы.|Так чем же занимается отшельник?#B1

source: OTHER: Tak jest, mój panie!
de: OTHER: So ist es, mein Herr!
ru: OTHER: Точно так, мой господин!

source: OTHER: Pokutuje!
de: OTHER: Er büßt!
ru: OTHER: Каюсь в грехах!

source: OTHER: Jestem tu, by zdławić wszelkie grzeszne|myśli, które palą me ciało niby żywy|ogień!
de: OTHER: Ich bin hier, um die sündigen Gedanken|zu verarbeiten. Sie verbrennen mich sonst|wie lebendiges Feuer!
ru: OTHER: Я здесь, чтобы подавить свои греховные мысли,|которые жгут моё тело словно огнём.

source: OTHER: Bynajmniej nie jest to grzech oszustwa,|nie dawaj wiary plotkom opowiadającym|o tej historii...
de: OTHER: Es handelt sich keineswegs um die Sünde des Betrugs,|gib nichts auf die Gerüchte, die überall erzählt|werden...
ru: OTHER: Речь не идет о грехе обмана, не верьте сплетням о той истории…

source: OTHER: ...jak to spotkało się dwóch zacnych|mieszczan, aby założyć spółkę kupiecką.
de: OTHER: ...über die zwei ehrenwerten Städter,|die sich zusammengefunden hatten, um eine|GmbH zu gründen.
ru: OTHER: …в которой два знатных горожанина|организовали совместный бизнес.

source: OTHER: Jeden miał mnóstwo pieniędzy, a drugi za|to spore doświadczenie.
de: OTHER: Der Eine hatte eine Menge Geld|und der Zweite viel Erfahrung.
ru: OTHER: У одного было много денег, а у другого|много опыта.

source: OTHER: Po pewnym czasie role się jednak zmieniły|i pierwszy miał wielkie doświadczenie,|a drugi jego pieniądze.
de: OTHER: Am Ende war es genau umgekehrt.|Der Erste hatte viel Erfahrung gemacht|und der Zweite hatte dafür dessen Geld.
ru: OTHER: Но под конец роли поменялись: первый|набрался опыта, а у второго|оказались все деньги.

source: OTHER: Zresztą tylko do czasu niesprawiedliwego|wyroku.
de: OTHER: Allerdings nur bis zu dem Zeitpunkt|eines äußerst ungerechten Urteils.
ru: OTHER: А потом всё поменял один крайне несправедливый|приговор.

source: P#OTHER: Eeee... Ten tego... Więc nie ufaj oszczerstwom,|bo ja jestem tutaj tylko i wyłącznie by walczyć|ze słabościami swego ciała i duszy.
de: P#OTHER: Eeee... Also...|Gib nichts auf diese Verleumdungen,|ich bin ausschließlich wegen der Schwäche|des menschlichen Körpers hier, um für meine |Seele zu kämpfen.
ru: P#OTHER: Это… Того… Так что не верь|слухам и клевете. Я здесь только за тем, чтобы|бороться со слабостями моих тела и души.

source: P#OTHER: Na razie jest dwa zero dla słabości, ale|to się wkrótce zmieni!#B0
de: P#OTHER: Im Moment steht es zwei zu null für die Schwäche,|aber ich arbeite daran!#B0
ru: P#OTHER: На данный момент слабости ведут со счётом 2:0.|Но скоро всё изменится!#B0

source: OTHER: Brbrłełe...
de: OTHER: Brbrlele...
ru: OTHER: Блурбл…

source: P#OTHER: No właśnie.#B1
de: P#OTHER: Na also.#B1
ru: P#OTHER: Именно.#B1

source: OTHER: E tam...
de: OTHER: Nun ja...
ru: OTHER: Вот…

source: OTHER: To tylko złudzenie.
de: OTHER: Das kommt alles von...
ru: OTHER: Это лишь видение.

source: OTHER: Wszystko przez ten nadmiar...
de: OTHER: ...von einem Überfluß an...
ru: OTHER: Всё из-за переизбытка…

source: OTHER: ...nadmiar...
de: OTHER: ...einem zu viel an...
ru: OTHER: …переизбытка…

source: OTHER: ...hmmm...
ru: OTHER: …этого…

source: OTHER: ...nadmiar...#B3
de: OTHER: ...wie soll ich...#B3
ru: OTHER: …как его там…#B3

source: OTHER: O, świeżego powietrza. Właśnie.
de: OTHER: Oh, ja, zu viel frische Luft. Du sagst es.
ru: OTHER: А, свежего воздуха. Точно.

source: OTHER: A więc pustelnik?...#B1
de: OTHER: Also, der Einsiedler?...#B1
ru: OTHER: Итак, отшельник?#B1

source: OTHER: Dopingujących może, ale dozwolonych.
de: OTHER: Dopingmittel ist nicht falsch, aber nur legale...
ru: OTHER: Может и лекарственных,|но только разрешённых.

source: OTHER: Co prawda może nie wszędzie...
de: OTHER: Naja, vielleicht nicht überall legalisiert...
ru: OTHER: Ну, может и не везде разрешённых…

source: OTHER: No, ale wracajmy do głównego tematu.
de: OTHER: Also, kehren wir zum Thema zurück.
ru: OTHER: Вернемся к главной теме.

source: OTHER: E tam, to żaden zgubny nałóg.
de: OTHER: Ach was, das Kraut macht doch nicht süchtig.
ru: OTHER: То есть к теме вредных привычек.

source: OTHER: W każdej chwili mogę to rzucić.
de: OTHER: Ich kann jederzeit damit aufhören.
ru: OTHER: Я могу завязать в любой момент.

source: OTHER: W końcu robiłem to już tysiące razy.
de: OTHER: Schließlich habe ich das schon tausend Mal gemacht.
ru: OTHER: Я уже тысячу раз это делал.

source: OTHER: "Z przyczyn znanych tylko Naszemu Królewskiemu|Majestatowi, a które publicznie ujawnione|zostać nie mogą..."
de: OTHER: "Aus Gründen, die nur Unserer Königlichen Majestät|bekannt sind, und welche nicht öffentlich|bekannt gemacht werden können..."
ru: OTHER: "По причинам, которые известны только|Нашему Королевскому Величеству,|и которые не могут быть раскрыты публично…"

source: OTHER: "...Nasz Syn od dnia dzisiejszego nie może być| uważany za Naszego Syna."
de: OTHER: "...wird unser Sohn vom heutigen Tage an|nicht mehr als unser Sohn betrachtet werden."
ru: OTHER: "…Наш Сын с этого дня больше не считается|Нашим Сыном."

source: OTHER: "Niniejszym rozkazujemy wymazać jego imię ze|wszelkich ksiąg i dokumentów, ogłaszamy, iż nie|ma on prawa do Naszej korony i majątku..."
de: OTHER: " Hiermit ordnen wir an, daß sein Name aus|allen Büchern und Dokumenten ausradiert wird|und geben kund, daß er kein Recht|auf unsere Krone und Eigentum hat..."
ru: OTHER: "Тем самым Мы приказываем удалить его имя|из всех книг и документов, и объявляем, что|он больше не имеет права|на корону и имущество."

source: OTHER: "...a nawet do przebywania na terenie Królestwa.|Jego imię ma być zapomniane. Nigdy już nie|przyjmiemy go pod nasz dach."
de: OTHER: "...selbst zum Aufenthalt auf dem Gebiet des|Königreiches. Sein Name soll vergessen werden.|Wir werden ihn niemals mehr unter|unserem Dach empfangen."
ru: OTHER: "Ему запрещено находиться на территории Королевства.|Его имя должно быть забыто. Никогда|больше мы не примем его под свой кров."

source: OTHER: "Jego Wysokość Król, ple-ple-ple."
de: OTHER: "Seine Hoheit, König bla-bla-bla."
ru: OTHER: "Его Высочество, Король такой-то."

source: OTHER: Thank you, drive through.
de: OTHER: Danke! Weitermachen!.
ru: OTHER: Спасибо за внимание.

source: OTHER: Ciekawe kto wymyślił ten głupi dowcip.|Czego się gapicie? Wracać do roboty,|przecież nic się nie stało!
de: OTHER: Würde mich interessieren, wer sich|diesen Blödsinn ausgedacht hat.|Was glotzt ihr so? Geht zurück an die|Arbeit, es ist überhaupt nichts passiert!
ru: OTHER: Интересно, кто придумал эту глупость?|Ну, чего уставился? Продолжай|работу, здесь не на что смотреть!

source: HERO: Ładna dzisiaj pogoda.
de: HERO: Schönes Wetter heute.
ru: HERO: Сегодня хорошая погода.

source: OTHER: Mhm...
ru: OTHER: Хм...

source: HERO: To dobry dzień, by rozpocząć|nowe życie.
de: HERO: Ein guter Tag, um ein neues Leben|zu beginnen.
ru: HERO: Хороший день, чтобы начать новую жизнь.

source: OTHER: Jasne...
de: OTHER: Klar...
ru: OTHER: Конечно…

source: HERO: Znaleźć pracę.
de: HERO: Eine Arbeit finden.
ru: HERO: Найти работу.

source: OTHER: Taaa...
de: OTHER: Jaaa...
ru: OTHER: Даа…

source: P#HERO: P-r-a-c-ę.
de: P#HERO: A-r-b-e-i-t.
ru: P#HERO: Р-а-б-о-т-у.

source: OTHER: Tak tak...
de: OTHER: Ja ja...
ru: OTHER: Да-да…

source: $0: Twój książę mówi do ciebie!
de: $0: Dein Prinz spricht mit dir!
ru: $0: Твой принц говорит с тобой!

source: $1: Jak zdołałeś upaść tak nisko...
de: $1: Wie konntest du nur so tief sinken...
ru: $1: Как ты только мог так низко пасть…

source: $2: Paluszki swędzą, dobry człowieku?
de: $2: Kribbelt es dir in den Fingern, guter Mensch?
ru: $2: У тебя что, пальцы чешутся?

source: $3: Do zobaczenia.
de: $3: Auf Wiederschaun.
ru: $3: До свидания.

source: $4: ...dlaczego tak postępujesz?
de: $4: ...warum tust du so was?
ru: $4: …почему ты так себя ведёшь?

source: $5: ...a nie lepiej spróbować czegoś dokładnie odwrotnego?
de: $5: ...wie wäre es ganz neu anzufangen?
ru: $5: ... Давай попробуем сначала?

source: OTHER: Mhm.
de: OTHER: Pff...
ru: OTHER: Ммм.

source: HERO: Ignorujesz mnie?
de: HERO: Gut. Ich werde später mit dir reden.
ru: HERO: Игнорируешь меня?

source: OTHER: Nie... Nie nie... W ogóle...
de: HERO: Jetzt habe ich wichtigere Dinge zu tun.
ru: OTHER: Нет… Нет-нет… Совсем нет…

source: HERO: Dobrze. Porozmawiam z tobą później.
de: OTHER: Sicher...
ru: HERO: Ладно. Поговорим позже.

source: HERO: Teraz mam ważniejsze rzeczy do roboty.
de: HERO: Drachen töten, Jungfrauen befreien,|die Kontinuität der Dynastie sicherstellen.
ru: HERO: Теперь у меня есть более важные дела.

source: OTHER: Na pewno...
de: OTHER: Mhm...
ru: OTHER: Конечно…

source: HERO: Zabić smoka, uratować dziewicę,|zapewnić ciągłość dynastii.
de: HERO: Grrhm.
ru: HERO: Убить дракона, спасти деву, продолжить|королевский род.

source: HERO: Grhm.
ru: HERO: Гхрм.

source: OTHER: To nie takie trudne.
de: OTHER: Das ist gar nicht so schwer.
ru: OTHER: Это не так уж и сложно.

source: OTHER: Trzeba dużo pić, nie przychodzić do pracy,|nie szanować szefa i klientów, napastować|żony notabli...
de: OTHER: Man muß nur viel trinken, nicht zur Arbeit kommen,|den Chef und die Kunden anpöbeln und ihre|Ehefrauen anbaggern...
ru: OTHER: Надо много пить, не ходить на работу,|не уважать начальника и заказчиков,|приставать к чужим жёнам…

source: HERO: Eee...
de: HERO: Eeee...
ru: HERO: Эээ…

source: OTHER: ...wylegiwać się całymi dniami, nie myć, nie|strzyc, nie czesać, nie zmieniać ubrania|przez tygodnie...
de: OTHER: ...ganze Tage im Bett liegen, sich nicht waschen,|sich die Haare nicht schneiden, sich nicht kämmen,|Wochenlang die Kleider nicht wechseln...
ru: OTHER: …целыми днями валяться в постели, не мыться,|не стричься, не причёсываться,|неделями не менять одежду…

source: OTHER: ...smarkać ludziom na czubki butów i chuchać|im prosto w twarz, kiedy nie myje się zębów.
de: OTHER: ...den Leuten auf die Schuhspitzen rotzen|und ihnen voll ins Gesicht hauchen, wenn|man sich die Zähne nicht geputzt hat.
ru: OTHER: …плевать людям на ботинки и дышать им в лицо перегаром.

source: OTHER: Bułka z masłem.
de: OTHER: So einfach ist das. Das kann jeder.
ru: OTHER: Просто как два пальца.

source: HERO: Miałem raczej na myśli pytanie...#B1
de: HERO: Ich hatte eher eine andere Frage im Sinn...#B1
ru: HERO: Вообще я вот о чём хотел спросить.#B1

source: OTHER: Nie, ale lubię lepić kulki.
de: OTHER: Nein, aber ich rolle gerne Kügelchen.
ru: OTHER: Не, я просто люблю шарики катать.

source: OTHER: Z nosa, z brudu między palcami,|mnie tam obojętne.
de: OTHER: Aus der Nase, aus dem Schmutz unter den|Fingernägeln, das ist mir ganz gleich.
ru: OTHER: Или из носа, или из-под ногтей, мне без разницы.

source: OTHER: Takie małe hobby.
de: OTHER: So ein kleines Hobby von mir.
ru: OTHER: Такое вот небольшое хобби.

source: HERO: Błe!#B0
de: HERO: Bäh!#B0
ru: HERO:Фу-у!#B0

source: OTHER: Bo lepiej być fałszywym wyrzutem sumienia|niż prawdziwym wyrzutkiem społeczeństwa.
de: OTHER: Lieber ein schlechtes Gewissen haben,|als ein richtiger Auswurf der Gesellschaft sein
ru: OTHER: Лучше уж быть ложным неудачником, чем истинным изгоем.

source: P#HERO: Że co?
de: P#HERO: Bitte was?
ru: P#HERO: Что, простите?

source: OTHER: Ja też nie rozumiem, ale niezłe, nie?#B0
de: OTHER: Ich verstehe es auch nicht, aber nicht schlecht, oder?#B0
ru: OTHER: Я сам не до конца понимаю, но ведь круто же звучит?#B0

source: OTHER: E tam, kto by chciał bułkę bez masła.#B0
de: OTHER: Ich gehöre nicht zu den rastlosen Gesellen,|die sich ständig verändern wollen.#B0
ru: OTHER: Что толку быть белкой в колесе.#B0

source: $0: Cóż takiego zrobiłeś, biedaku?
de: $0: Was hast du denn getan, du Ärmster?
ru: $0: Что же ты натворил, бедолага?

source: $7: Więc powiadasz, nieszczęśliwcze, żeś niewinny?
de: $7: Du sagst also, Unglücklicher, daß du unschuldig bist?
ru: $7: Так ты уверяешь меня, несчастный, что ты невиновен?

source: $8: Za cóż konkretnie cię zakuto?
de: $8: Wofür hat man dich eigentlich genau in Ketten gelegt?
ru: $8: За что же именно тебя заковали в кандалы?

source: $1: Widzę, że podglądasz grę kupców?
de: $1: Ich sehe, daß du das Spiel der Kaufleute belauerst?
ru: $1: Я вижу, ты наблюдаешь за игрой торговцев?

source: $2: Nie odchodź, zaraz wracam...
de: $2: Geh nicht weg, ich komme gleich wieder...
ru: $2: Не уходи, я скоро вернусь…

source: $3: Naprawdę naprawdę?
de: $3: Wirklich?
ru: $3: Правда?

source: $4: Jakoś ci nie wierzę.
de: $4: Irgendwie glaube ich dir nicht.
ru: $4: Что-то я тебе не очень верю.

source: $5: Więc jesteś tu bezprawnie?
de: $5: Also bist du hier zu Unrecht?
ru: $5: То есть ты невинно осуждённый?

source: $6: Niezła sztuczka, ale ja się nie nabiorę.
de: $6: Ach, ich laß mich von dir nicht reinlegen.
ru: $6: Хороший трюк, но меня так не проведёшь.

source: $9: I zaręczasz swoim honorem?
de: $9: Schwörst du bei deiner Ehre?
ru: $9: Ты готов поклясться честью?

source: $10: I dajesz za to głowę?
de: $10: Würdest du auch deinen Kopf dafür hergeben?
ru: $10: Ты готов дать голову на отсечение?

source: $11: Masz jakiś dowód swojej niewinności?
de: $11: Hast du irgendeinen Beweis deiner Unschuld?
ru: $11: У тебя есть доказательства своей невиновности?

source: $12: Chcesz, bym wstawił się za tobą u króla?
de: $12: Willst du, daß ich mich beim König für dich einsetze?
ru: $12: Ты хочешь, чтобы я заступился за тебя перед королём?

source: $13: A był w pobliżu ktoś jeszcze inny?
de: $13: War denn noch jemand anderes in der Nähe?
ru: $13: Был ли рядом ещё кто-то?

source: $14: Szczerze mówiąc, dowód dość trudny do obalenia...
de: $14: Ehrlich gesagt, der Beweis ist sehr schwerwiegend...
ru: $14: Честно говоря, доказательство неубедительное.

source: $15: Faktycznie, to żaden dowód.
de: $15: Tatsache, das ist kein Beweis.
ru: $15: На самом деле это вообще не доказательство.

source: $16: Czyli zostałeś kozłem ofiarnym?
de: $16: Also haben sie dich zum Sündenbock gemacht?
ru: $16: Так тебя сделали козлом отпущения?

source: $17: Wyglądasz na uosobienie dobroci i łagodności.
de: $17: Du siehst aus wie die Gutmütigkeit in Person
ru: $17: Ты выглядишь как само воплощение доброты и мягкости.
