Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: rulonik - To może być coś fascynującego albo|...kompromitującego...
de: Gerollter Brief - Das kann etwas Interessantes oder gar...|Kompromittierendes sein...
ru: Письмо - Это может быть интересно, или| даже компрометирующе.

source: linka - Pasek dla ubogich.
de: Schnur - Ein Gürtel für Arme.
ru: Шнур - Для бедных

source: kufel - Iście krasnoludzki rozmach.
de: Bierkrug - Echter Zwergenprunk.
ru: Кружка - Настоящий гном.

source: nieznajoma - Bardzo tajemnicza osóbka...
de: Unbekannte - Eine sehr geheimnisvolle Person...
ru: Неизвестный - Таинственная персона

source: drzwi - Z powrotem do rynku.
de: Tür - Zurück zum Markt
ru: Дверь. - Назад на рынок

source: alchemik - Palce pożółkłe od kwasów, oczy oślepłe|od czytania ksiąg - oto prawdziwy|fachowiec!
de: Alchimist - Von Säure verätzte Finger,|vom Bücherlesen blind gewordene|Augen - das ist ein echter Fachmann!
ru: Алхимик - Цветные от химикатов пальцы и| слепые от книг глаза. Вот настоящий| специалист!

source: księga - Zapewne zbiór alchemicznych przepisów.
de: Buch - Wahrscheinlich eine Sammlung|alchimistischer Rezepte.
ru: Книга - Собрание алхимических рецептов.

source: dziwne stworzenie - Wygląda jak mały człowieczek, ale|jest w nim coś magicznego...
de: Merkwürdiges Geschöpf - Es sieht wie ein kleines Männchen aus,|doch es ist etwas Magisches an ihm...
ru: Существо - Оно похоже на маленького человечка,| но в нем есть что-то магическое.

source: homunkulus - Biedaczysko... Jak wielu z nas, widzi|tylko część problemu, i dlatego nie|potrafi znaleźć rozwiązania.
de: Homunkulus - Armer Kerl... Wie wir alle bemerkt|auch er nur einen Teil des Problems und|kann deswegen die Lösung nicht finden.
ru: Гомункулс - Бедный парень. Он видит лишь одну| сторону проблемы и не может| найти решения.

source: jaszczur - Przyszły obiad czy obiekt eksperymentów?|A może ukochana maskotka?
de: Echse - Zukünftiges Mittagessen oder|Versuchskaninchen? Vielleicht auch|nur ausgefallenes Kuscheltier?
ru: Рептилия - Обычная закуска, или жертва эксперимента?

source: półka - Mnóstwo różnych preparatów i ksiąg.
de: Regal - Eine Menge verschiedener|Präparate und Bücher
ru: Полка - Куча препаратов и книг

source: krzesło - Im dłużej się w nie wpatruję tym bardziej|uświadczam się w przekonaniu, iż jest to|krzesło.
de: Stuhl - Je länger ich ihn beobachte,|desto fester bin ich davon|überzeugt, daß es ein Stuhl ist.
ru: Стул - Чем дольше я на него смотрю, тем| больше убеждаюсь, что это| стул.

source: księga - "Transmutacja - nowa moda czy realna szansa?"
de: Buch - "Transmutation - Modegag|oder reelle Chance?"
ru: Книга - "Трансмутация - Мода, или шанс?"

source: pergaminy - Rozmaite notatki alchemika, mnóstwo|akademickiego żargonu.
de: Pergamente - Diverse Notizen des Alchimisten,|eine Menge Gelehrtenjargon.
ru: Пергамент - Записки алхимика: куча жаргона.

source: rozmaite tajemnicze urządzenia - Albo to jest jakiś naukowy eksperyment,|albo mamy do czynienia z klasyczną|nalewką z ziemniaków.
de: Rätselhafte Dinge - Entweder ist es ein wissenschaftliches|Experiment oder wir haben es hier mit|einer klassischen Kartoffelsuppe zu tun.
ru: Странная вещь - Или это - хитрый эксперимент,| или обычный картофельный суп.

source: zegar - Być może jest to magiczny chronometr|odmierzający czas do końca świata.+A może po prostu ktoś oddał zegar do|reperacji.
de: Uhr - Mag sein, daß es ein magischer|Chronometer ist um die Zeit zu messen,|die zum Weltuntergang geblieben ist.+Vielleicht hat jemand auch einfach|die Uhr reparieren lassen.
ru: Часы - Это может оказаться магическим| хронометром...

source: wyjście - Powrót z alejki na obrzeża rynku.
de: Ausgang - Rückweg von der Allee zum Markt.
ru: Выход. - Назад на рынок

source: wyjście - Z powrotem między kupieckie stragany.
de: Ausgang - Zurück zu den Ständen|der Händler.
ru: Выход. - Назад к прилавкам торговцев

source: drzwi - Drzwi do mieszkania barda.
de: Tür - Tür zur Wohnung des Barden.
ru: Дверь. - Дверь в квартиру барда

source: znak - Albo bard jest bardzo poważany w tym mieście,|albo uważa, że trochę autoreklamy nigdy nie|zaszkodzi.
de: Logo - Entweder ist der Barde eine wichtige|Person in der Stadt, oder er ist der|Meinung, daß ein bißchen Eigenwerbung|niemals schaden kann.
ru: Логотип - Или бард - очень важная персона| в городе, или он просто считает,| что немного пыли в глаза| еще никому не вредило.

source: balkon - Bardzo romantyczne miejsce...+Księżycowa noc, smutna melodia fletu|unosząca się pod niebiosa...*+Tylko ta wyprana bielizna trochę|psuje wrażenie.
de: Balkon - Ein sehr romantischer Ort...+Eine Mondnacht, eine traurige Flötenmelodie|die sich zum Himmel emporhebt...*+Nur die gewaschene Wäsche stört|ein bißchen den Eindruck.
ru: Балкон - Очень романтичное место...

source: stary wóz - Kompletna ruina.
de: Alter Wagen - Totaler Schrott.
ru: Старая повозка - Совсем развалилась...

source: kot - Typowy piecuch.
de: Katze - Typischer Ofenhocker.
ru: Кошка - Типичный хищник

source: słowik - Ludzie prości nazwą to stworzenie słowikiem,|ludzie znający związki przyczynowo-skutkowe|powiedzą, iż to koci obiad.
de: Nachtigall - Einfache Menschen werden dieses Geschöpf|Nachtigall nennen. Menschen hingegen, die das|Verhältnis von Ursache und Wirkung verstehen,|wissen, daß es ein Katzen-Mittagessen ist.
ru: Соловей - Некоторые называют их соловьями.| Те же, кто знает жизнь, -| кошачьим завтраком.

source: rupiecie - Różne starocie, nowością wyróżnia się|tylko lutnia.
de: Trödel - Altes Gerümpel, neu ist nur|die Laute.
ru: Барахло - Все очень старое, кроме одной| флейты

source: szlafmyca - Że też musiała utkwić akurat w takim|miejscu!
de: Schlafmütze - Daß sie gerade an solch|einem Ort hängenbleiben mußte!
ru: Ночная рубашка - И это должно висеть в таком месте!

source: szlafmyca - Że też dorośli ludzie noszą takie|rzeczy na głowie!...
de: Schlafmütze - Daß erwachsene Leute so etwas|auf dem Kopf tragen!...
ru: Ночная рубашка - И взрослые люди могут носить такое| на голове!

source: kobieta - Zastanawiam się ile musieliby mi zapłacić,|żebym zechciał...+Nie, nie, nie... to zbyt obrzydliwe.
de: Frau - Ich überlege gerade, wieviel sie mir|zahlen müßten, damit ich...+Nein, nein, nein... viel zu eklig.
ru: Женщина - Я вот прикидываю, сколько бы ей| пришлось мне заплатить, чтобы....

source: zamek - Klasyka. Tak mały, że znalezienie go|graniczyło z cudem.
de: Schloß - Typisch. Das Käfigschloß ist|so klein, daß es schon fast an ein|Wunder grenzt, es zu finden.
ru: Замок - Как всегда. Он настолько маленький,| что его совсем не видно.

source: słowik - Biedny ptak...
de: Nachtigall - Armer Vogel...
ru: Соловей - Бедная птичка...

source: klatka - Co za okrucieństwo i brak gustu!
de: Käfig - Das ist grausam und geschmacklos!
ru: Птичья клетка - Какой кошмар!

source: flakonik - Flakonik z dziwnym płynem.
de: Flakon - Fläschchen mit einer merkwürdigen|Flüssigkeit.
ru: Флакон - Сосуд с какой-то красивой жидкостью.

source: wyjście - Schodki w dół.
de: Ausgang - Die Treppe nach unten.
ru: Выход. - Лестница вниз.

source: wyjście na balkon - Wolę nie kręcić się w pobliżu|gaci barda.
de: Ausgang auf den Balkon - Besser ich bleibe in einer|sicheren Entfernung zur|Unterhose des Barden.
ru: Выход на балкон - Я лучше буду держаться на безопасном| расстоянии.

source: stół - Rękopisy, pióro, tusz i butelka wina.+Wszystko, czego artysta potrzebuje do|tworzenia.*+Może jednak za mało wina.
de: Tisch - Manuskripte, eine Feder,|Tinte und eine Weinflasche.+Alles, was ein Künstler|zum Schöpfen braucht.*+Zu wenig Wein vielleicht.
ru: Стол - Манускрипты, перья, чернила и| Метта ка вина.

source: miotła - Na pewno środek lokomocji żony barda.
de: Besen - Auf jeden Fall ist er|ein Kommunikationsmittel|der Frau des Barden.
ru: Метла - Это - средство убеждения жены| барда.

source: lustro - Całe brudne i porysowane. Nic dziwnego, że|żona barda wygląda jak wygląda...
de: Spiegel - Er ist völlig dreckig und zerkratzt.|Kein Wunder, daß die Frau des Barden|so aussieht wie sie aussieht...
ru: Зеркало - Все рассохлось, рассыпается и| разваливается. Не удивительно,| что жена барда выглядит так,| как она выглядит....

source: wyjście - Wyjście na drogę.
de: Ausgang - Ausgang auf den Weg.
ru: Выход. - Выход на дорогу

source: przejście - Widać kręte, wąskie schody w dół.
de: Durchgang - Schmale Wendeltreppe nach unten.
ru: Проход - Маленькая лестница вниз

source: wyjście - Powrót na górę.
de: Ausgang - Hier geht es wieder nach oben.
ru: Выход. - А вот и снова вверх

source: sztandar - Jeden w wielu przedmiotów w tym miejscu,|który wygląda jak nowy, ale czuć od|niego dziwną starość...
de: Fahne - Einer von vielen Gegenständen an dem Ort,|der zwar wie neu aussieht, dem man aber|den Hauch des Alters anmerkt.
ru: Знамя - Один из многих предметов, выдающих| истинный возраст этого места.

source: okno - O, widać stąd miasteczko...
de: Fenster - Oh, von hier aus sieht man|das Städtchen...
ru: Окно - Ой, отсюда можно видеть городок....

source: dziwne znaki - Nie mam pojęcia, co ten napis oznacza.
de: Seltsame Zeichen - Ich habe keine Ahnung,|was diese Inschrift bedeutet.
ru: Странные знаки - Я не могу даже представить, что| бы это могло значить....

source: runy - Hmmm... Ciekawe, czy to jakiś rodzaj zaklęcia.
de: Runen - Hmmm... Interessant, ob|das vielleicht ein Zauber ist?
ru: Руны - Хм... Интересно, может это- колдовство?

source: runy - Wiem, co to znaczy, ale nie chcę mówić na głos,|bo się znowu pojawi duch bóstwa i mogą być|kłopoty.
de: Runen - Ich weiß, was da steht, aber ich werde|es nicht laut aussprechen, denn sonst taucht|der Geist dieser Gottheit auf, das kann|nur wieder Probleme geben.
ru: Руны - Я знаю, что там стоит, но я не| буду назвать это в слух. Поскольку| дух старого божества может| еще задать хлопот.

source: ołtarz - Przypomina tron jakiegoś wyjątkowo|wojowniczo usposobionego króla.
de: Altar - Sieht aus wie der Thron eines besonders|kriegerisch gesinnten Königs.
ru: Алтарь - Похоже на трон одного очень воинственного| короля.

source: wyjście - Ścieżka do miasteczka.
de: Ausgang - Weg in die Stadt.
ru: Выход. - Дорога в город

source: przetarta lina - Budynek i okolica są wyraźnie niedoinwestowane.
de: Zerfranstes Seil - Es fällt auf, daß in das Gebäude|und die Umgebung kaum investiert wird.
ru: Старый парус - Похоже, что в это здание и его| окружение совсем не делали инвестиций.

source: ptaszysko - Nie wiem, co to za ptak, ale ma|cztery jaja.
de: Häßlicher Vogel - Ich weiß nicht, was das für|ein Vogel ist, jedenfalls|hat er vier Eier.
ru: Адская птица - Я не знаю, что это за птица, но| у нее четыре глаза.

source: strażnik - Albo hodował wąsy przez dwadzieścia|lat, albo podkleił pod nosem zdechłą|wiewiórkę.+Tak czy inaczej, robi wrażenie.
de: Wächter - Entweder ließ er seinen Schnurbart|20 Jahre lang wachsen oder er hat sich ein|totes Eichhörnchen unter die Nase geklebt.+Schon allein damit schindet er Eindruck.
ru: Стражник - Или он уже годами не стриг усы,| или у него в носу померло пару| змей.

source: godło zamku - G... Zapewne od "Garrahan".*+Nie ma to jak umiejętność wyciągania|prawidłowych wniosków.
de: Schloßwappen - G... wahrscheinlich von "Garrahan"|abgeleitet.*+Es gibt nichts Erhabeneres als|die Fertigkeit, richtige|Schlußfolgerungen zu ziehen.
ru: Замковый герб - Г... Наверное, от слова "Гаррахан"

source: brama zamkowa - Prowadzi wprost na zamkowy dziedziniec.
de: Schloßtor - Es führt direkt zum Schloßhof.
ru: Ворота - Ведут в замковый двор.

source: wyjście - Widać schody w dół na dziedziniec zamkowy.
de: Ausgang - Man sieht die Treppe nach|unten zum Schloßhof.
ru: Выход. - Можно увидеть лестницу вниз.

source: sztandar - Ponoć są już kraje, gdzie|taki orzeł ma koronę.
de: Fahne - Es soll Länder geben,|wo so ein Adler eine Krone trägt.
ru: Знамя - Может, где-то и есть земли, где| его сыновья носят короны...

source: zbroja - W środku ciemno i duszno, ale za to|ni miecz, ni kop w klejnoty nie|straszny.
de: Rüstung - Darin ist es heiß und dunkel,|doch weder ein Schwertschlag noch|ein Fußtritt in die Weichteile können|einem etwas anhaben.
ru: Обмундирование - Там горячо и темно, и я не думаю,| что туда стоит идти.

source: drzwi - Wyglądają zwyczajnie. Pewnie są od jakiejś|zwyczajnej komnaty.
de: Tür - Sie sieht durchschnittlich aus.|Es ist sicher die Tür eines ganz|gewöhnlichen Zimmers.
ru: Дверь. - Она прозрачна. Просто комнатная| дверь.

source: drzwi - Drzwi do jaskini smoka.
de: Tür - Tür zur Drachenhöhle.
ru: Дверь. - Дверь в пещеру дракона

source: zbroja - Taka zbroja to jest bardzo fajna rzecz.+Jak się człowiek wywróci, od razu służy|za trumnę.
de: Rüstung - So eine Rüstung ist|eine feine Sache.+Wenn der Mensch darin|hinfällt, kann man sie sofort|als Sarg benutzen.
ru: Обмундирование - Хорошо иметь такие вещи

source: zamek - Kolejny zamek do zdobycia.
de: Schloß - Das nächste Schloß|das geöffnet werden muß.
ru: Замок - Следующий замок надо открыть.

source: drzwi do skarbca - Impregnowane drewno wzmocnione żelaznymi|ćwiekami.+Nie do wyważenia. Nawet dla niedźwiedzia.
de: Tür zur Schatzkammer - Imprägniertes Holz,|verstärkt mit Eisennieten.+Sie ist nicht aufzubrechen.|Nicht einmal von einem Bären.
ru: Дверь в камеру - Дерево, усиленное железом.

source: wejście do skarbca - Droga do szczęścia stoi otworem.
de: Eingang zur Schatzkammer - Der Weg zum Glück steht offen.
ru: Вход в камеру - Дорога к счастью открыта

source: wyjście - Przejście z dziedzińca na podzamcze.
de: Ausgang - Ausgang aus dem Schloßhof|nach draußen.
ru: Выход. - Выход наружу.

source: drzwi - Nie mam pojęcia, co się za nimi kryje.
de: Tür - Keine Ahnung, was sich|dahinter befindet.
ru: Дверь. - Не могу представить, что там может| быть.

source: drzwi - Sądząc po znaku, prowadzą do skarbca.
de: Tür - Dem Zeichen nach zu urteilen,|führt sie zur Schatzkammer.
ru: Дверь. - Если верить знакам, она ведет| камере пыток.

source: tarcza - Drewniana... Hm... Pewnie niewiele|z niej było pożytku.
de: Schild - Aus Holz... Hm... Es wurde|sicher wenig benutzt.
ru: Щит. - Из дерева... Чм... Этим точно| мало пользовались...

source: drzwi - Droga do króla.
de: Tür - Weg zum König.
ru: Дверь. - Дорога к королю.

source: drzwi - Jedyne, które nie mają klamki.+Nic dziwnego, skoro kryją drogę|do skarbca.
de: Tür - Die einzige Tür ohne Klinke.+Kein Wunder, denn sie verbirgt|den Weg zur Schatzkammer.
ru: Дверь. - Единственная дверь без замка.

source: łańcuch - Arivald oddał mi niedźwiedzią przysługę|skuwając mnie tak mocnym łańcuchem.
de: Kette - Arivald hat mir einen Bärendienst|erwiesen, als er mich mit einer|starken Kette angekettet hat.
ru: Прутья - Аривальд приговорил меня к службе| медведем, заточив меня в| клетку.

source: zerwany łańcuch - Trochę nadszarpnięty, ale coś tam|jeszcze z niego zostało.
de: Zerrissene Kette - Ein bißchen mitgenommen,|doch es ist noch etwas|davon übriggeblieben.
ru: Оборванная цепь - От нее еще что-то осталось.

source: skrzynia z ciuchami - Z daleka niespecjalnie dokładnie widać,|a póki dziewczę zajęte jest sobą,|lepiej zostanę na miejscu.
de: Kiste mit Kleidern - Von weitem sieht man|nicht so genau, ob das Mädchen|mit sich selbst beschäftigt ist,|also bleibe ich lieber hier.
ru: Сундук одеждой - Отсюда не очень хорошо видно,| занята ли девушка, так что я| лучше останусь тут.

source: okno - Nie chcę podchodzić, lepiej, żeby|dziewczę pozostało skupione na sobie.
de: Fenster - Ich werde mich besser nicht nähern.|Das Mädchen soll sich weiter auf sich|selbst konzentrieren.
ru: Окно - Я лучше не буду приближаться.| Пусть девушка не отвлекается.

source: złota klatka - Lepiej nie będę oglądał tej klatki|z bliska, bo jeszcze dziewczę zechce|mi się dokładniej przyjrzeć...+Zresztą, klatka i tak jest pusta.
de: Goldener Käfig - Lieber komme ich dem Käfig nicht|zu nahe, sonst wird das Mädchen|mich genauer anschauen wollen...+Im übrigen ist dieser Käfig leer.
ru: Золотой ларец - Лучше я подходить не буду, а то| девушка меня заметит...

source: lustro - Że też jeszcze nie pękło...
de: Spiegel - Daß der noch nicht zerbrochen ist...
ru: Зеркало - То, что еще не разбито

source: portret - Młody, przystojny, podobny do szympansa.
de: Porträt - Jung und wohlgestaltet|wie ein Schimpanse.
ru: портрет - Молодой, симпатичный, похож на шимпанзе.

source: brzydka dziewczyna - Ponoć był taki podróżnik, który brał na|długie wyprawy najbrzydszą dziewczynę|w okolicy.+Kiedy po miesiącach pobytu na pustkowiu|dziewczyna zaczynała mu się podobać|wiedział, że czas wracać do ludzi.+Ale gdyby miał tę dziewczynę u boku...+...nigdy byśmy go już nie zobaczyli...
de: Häßliches Mädchen - Man erzählt sich von einem Wanderer,|der auf lange Reisen immer das häßlichste|Mädchen aus der Gegend mitnahm.+Wenn sie ihm nach langen Monaten|des Aufenthaltes in der Einöde|zu gefallen begann, dann wußte er,|daß es an der Zeit war, zurückzukehren.+Aber wenn er Sheila an seiner Seite|gehabt hätte,+...wäre er wohl nie|zurückgekehrt...
ru: Красивая девушка - Рассказывают о смелых путешественников,| которые всегда встречают| таких девушек на своем| пути.

source: Sheila - Ponoć był taki podróżnik, który brał na|długie wyprawy najbrzydszą dziewczynę|w okolicy.+Kiedy po miesiącach pobytu na pustkowiu|dziewczyna zaczynała mu się podobać|wiedział, że czas wracać do ludzi.+Ale gdyby miał Sheilę u boku...+...nigdy byśmy go już nie zobaczyli...
de: Häßliches Mädchen - Man erzählt sich von einem Wanderer,|der auf lange Reisen immer das häßlichste|Mädchen aus der Gegend mitnahm.+Wenn sie ihm nach langen Monaten|des Aufenthaltes in der Einöde|zu gefallen begann, dann wußte er,|daß es an der Zeit war, zurückzukehren.+Aber wenn er Sheila an seiner Seite|gehabt hätte,+...dann wäre er wohl|nie zurückgekehrt...
ru: Красивая девушка - Рассказывают о смелых путешественников,| которые всегда встречают| таких девушек на своем| пути.

source: wstążki - Lubię ozdoby, ale wstążki w łóżku to już|chyba lekka przesada.
de: Schleifen - Ich mag Ausgefallenes, aber|Schleifen im Bett sind doch|wohl ein wenig übertrieben.
ru: Ленты - Я люблю необычное, но эта вещь| в кровати - мне кажется перебором.

source: łoże - Jest tak obrzydliwie słodkodziewczęcoróżowe,|że chyba wolałbym spać na podłodze.
de: Großes Bett - Es ist so scheußlich und rosafarben,|daß ich wohl lieber auf dem Fußboden|schlafen würde.
ru: Большая кровать - Она такая роскошная и украшенная,| что я лучше бы на полу поспал...

source: skóra - U-hu. Chyba z niedźwiedzia...
de: Fell - Uuh! Wahrscheinlich|ein Bärenfell...
ru: Ковер - Ого! Какой странный коврик!

source: sekretera - Pfuj, same babskie rzeczy.
de: Sekretär - Pfui, das ist ja|lauter Weiberkram.
ru: Секретер - Фу!

source: wyjście - Droga do normalnego świata.
de: Ausgang - Zurück zur normalen Welt.
ru: Выход. - Назад в нормальный мир.

source: wyjście - Wyjście stąd jest, ale po co?
de: Ausgang - Der Ausgang ist vorhanden,|aber wohin?
ru: Выход. - Вот и выход. Только куда?

source: tabliczka - Podręczna pomoc królewskiego rachmistrza.
de: Kleine Tafel - Handliches Hilfsmittel|des königlichen Rechenmeisters.
ru: Маленькая доска - Вспомогательное средство счетовода

source: skrzynia pełna skarbów - O mamo mamo mamo...+...Mamo...mamo...mamo...+...Mamo...mamo...mamo...*+Ad infinitum.
de: Schatzkiste - Oh Gott...+...Oh ja!+...Ja!
ru: Сундук - О боже...

source: lustro - Niestety, sama rama.
de: Spiegel - Leider nur der Spiegelrahmen.
ru: Зеркало - К сожалению, только маки...

source: kobierzec - Szyty grubymi, złotymi nićmi.
de: Teppich - Aus groben goldenen Fäden|gewebt.
ru: Ковер - Вытканный из золотых нитей.

source: miecze w beczce - Stłoczone jak śledzie, ale piękne,|zdobione rubinami na głowni miecze.
de: Schwerter im Faß - Sie stecken dicht aneinandergedrängt|wie Heringe im Faß, doch sie sind schön|und ihre Griffe sind mit Rubinen besetzt.
ru: Мечи в бочке - Они запиханы в бочку как сардины,| хотя их рукояти украшены| рубинами.

source: tarcza - Model dziecięcy.
de: Schild - Kinderausführung.
ru: Щит. - Детские вещи

source: skrzynka - Gdybym ją oworzył, miałbym... miałbym...+...zmarnowany rok na liczenie dukatów.
de: Kiste - Wenn ich sie geöffnet hätte,|dann hätte ich... dann hätte ich...+... ein Jahr für das Zählen|der Dukaten verloren.
ru: Сундук.. - Если я это открою...

source: skrzynia pełna złota - O mamo...+Kupiłbym sobie za to...+O, mamo, czego ja bym sobie|za to NIE kupił?
de: Kiste voller Gold - Oh Gott...+Dafür würde ich mir ...+Oh, Gott, was ich mir nicht alles|hätte dafür kaufen können!?
ru: Сундук с золотом - О боже...

source: zbroja - Nie wiem, co to jest, ale zbroja|wykonana jest z ciemnoniebieskiej,|podobnej do kryształu materii.
de: Rüstung - Ich weiß nicht, aus was sie ist, aber|die Rüstung wurde aus einer dunkelblauen,|kristallähnlichen Substanz gefertigt.
ru: Обмундирование - Я не знаю из чего это сделано,| но это - какая-то темно-синяя| кристаллическая субстанция.

source: skrzynia - Śliczna, zgrabna skrzynka z eleganckim|wiekiem.
de: Kleinodienkiste - Schöne, zierliche Kiste mit einem|eleganten Deckel.
ru: Суедук с одеждой - Красивый шкаф с украшениями

source: księgi - Skoro znajdują się w takim miejscu, to pewnie|są wiele warte...+Może opowiadają o sztuce czarodziejskiej?+Albo są rodowymi pamiętnikami pełnymi|namiętności i zbrodni?*+No cóż, mogą też być zwykłe księgi|rachunkowe.+Albo spis mieszkańców królestwa.+Eee tam, na pewno nic ciekawego.
de: Bücher - Da sie an so einem Ort liegen,|müssen sie sehr viel wert sein...+Vielleicht handeln sie von|der Zauberkunst?+Oder es sind die Tagebücher|einer vornehmen Familie voller|Intrigen und Verbrechen?*+Na ja, es können auch ganz|gewöhnliche Rechnungsbücher sein.+Oder auch das Einwohnerverzeichnis|des Königreiches.+Sicher nichts wichtiges.|
ru: Книги - Раз они лежат тут, они, наверное,| очень дорогие.

source: zasłona - Chroni skarbiec przed wzrokiem ciekawskich|ptaków?...
de: Vorhang - Schützt er etwa die Schatzkammer|vor neugierigen Vögeln?...
ru: Занавеска - Для защиты от любопытных птиц?

source: pusta skrzynka - W środku nie ma nic więcej.
de: Leere Kiste - Darin gibt es weiter nichts.
ru: Пустой шкаф - Там ничего нет.

source: wyjście - Z powrotem na ścieżkę.
de: Ausgang - Zurück zum Pfad.
ru: Выход. - Назад

source: zamek - Dziwny ten zamek. Porozrzucany po|całej okolicy.
de: Schloß - Ein merkwürdiges Schloß.|Es ist über die ganze|Umgebung verteilt.
ru: Замок - Интересный замок. Он доминирует| над окрестностями.

source: brama zamkowa - Wejście w czeluście zamczyska...
de: Schloßtor - Eingang in den Schlund|des Schlosses...
ru: Ворота - Вход в закрома замка.

source: posąg - Gdybym powiedział, że jest trochę|przerażający byłoby to za dużo.*+Za dużo o słowo "trochę".
de: Standbild - Ein Standbild, das wohl ein|bißchen abschreckend aussehen|soll.*+Darauf falle ich nicht herein.
ru: Картина - Монумент. Или так его замышляли.

source: posąg - Może i wygląda jak wykuty z kamienia,|ale mój tyłek ma inne zdanie.
de: Standbild - Vielleicht sieht es ja wie|aus Stein gehauen aus, aber mein|Hintern ist jetzt anderer Meinung.
ru: Картина - Похоже на камень, но моя задница| другого мнения.

source: łuska - Nie mam pojęcia, czyja to łuska.
de: Schuppe - Keine Ahnung, wessen|Schuppe das ist.
ru: Чешуя - Не имею ни малейшего понятия,| чья это чешуя.

source: brama zamkowa - Jedyna droga ucieczki...
de: Schloßtor - Der einzige Fluchtweg...
ru: Ворота - Единственный путь к бегству.

source: drzwi - Wejście do wylęgarni potworów.
de: Tür - Eingang zum Monster-Bruthaus.
ru: Дверь. - Вход в монстроидальный дом...

source: przejście - Wąski most prowadzący do drugiej części zamczyska.
de: Durchgang - Schmale Brücke zu einem|anderen Teil des Schlosses.
ru: Проход - Маленький мостик в другую часть| замка.

source: kościotrup - Jakiś śmiałek nie zdążył uciec...
de: Skelett - Diesem Wagemutigen ist es|nicht gelungen, zu flüchten...
ru: Скелет - Этому несчастному убежать не удалось...
