Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: OTHER: Na przykład zamiana brylantów w węgiel.|Odwrotnie, banał, a tu proszę...
de: OTHER: Zum Beispiel die Verwandlung von Brillanten in Kohle.|Umgekehrt wäre es banal, und da haben wir es schon...
ru: OTHER: Например, превращение бриллиантов в уголь. Вот наоборот,|это банально...

source: OTHER: Pozwolisz, że wrócę do lektury.
de: OTHER: Du hast wohl nichts dagegen, daß ich mich|wieder meiner Lektüre widme.
ru: OTHER: Ты не против, если я возьму свою книгу?

source: HERO: Nie chcę mu przeszkadzać, zanim nie|będę dokładnie wiedział, w czym ta|księga może mi pomóc.
de: HERO: Ich will ihn nicht stören,|bis ich nicht genau weiß, wobei|mir dieses Buch helfen kann.
ru: HERO: Я не буду мешать, пока я не|узнаю, зачем она мне нужна.

source: HERO: Czy poznałeś kiedyś Pana Słońce?
de: HERO: Hast du den Sonnenfürsten einmal kennengelernt?
ru: HERO: Ты уже выучил первые солнечные стихи?

source: OTHER: Och, kiedyś mieliśmy okazję się spotkać.
de: OTHER: Och, wir hatten schon mal das Vergnügen
ru: OTHER: Мне уже хватит.

source: OTHER: Co chciałbyś wiedzieć?
de: OTHER: Was möchtest du wissen?
ru: OTHER: Что ты хочешь знать?

source: $0: Jak się do niego dostać?
de: $0: Wie kann ich zu ihm gelangen?
ru: $0: Как я могу туда попасть?

source: $1: Znasz go osobiście?
de: $1: Kennst du ihn persönlich?
ru: $1: Ты его знаешь лично?

source: $2: Kim on jest?
de: $2: Wer ist er denn?
ru: $2: Кто он?

source: $3: Naukowe.
de: $3: Die wissenschaftliche...
ru: $3: Научно...

source: $4: Po ludzku.
de: $4: Die verständliche...
ru: $4: В общем...

source: OTHER: To bardzo proste.#X1
de: OTHER: Das ist sehr einfach.#X1
ru: OTHER: Это просто...#X1

source: OTHER: Prosiłem go kiedyś, by poświecił mocniej|nad krasnoludzkimi kopalniami Ghorlargu.|Bardzo niemiłe miejsce.
de: OTHER: Ich habe ihn einmal darum gebeten, stärker|über den Zwergenminen von Ghorlarg zu leuchten.|Ein sehr unangenehmer Ort.
ru: OTHER: Я однажды слышал о подземных шахтах Гхорларга.|Очень неприятное место.

source: OTHER: Była tam fabryka krasnoludzkiego spirytusu,|i kiedy kadź pękła, wszyscy zostali zalani.
de: OTHER: Es gab dort eine Fabrik für Zwergenspiritus|und als das Spiritusfaß platzte,|haben sich alle zugeschüttet.
ru: OTHER: Там есть фабрика гномьего спирта.

source: OTHER: Zalani dosłownie i w przenośni.
de: OTHER: Zugeschüttet im wörtlichen wie im übertragenen Sinn.
ru: OTHER: Там однажды все по пьяни забыли где выход.

source: OTHER: I nikt nie mógł znaleźć drogi do|wyjścia, a w środku było mało|powietrza.
de: OTHER: Und niemand konnte den Ausgang finden|und drinnen gab es kaum mehr Luft.
ru: OTHER: И у них кончился воздух.

source: OTHER: Nie można było wejść z pochodniami,|bo groziło to wybuchem.
de: OTHER: Es war unmöglich, mit Fackeln hineinzugehen,|denn es bestand Explosionsgefahr.
ru: OTHER: А потом от факела все взорвалось.

source: OTHER: Reszty już się domyślasz.#B0
de: OTHER: Den Rest kannst du dir sicher denken.#B0
ru: OTHER: Остальное можешь представить.#B0

source: OTHER: Jakie chcesz wyjaśnienie, naukowe|czy zrozumiałe?#B1
de: OTHER: Welche Erklärung wäre dir lieber:|die wissenschaftliche oder die verständliche?#B1
ru: OTHER: Что тебе приятнее услышать: научное|или понятное объяснение?#B1

source: OTHER: Steruje centralną gwiazdą naszego|systemu planetarnego, zwaną|popularnie Słońcem.#B0
de: OTHER: Er steuert den Zentralstern unseres|Planetensystems, der gemeinhin|Sonne genannt wird.#B0
ru: OTHER: У нашей системы есть центральная заезда,|которую называют солнцем.#B0

source: OTHER: Steruje tym małym, żółtym kółeczkiem,|od patrzenia w które bolą oczka.#B0
de: OTHER: Er bewegt diese kleine gelbe Kugel am Himmel,|bei deren Betrachtung einem die Augen weh tun.#B0
ru: OTHER: Оно двигает этими серыми кружочками на небе, от|которых еще глаза болят.#B0

source: HERO: Wyrwałeś kartkę z książki?!
de: HERO: Du hast das Blatt aus dem Buch ausgerissen?!
ru: HERO: Это ты вырвал страницу из книги?

source: OTHER: Księga to narzędzie, a nie cel|sam w sobie.
de: OTHER: Das Buch ist ein Werkzeug und kein Ziel|an sich.
ru: OTHER: Эта книга - инструмент, а не цель.

source: OTHER: To prosty czar. Nie wiedziałem wcześniej,|że można skrócić drogę do Pana Słońce.
de: OTHER: Dieser Zauber ist einfach. Ich wußte nicht, daß es|möglich ist, den Weg zum Sonnenfürsten abzukürzen.
ru: OTHER: Эта магия проста. Я и не знал, что можно так сократить|дорогу.

source: HERO: Skrócić?
de: HERO: Eine Abkürzung?
ru: HERO: Сокращение?

source: OTHER: Zwykle można tam się dostać tylko|drogą magiczną.
de: OTHER: Normalerweise kann man nur auf dem|Weg der Magie dorthin gelangen.
ru: OTHER: Нормально, туда можно попасть только|с помощью магии.

source: OTHER: Ten czar tworzy coś w rodzaju|miejsca przenosin.
de: OTHER: Der Zauber erzeugt so etwas ähnliches|wie einen Übertragungsort.
ru: OTHER: Эта магия описывает способ перемещения.

source: HERO: Dzięki.
de: HERO: Oh, ich danke dir.
ru: HERO: О, спасибо.

source: HERO: Widzę, że schowałeś księgę.|Koniec studiów?
de: HERO: Wie ich sehe, hast du das Buch beiseite gelegt.|Schluß mit den Studien?
ru: HERO: Я вижу, что ты отложил книгу. Все, конец занятиям?

source: OTHER: Nauka jest wieczna, a piwo wietrzeje.
de: OTHER: Das Wissen ist ewig, das Bier dagegen wird schal.
ru: OTHER: Знания иссушают, пиво наполняет...

source: OTHER: "Nikt cię tu nie chciał ani zapraszał|Rozgniewasz mnie nie na żarty|Wysil więc rozum i daj mi dowód|Żeś czasu mego jest warty."
de: OTHER: "Niemand hat dich hergebeten oder eingeladen.|Du wirst mich nicht zum Spaß verärgern.|Deswegen strenge mal deinen Grips an und beweise mir,|daß du meine Zeit wert bist."
ru: OTHER: "Никто тебя не звал, так что тебе придется доказать,|что ты достоин моего времени"

source: OTHER: "Wskaż moich braci".
de: OTHER: "Zeige meine Brüder".
ru: OTHER: "Покажи моих братьев"

source: OTHER: "Wskaż wrogów Ziemi".
de: OTHER: "Zeige die Feinde der Erde".
ru: OTHER: "Покажи врага Земли"

source: OTHER: "Wskaż moich przyjaciół".
de: OTHER: "Zeige meine Freunde".
ru: OTHER: "Покажи моих друзей"

source: HERO: Wskaż moich braci?...
de: HERO: Zeige meine Brüder?...
ru: HERO: Показать моих братьев?

source: HERO: Wskaż wrogów Ziemi?...
de: HERO: Zeige die Feinde der Erde?...
ru: HERO: Показать врагов Земли?

source: HERO: Wskaż moich przyjaciół?...
de: HERO: Zeige meine Freunde?...
ru: HERO: Показать моих друзей?

source: HERO: Przepraszam, Panie Słońce, czy mógłbyś podarować|trochę swego cennego czasu?
de: HERO: Sonnenfürst, könnten Sie mir|einen Moment Ihrer wertvollen Zeit schenken?
ru: HERO: Вы не могли бы подарить мне момент|Вашего времени?

source: OTHER: Mmmm... Znowu...
de: OTHER: Mmmm... Schon wieder einer...
ru: OTHER: Ммм... Еще один...

source: OTHER: To już drugi w ciągu ostatniego tysiąclecia.
de: OTHER: Das ist schon der zweite im letzten Jahrtausend.
ru: OTHER: Этот уже второй за последние тысячу лет.

source: OTHER: O co chodzi?
de: OTHER: Worum geht's?
ru: OTHER: В чем дело?

source: $0: Jest taki zamek spowity wiecznymi ciemnościami...
de: $0: Es gibt da ein Schloß in ewiger Dunkelheit.
ru: $0: Есть один замок в вечном мраке.

source: $4: Ale tam musi stać się dzień!
de: $4: Es muß dort einfach wieder Tag werden!
ru: $4: Хочу, чтобы там снова был день!

source: $1: Drugi? A kto był przede mną?
de: $1: Wer war denn vor mir hier?
ru: $1: А кто был до меня?

source: $2: Bardzo miło.
de: $2: Sie haben es ja ganz reizend hier.
ru: $2: У вас тут много народу бывает!

source: $3: Przepraszam za kłopot, na razie to wszystko.
de: $3: Verzeihen Sie mir, das wäre im Moment alles.
ru: $3: Извините, на данный момент у меня все.

source: OTHER: O nie, tylko nie Fjord...
de: OTHER: Oh nein, nicht Fjord...
ru: OTHER: О нет, только не Фьорд...

source: HERO: Skąd pan wie?!
de: HERO: Woher wissen Sie das?!
ru: HERO: Откуда вы знаете?

source: OTHER: Bo to jedyne miejsce na świecie, gdzie|nie dochodzi Słońce podczas swojej|normalnej wędrówki.
de: OTHER: Das ist die einzige Stelle auf der Welt, wo|die Sonne bei ihrer üblichen Reise|nicht hinreicht.
ru: OTHER: Это единственное место на земле, куда не заглядывает|солнце.

source: HERO: I zawsze tak było?
de: HERO: War das immer so?
ru: HERO: Так всегда было?

source: OTHER: Oczywiście, że nie zawsze! Co za pytanie!
de: OTHER: Natürlich nicht! Was für eine Frage!
ru: OTHER: Конечно нет!

source: OTHER: Od kilkuset lat, a może dłużej hmm... żyje tam|sprytny nekromanta, którego czary spowodowały|ten godny pożałowania incydent.
de: OTHER: Seit mehreren hundert Jahren oder vielleicht|noch länger, hmm... , lebt dort ein schlauer Nekromant,|dessen Zaubereien diesen bedauerlichen Zustand|heraufbeschwörten.
ru: OTHER: Всего-то пару сотен лет...

source: HERO: Co do nekromanty, to czas teraźniejszy|jest już chyba nieaktualny.
de: HERO: Was den Nekromanten angeht, ist die Präsensform|wohl nicht mehr aktuell.
ru: HERO: Что касается Некроманта, то использование настоящего|времени более не актуально.

source: HERO: Co do Fjord, nie ma szans, żeby tam|wpuścić trochę światła?
de: HERO: Was Fjord betrifft, ist es denn nicht möglich, da|ein bißchen Licht hereinzulassen?
ru: HERO: Что касается Фьорда, нельзя ли, чтобы там хоть ненадолго|стало светло?

source: OTHER: Jest, ale do tego musiałby być spełniony|pewien niesamowicie trudny warunek.
de: OTHER: Es ist schon möglich, doch es muß eine|äußerst schwierige Bedingung erfüllt sein.
ru: OTHER: Можно? но для этого надо неслабо поработать.

source: HERO: Jaki? Zgadzam się z góry na wszystko!
de: HERO: Was für eine Bedingung? Ich gehe auf alle Bedingungen|im voraus ein.
ru: HERO: Что за условие? Я согласен на все.

source: OTHER: Musiałoby mi się chcieć.
de: OTHER: Ich müßte Lust dazu haben.
ru: OTHER: Мне нужно желание для этого.

source: P#HERO: A konkretnie?
de: P#HERO: Was heißt das ... konkret?
ru: P#HERO: А поконкретнее?..

source: OTHER: Szczerze mówiąc, nawet mi się nie chce|mówić o tym, dlaczego mi się nic nie chce.
de: OTHER: Ehrlich gesagt habe ich sogar nicht mal Lust zu erzählen,|weswegen ich zu nichts Lust habe.
ru: OTHER: Мне не очень-то хочется рассказывать, почему у меня нет желания.

source: OTHER: Więc pozwól mi drzemać dalej.#E4#B0
de: OTHER: Laß mich jetzt weiter schlummern.#E4#B0
ru: OTHER: Оставь меня в покое.#E4#B0

source: OTHER: Był taki jeden wielki czarodziej, który chciał|znaleźć legendarne źródło spirytusu|w opuszczonej kopalni krasnoludzkiej.
de: OTHER: Es gab einmal einen großen Zauberer,|der eine legendäre Spiritusquelle in einer|verlassenen Zwergenmine finden wollte.
ru: OTHER: Был однажды один великий волшебник, который|хотел найти заброшенный перегонный|аппарат в одной гномьей шахте...

source: OTHER: Zrobili z kumplami wyprawę, ale jak jeden|wszedł do środka z pochodnią, to od oparów był|wybuch i zostały z niego sznurówki.
de: OTHER: Er und seine Kameraden suchten die Mine auf. Doch als|einer mit einer Fackel hineinging, kam es wegen der Aus-|dünstungen zur Explosion und lediglich seine Schnürsenkel|sind daraus mit einem blauen Auge davongekommen.
ru: OTHER: Он и его друзья обыскали всю шахту, пока один из них|не взорвался от огня факела. А его внук почти ослеп.

source: OTHER: Więc wymarudził u mnie oświetlenie jaskiń,|a że miał argumenty, to się zgodziłem.
de: OTHER: Schließlich wollte er mir eine Höhlenbeleuchtung|abschwätzen, und da er gute Argumente hatte,|stimmte ich zu.
ru: OTHER: Он захотел, чтобы там стало темно и его аргументы|мне понравились.

source: HERO: Jakie argumenty?
de: HERO: Was für Argumente?
ru: HERO: Что за аргументы?

source: OTHER: Podzielił się ze mną tym szlachetnym|trunkiem, i jeszcze dołożył magiczny|most.
de: OTHER: Er hat dieses edle Getränk mit mir geteilt und|hat mir diese magische Brücke dazugegeben.
ru: OTHER: Он поделился со мной выпивкой и подарил мне несколько|магических вещей.

source: OTHER: Tak, tak, Awiwat to specjalista od|zabezpieczeń.
de: OTHER: Ja, ja, Avivat ist ein Spezialist für|Sicherungssysteme.
ru: OTHER: Да, да, Авиват - специалист по системам|безопасности.

source: HERO: Awiwat? Może Arivald?
de: HERO: Avivat? Meinst du vielleicht Arivald?
ru: HERO: Авиват? Вы имеете в виду Аривальда?

source: OTHER: Może i Aribalt, nie pamiętam.#B0
de: OTHER: Vielleicht auch Aribalt, ich weiß nicht mehr.#B0
ru: OTHER: Может и арибальт, не помню.#B0

source: OTHER: Wszystko może się znudzić, mój|chłopcze.
de: OTHER: Alles kann langweilig werden, mein|Junge.
ru: OTHER: Все может стать скучным, мой друг.

source: OTHER: Nawet szemrzący strumyk, zielone|drzewa i soczyste owoce.
de: OTHER: Sogar ein plätschernder Bach, grüne|Bäume und saftiges Obst.
ru: OTHER: Даже зеленая трава и сладкие фрукты.

source: HERO: Ale te dwie piękne istoty|z wachlarzami...
de: HERO: Aber die zwei schönen Wesen|mit den Fächern...
ru: HERO: Но есть две прекрасные вещи...

source: OTHER: Nawet i one. Nawet i one...
de: OTHER: Am Ende sogar sie...
ru: OTHER: Но под конец...

source: P#HERO: Mam to jeszcze przed sobą.#B0
de: P#HERO: Wirklich traurig ... und schwer zu verstehen.#B0
ru: P#HERO: Все это очень грустно... и непонятно...#B0

source: OTHER: Tu na górę dochodzi niewiele dźwięków.|Jestem spragniony muzyki.
de: OTHER: Hier herauf dringen nur wenig Klänge.|Aah, ich vermisse die Musik.
ru: OTHER: Тут только мало звуков... Ах, мне не хватает|музыки!

source: OTHER: Tak, muuuzyka.
de: OTHER: Musiiiiik. Klänge... Apropos Klänge...
ru: OTHER: Музыки!

source: OTHER: Ale ludzka mowa to nie jest to, co|tygrysy lubią najbardziej.
de: OTHER: ...den Klang der menschlichen Stimmen zähle|ich nun gerade nicht zu den Wohllauten....|Mit anderen Worten...
ru: OTHER: ... Но звуки человеческой речи я не считаю|столь благозвучными. Другими словами...

source: OTHER: Więc nie musisz szybko wracać.#E3
de: OTHER: ...du brauchst dich hier so schnell nicht|wieder blicken zu lassen.#E3
ru: OTHER: Тебе не стоит быстро возвращаться.#E3

source: OTHER: Ja nic nie muszę.
de: OTHER: Ich muß überhaupt nichts.
ru: OTHER: Я ничего никому не должен.

source: OTHER: A jak jeszcze raz wrzaśniesz, to|spopielę cię i rzucę jako nawóz|dla trolli.#B0
de: OTHER: Und wenn du mich noch einmal anschreist, verbrenne|ich dich zu Asche und werfe dich den Trollen zum Fraß|vor.#B0
ru: OTHER: И если ты на меня будешь кричать, я тебя спалю в пепел!|И брошу на закусь тролям!#B0

source: HERO: Hi babe...
ru: HERO: Привет...

source: HERO: Gdybym powiedział ci o czym myślę pewnie|byś się obraziła.
de: HERO: Falls ich dir sagen würde, was ich denke,|würdest du sicher erröten.
ru: HERO: Если я не скажу тебе, о чем я думаю, ты никогда|не угадаешь.

source: OTHER: Czego?
de: OTHER: Was willst du?
ru: OTHER: Чего ты хочешь?

source: OTHER: Akwizytorom łamię karki,|a żebrakami karmię psy.
de: OTHER: Hausierern drehe ich den Hals um|und Bettler verfüttere ich an die Hunde.
ru: OTHER: Я скормлю тебя собакам.

source: OTHER: Jakieś pytania?
de: OTHER: Noch Fragen?
ru: OTHER: Еще вопросы?

source: OTHER: Co jest, zapomniałeś języka|w gębie?
de: OTHER: Na, bist du vielleicht auf den Mund gefallen?
ru: OTHER: Ты что, прикусил язык?

source: OTHER: Znowu!?
de: OTHER: Schon wieder!?
ru: OTHER: Опять?!

source: P#HERO: Khm.
de: P#HERO: Ähem.
ru: P#HERO: Ахем

source: $0: Jestem księciem.
de: $0: Ich bin ein Prinz.
ru: $0: Я - принц.

source: $1: Zapukałem tak tylko, z ciekawości.
de: $1: Ich habe nur so geklopft, aus Neugier.
ru: $1: Я так, из любопытства.

source: $2: Mogę wejść?
de: $2: Darf ich hereinkommen?
ru: $2: Можно войти?

source: $3: Do widzenia.
de: $3: Auf Wiedersehen.
ru: $3: До свидания.

source: OTHER: Tylko dlatego jeszcze żyjesz.
de: OTHER: Nur deswegen lebst du noch.
ru: OTHER: Только поэтому ты еще жив.

source: OTHER: A teraz poszedł stąd!
de: OTHER: Und nun mach', daß du fortkommst!
ru: OTHER: Я знал, что ты придешь!

source: OTHER: Ciekawość to pierwszy stopień|do Piekła.
de: OTHER: Neugier ist der erste Schritt|zur Hölle.
ru: OTHER: Любопытство - первый шаг к аду!

source: HERO: Kiedy ja właśnie chcę do Piekła!
de: HERO: Wirklich!? Genau da will ich hin!
ru: HERO: Правда?

source: P#OTHER: Chyba już wolę akwizytorów, niż|idiotów.
de: P#OTHER: Uff! Dann lieber noch die Hausierer|als solche Idioten.
ru: P#OTHER: Уфф! Лучше уж собакам, чем такие идиоты...

source: OTHER: Tylko spróbuj, to wyjdziesz stąd|nogami do przodu.
de: OTHER: Ha! Versuch es nur und du wirst nicht|lebend davonkommen.
ru: OTHER: Ха! Попробуй только, и тебе не выжить!

source: OTHER: "Dłoń ma, co jeszcze dotyku twego nie znała| Nieśmiała, lecz ogniem dzikim płonąca| Sunie po aksamicie cudnego ciała| Ja modlę się, by pieściła cię bez końca!"
de: OTHER: "Meine Hand, die deine Berührung noch nicht kannte|Schüchtern, doch mit wildem Feuer glühend|gleitet über seidige Haut so wunderschön|Ich bete, daß ewig sie dich berühren könnte!"
ru: OTHER: "Моя рука, который ты еще на себе не ощутил, пылает|огнем и разрушает все на своем пути"!

source: OTHER: Zatłukę tego małego gnojka!
de: OTHER: Ich werde den kleinen Mistkerl grün und blau schlagen!
ru: OTHER: Я сейчас этого гада изобью так...

source: OTHER: Koniec z wysłuchiwaniem rzępolenia!
de: OTHER: Schluß mit dem Gedudel!
ru: OTHER: Хватит ныть!

source: OTHER: Koniec z lutnią-samograjką!
de: OTHER: Schluß mit der selbstspielenden Laute!
ru: OTHER: Хватит играть на дудке!

source: OTHER: Koniec z praniem skarpetek!
de: OTHER: Schluß mit Sockenwaschen!
ru: OTHER: Хватит гадостей!

source: OTHER: Koniec z gotowaniem rosołu na kaca!
de: OTHER: Schluß mit dem Brühekochen gegen den Kater!
ru: OTHER: Хватит скрипеть по стеклу!

source: OTHER: Żeby tu więcej jego brudna stopa|nie postała!
de: OTHER: Wenn er es wagt, noch einen Fuß|über meine Schwelle zu setzen...!
ru: OTHER: Я могу раздавить...

source: HERO: Na razie nie muszę mu o niczym mówić.
de: HERO: Vorerst brauche ich ihm nichts zu erzählen.
ru: HERO: Я ничего не должен рассказывать...

source: HERO: Trzeba jakoś wykorzystać tę sytuację|dla siebie.
de: HERO: Ich sollte die Situation irgendwie für mich|ausnutzen und ganz clever vorgehen.
ru: HERO: Я использую обстоятельства в своих целях.

source: HERO: Mój drogi, mam dla ciebie dwie wiadomości.|Jedną dobrą, a drugą złą.
de: HERO: Mein Lieber, ich habe zwei Nachrichten für dich.|Eine gute und eine schlechte Nachricht.
ru: HERO: Мой дорогой, у меня для тебя две новости. Хорошая|и плохая.

source: HERO: Dobra jest taka, że twoja urocza żona|jest teraz w domu.
de: HERO: Die gute Nachricht ist: deine reizende Frau|ist jetzt zu Hause.
ru: HERO: Хорошая новость: Твоя разъяренная супруга вернулась|домой.

source: HERO: Zła, iż wszystkie twoje rzeczy są na|zewnątrz twojego domu.
de: HERO: Die schlechte Nachricht ist: alle deine Klamotten|liegen draußen vor dem Haus herum.
ru: HERO: Плохая новость: все твои шмотки из дома выкинуты на|улицу.

source: OTHER: To twój kolejny dowcip, panie?
de: OTHER: Soll das ein Witz sein, mein Herr?
ru: OTHER: Это шутка?

source: OTHER: Zemsta za ten żartobliwy poemat|o tobie i Kornelii?
de: OTHER: Deine Rache für mein Spottlied|über dich und Cornelia?
ru: OTHER: Я спою песенку о тебе и Корнелии?

source: HERO: Nie, nie, to poważna sprawa.
de: HERO: Nein, nein, die Sache ist ernsthaft.
ru: HERO: Нет, нет, все понятно.

source: HERO: Ponoć wpadł jej w ręce jakiś twój|miłosny poemat.
de: HERO: Eines deiner Gedichte soll in ihre Hände|gefallen sein.
ru: HERO: Что-то я не припомню...

source: HERO: Coś o dzikim ogniu i pieszczeniu ciała.
de: HERO: Etwas über ... wildes Feuer und ... die Hautberührung.
ru: HERO: Что-то о... диком пламени... и шляпе...

source: OTHER: Och nie!
de: OTHER: Oh nein!
ru: OTHER: О нет!

source: OTHER: Jestem poetą.
de: OTHER: Aber ich bin Dichter!
ru: OTHER: Но я поэт!

source: OTHER: Poeta nie musi zwracać się do konkretnej osoby,|lecz może przemawiać do wyimaginowanej kochanki,|która jest jedynie wytworem jego wyobraźni.
de: OTHER: Ein Dichter braucht sich nicht an eine konkrete|Person zu wenden. Er kann für eine imaginäre|Geliebte schreiben, die lediglich in seiner|Phantasie existiert...
ru: OTHER: Поэту не обязательно брать конкретный образец их|жизни. Он может писать о выдуманной любви.

source: OTHER: Więc jednak to nie żart, ale smutna|rzeczywistość.
de: OTHER: Es ist tatsächlich kein Witz, sondern traurige|Wirklichkeit.
ru: OTHER: Это не шутка, а горькая правда.

source: OTHER: Mam niejasne wrażenie, że chyba|książę maczał w tym palce.
de: OTHER: Ich habe das unbestimmte Gefühl, daß der|Prinz hier seine Finger mit im Spiel hat.
ru: OTHER: Я чувствую, что принц тоже приложил к этому|руку.

source: OTHER: Wiedziałam, że przypełzniesz, ty|mały piszczący robaczku!
de: OTHER: Ich wußte, daß du hier angekrochen kommst,|du jämmerlicher Wurm!
ru: OTHER: Я знал, что ты приползешь, жалкий червь!

source: OTHER: Zabieraj swoje łachy i won!
de: OTHER: Nimm deine Klamotten und verschwinde!
ru: OTHER: Забирай свои вещи и убирайся!

source: OTHER: Ależ kochanie, nastąpiła horrendalna|pomył...
de: OTHER: Aber Schätzchen, es ist ein riesiges Mißver...
ru: OTHER: Но звезда моя, это какое-то недо...

source: OTHER2: Zawsze wiedziałam, że zadajesz się|z ladacznicami!
de: OTHER2: Ich habe immer geahnt, daß du dich mit Huren|abgibst!
ru: OTHER2: Я знала, что ты ходишь налево!

source: OTHER: Ależ kruszynko...
de: OTHER: Aber Würmchen...
ru: OTHER: Но дорогая...

source: OTHER2: Morda!...
de: OTHER2: Schnauze!
ru: OTHER2: Тварь!

source: OTHER2: Ja mówię.
de: OTHER2: Ich rede jetzt.
ru: OTHER2: Я говорю.

source: OTHER2: Jak śmiesz mi się sprzeciwiać!
de: OTHER2: Wage es nicht mir zu widersprechen!
ru: OTHER2: Не перечь!

source: OTHER: To był poemat o tobie, cukiereczku!
de: OTHER: Das Gedicht war über dich, meine Zuckermade!
ru: OTHER: Это о тебе стих, дорогая!

source: OTHER: Tylko o tobie...
de: OTHER: Nur über dich...
ru: OTHER: Только о тебе..

source: OTHER: Wymówka już gotowa, cwaniaku!
de: OTHER: Das ist nur eine faule Ausrede, du mieser Schreiberling!
ru: OTHER: Это дешевые отмазки!

source: OTHER: Chono tutaj, nie będę cię prała|na ulicy!
de: OTHER: Komm rein, ich werde dich doch nicht|auf der Straße verprügeln!
ru: OTHER: Подойди, я не собираюсь выяснять отношения|на улице.

source: OTHER: Po kilku głośnych wyzwiskach i jeszcze|głośniejszych klapsach słychać długi monolog|barda i odgłosy cmokania w policzek.
de: OTHER: Nach einigen lauten Beschimpfungen und noch lauteren|Schlägen vernimmt man schließlich einen längeren Monolog|des Barden und ein lautes Schmatzen auf die Wange.
ru: OTHER: Через некоторое время воплей и звуков ударов, слышен|долгий монолог.

source: OTHER: Wynagrodzę ci to, misiaczku.
de: OTHER: Ich werde es dir entlohnen, mein Dichterfürst.
ru: OTHER: Я прощаю тебя, мой поэт.

source: OTHER: Idziemy na spacerek.
de: OTHER: Gehen wir ein bißchen spazieren.
ru: OTHER: Пойдем пройдемся.

source: HERO: Kici, kici, skocz na tę szlafmycę...
de: HERO: Miezi, Miezi, Miezi, spring auf die Schlafmütze...
ru: HERO: Киса, киса, прыгни на эту ночнушку...

source: HERO: Szlafmyca, kici, kici, szlafmyca...
de: HERO: Schlafmütze, Miezi, Miezi, Schlafmütze...
ru: HERO: Ночнушка, киса, ночнушка...

source: HERO: Skocz na szlafmycę, sierściuchu!
de: HERO: Spring' auf die Schlafmütze, Katzentier!
ru: HERO: Прыгни на ночнушку, пушистик!

source: HERO: Szlafmyca, ty tłuściochu!
de: HERO: Die Schlafmütze, du Faultier!
ru: HERO: Ночнушку, ты, жиробас!

source: $0: Kici kici...
de: $0: Miezi, Miezi...
ru: $0: Киса, киса...

source: $1: Widzisz tu ptaszka, przyjacielu?
de: $1: Siehst du hier das Vögelchen, Miezi, Miezi?
ru: $1: Видишь ту птичку, дружок?

source: $2: Fiu-fiu-fiu!
de: $2: Miau ...
ru: $2: Кис-кис-кис!

source: $3: Głupie kocisko.
de: $3: Blöde Katze!
ru: $3: Тупая кошка!

source: $5: Fiu-fiu-fiuuu!
de: $5: Miau ... Miau...
ru: $5: Кис-кис-кииииис!

source: $6: Fiuuu-fiu-fiu!
de: $6: Miiaaauu...
ru: $6: Киииис-кис-кис!

source: $7: Fiu-fiuuu-fiu!
de: $7: Mii-aaaaau!
ru: $7: Кис-кииис-кис!

source: $8: FIU-FIU!
de: $8: Piep Piep Piep
ru: $8: КИС-КИС!
