Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: $18: Masz zbyt chropowate palce, jak na złodzieja.
de: $18: Du hast viel zu rauhe Hände für einen Dieb.
ru: $18: Для вора у тебя слишком грубые руки.

source: $19: Gdybyś był złodziejem, nie chodziłbyś w łachmanach.
de: $19: Wärst du ein Dieb, würdest du nicht in Lumpen rumlaufen
ru: $19: Если б ты был вором, то не был бы сейчас одет в эти лохмотья.

source: OTHER: Nic, wasza uprzejmość!
de: OTHER: Nichts, Eure Höflichkeit!
ru: OTHER: Ничего, ваша милость!

source: OTHER: Jestem niewinny.
de: OTHER: Ich bin unschuldig.
ru: OTHER: Я невиновен.

source: OTHER: I - zanim wasza wysokość skomentuje -|wiem, że wszyscy tak mówią...
de: OTHER: Und bevor Euer Hochwohlgeboren|einen Kommentar abgibt, ich weiß wohl,|daß alle was anderes behaupten...
ru: OTHER: Я знаю, как говорят об этом все люди….

source: OTHER: ...ale ja naprawdę naprawdę jestem|niewinny!#B1
de: OTHER: ...aber ich bin wirklich, wirklich unschuldig!#B1
ru: OTHER: …но я правда-правда невиновен!#B1

source: OTHER: Echhh... Gdybym tylko mógł się przyłączyć...
de: OTHER: Ehhh... Wenn ich nur mitspielen könnte...
ru: OTHER: Эх… Если бы только я мог с ними сыграть…

source: OTHER: To amatorzy. Ja bym im pokazał, jak się|turla sześcianiki.
de: OTHER: Das sind alles Amateure. Ich würde ihnen schon zeigen,|wie man mit Würfeln umgeht.
ru: OTHER: Они непрофессионалы. Я бы им|показал, как надо бросать кости.

source: HERO: Jakieś małe oszustwo? As z rękawa?
de: HERO: Redest du von einem kleinen Betrug? Ein As im Ärmel?
ru: HERO: Ты имеешь в виду шулерство?|Что-то вроде туза в рукаве?

source: OTHER: Przepraszam, książę, ale nie mogę zdradzać|swoich skromnych tajemnic.#B0
de: OTHER: Entschuldigt Prinz, aber ich kann nicht meine|bescheidenen Geheimnisse verraten.#B0
ru: OTHER: Простите, принц, но я не могу|раскрыть вам все свои секреты.#B0

source: OTHER: Naprawdę naprawdę.#E7#E8#B0
de: OTHER: Wirklich wirklich.#E7#E8#B0
ru: OTHER: Серьёзно.#E7#E8#B0

source: OTHER: Dlaczego?
de: OTHER: Aber warum?
ru: OTHER: Но почему?

source: OTHER: Jestem bolesnym przykładem niesprawiedliwości|systemu prawnego naszego państwa oraz|bezwzględności władz!
de: OTHER: Ich bin ein anklagendes Beispiel für|unser miserables Rechtssystem, für die|Rücksichtslosigkeit der Staatsgewalt und...
ru: OTHER: В моём лице вы видите горький пример|несправедливости правовой системы|нашей страны и безжалостности властей!

source: OTHER: W skrócie, dałem się złapa...
de: OTHER: ... kurz gesagt, man hat mich erwi...
ru: OTHER: Короче говоря, меня поймали…

source: OTHER: Eee... Nastąpiła pomyłka i zamiast|prawdziwego sprawcy złapano mnie.#E7#E8#B0
de: OTHER: Äääh... Es fand eine Verwechslung statt|und anstatt des eigentlichen Schuldigen|haben sie mich geschnappt.#E7#E8#B0
ru: OTHER: Эээ… То есть произошла ошибка и меня|взяли вместо истинного преступника.#E7#E8#B0

source: OTHER: Absolutnie.
de: OTHER: Absolut.
ru: OTHER: Конечно.

source: OTHER: Nigdy te ręce - a łatwo je sobie obejrzeć|w takiej pozycji - nie skalały się|kradzieżą.#E7#E8#B0
de: OTHER: Niemals könnten diese Hände - ja, schau sie dir|nur genau an - könnten sich diese Hände mit|Diebstahl beschmutzen.#E7#E8#B0
ru: OTHER: Никогда ещё эти руки — вот, взгляните|на эти руки — никогда ещё эти руки|не запятнали себя воровством.#E7#E8#B0

source: OTHER: No cóż, miałem nadzieje, że mój dobry|książę ujmie się za biednym pasterzem,|ale się myliłem...
de: OTHER: Nun denn, ich hatte die Hoffnung,|daß sich mein guter Prinz für einen|armen Sünder einsetzt, aber da habe|ich mich wohl geirrt.
ru: OTHER: Что ж, я надеялся, что добрый принц|заступится за бедного грешника,|но это была ошибочная надежда…

source: OTHER: <chlipanie>#E7#E8#B0
de: OTHER: Seufz#E7#E8#B0
ru: OTHER: <хныканье>#E7#E8#B0

source: OTHER: Niewinny jak córka moja jedyna...
de: OTHER: Ich bin so unschuldig, wie meine einzige Tochter...
ru: OTHER: Я так же невинен, как и моя|единственная дочь…

source: P#OTHER: No, to akurat zły przykład.
de: P#OTHER: Nun ja, das war vielleicht ein|schlechtes Beispiel.
ru: P#OTHER: Хотя нет, это неудачный пример.

source: OTHER: Niewinny jak kwiat lilijki, o panie.#E7#B2
de: OTHER: Unschuldig wie eine Lilie, mein Herr.#E7#B2
ru: OTHER: Невинен, как цветок лилии, мой господин.#E7#B2

source: OTHER: Och, ktoś próbował wyciągnąć sakiewkę|jednemu z kupców, a ten złapał go|za rękę.
de: OTHER: Oh, jemand hat versucht, einem der Kaufleute|die Geldbörse aus der Tasche zu ziehen,|und dieser hat seine Hand geschnappt.
ru: OTHER: Некто хотел стащить кошелёк из кармана торговца,|но торговец схватил его за руку.

source: OTHER: Znaczy, zupełnym przypadkiem złapał|za moją rękę.
de: OTHER: Das heißt, rein zufällig hat er|meine Hand geschnappt.
ru: OTHER: То есть, он мою руку схватил.

source: OTHER: Ja się pytam: czy to jest dowód?!#E8#B3
de: OTHER: Da frage ich mich: ist das vielleicht ein Beweis?!#E8#B3
ru: OTHER: И вот я спрашиваю: разве это доказательство?!#E8#B3

source: OTHER: Honorem, dobytkiem, moimi kozami...
de: OTHER: Bei meiner Ehre, meiner Habe, meinen Ziegen...
ru: OTHER: Своей честью, своим добром, своим…

source: OTHER: Albo nie, kozami nie.
de: OTHER: Oder lieber nicht, nicht bei meinen Ziegen.
ru: OTHER: Нет, хватит, пожалуй.

source: HERO: A dlaczego nie?
de: HERO: Und warum nicht?
ru: HERO: Почему хватит?

source: OTHER: Bo kozy akurat mam.
de: OTHER: Weil ich ausgerechnet keine Ziegen habe.
ru: OTHER: Больше у меня ничего нет.

source: P#HERO: Rozumiem...#E9
de: P#HERO: Ich verstehe...#E9
ru: P#HERO: Понимаю...#E9

source: OTHER: Kahem.
de: OTHER: Ähem.
ru: OTHER: ахем

source: OTHER: Nie wpadajmy od razu w skrajności.
de: OTHER: Geraten wir nicht gleich in Extreme.
ru: OTHER: Не будем впадать в крайности.

source: OTHER: Głowa to cenna rzecz.
de: OTHER: Der Kopf ist eine wertvolle Sache.
ru: OTHER: Голова это ценная вещь.

source: OTHER: Wolałbym postawić coś, co nie jest|mi aż tak potrzebne.
de: OTHER: Ich würde lieber etwas setzen,|was mir nicht so wichtig ist.
ru: OTHER: Я бы лучше дал что-нибудь|менее важное.

source: HERO: Na przykład?...
de: HERO: Zum Beispiel?...
ru: HERO: Например?

source: OTHER: Patrząc na wszystkie okoliczności...
de: OTHER: Wenn man die Umstände betrachtet...
ru: OTHER: Принимая во внимание все обстоятельства…

source: OTHER: Mogą być moje buty?
de: OTHER: ...könnten es meine Schuhe sein?
ru: OTHER: Мои ботинки сгодятся?

source: P#HERO: Przecież nie masz butów.
de: P#HERO: Du hast doch gar keine Schuhe.
ru: P#HERO: У тебя нет ботинок.

source: OTHER: No właśnie.
de: OTHER: Eben.
ru: OTHER: Верно.

source: P#HERO: Rozumiem...#E10
de: P#HERO: Ich verstehe...#E10
ru: P#HERO: Понимаю…#E10

source: OTHER: A moje słowo nie wystarczy?!
de: OTHER: Reicht etwa mein Wort nicht aus?!
ru: OTHER: А разве моего слова недостаточно?!

source: P#OTHER: No dobra, może to nie najlepszy dowód,|ale ja naprawdę jestem czysty jak łza!#E11
de: P#OTHER: Na gut, vielleicht ist das nicht der beste Beweis,|aber ich bin wirklich so rein wie eine Träne.#E11
ru: P#OTHER: Может, это и не то "доказательство",|которое вы ждёте, но я правда чист|как слеза!#E11

source: OTHER: Nie śmiem prosić...
de: OTHER: Ich wage gar nicht zu bitten...
ru: OTHER: Не смею и просить о таком…

source: HERO: Pomyślę o tym.#E12#X1
de: HERO: Ich denke darüber nach.#E12#X1
ru: HERO: Я подумаю об этом.#E12#X1

source: OTHER: Nie.
de: OTHER: Nein.
ru: OTHER: Нет.

source: P#OTHER: Ale to prowokacja!
de: P#OTHER: Es ist eine Schande für dieses Land!
ru: P#OTHER: Это провокация!

source: OTHER: Jestem niewinny!#B2
de: OTHER: Ich bin unschuldig!#B2
ru: OTHER: Я невиновен!#B2

source: OTHER: Wszyscy tylko ta logika i logika.
de: OTHER: Alle sprechen nur von Logik.
ru: OTHER: У всех на устах только логика да логика.

source: OTHER: Dedukcja i dedukcja.
de: OTHER: Deduktion und Induktion.
ru: OTHER: Дедукция да индукция.

source: OTHER: A ja przecież nic nie zrobiłem!#B2
de: OTHER: Dabei habe ich doch gar nichts getan!#B2
ru: OTHER: А какая тут дедукция, когда|я ничего не сделал!#B2

source: P#OTHER: Poważnie?
de: P#OTHER: Im Ernst?
ru: P#OTHER: Серьёзно?

source: HERO: Szczerze mówiąc, mój biedny człowieku,|wyglądasz na takiego, który by nawet|muchy nie skrzywdził.
de: HERO: Ehrlich gesagt, mein armer Mensch,|du siehst mir so aus, als wenn du|keiner Fliege was zu leide tun könntest.
ru: HERO: Если честно, ты похож на человека,|который даже мухи не обидит.

source: HERO: Bez obrazy, ale prędzej ciebie by|okradziono niż ty mógłbyś kogoś|okraść.
de: HERO: Ich möchte deine Gefühle nicht verletzten,|aber eher würde dir jemand etwas stehlen,|als daß du jemandem etwas stehlen könntest.
ru: HERO: Без обид, но скорее уж тебя ограбят,|чем ты кого-то ограбишь.

source: OTHER: No, nie przesadzajmy, aż taką ofermą|nie jestem.#E15#B4
de: OTHER: Wir wollen mal nicht übertreiben,|so ein Tölpel bin ich nun auch wieder nicht.#E15#B4
ru: OTHER: Ну вы уж не преувеличивайте,|я не такой болван.#E15#B4

source: OTHER: O, to bardzo dobre określenie!
de: OTHER: Oh genau, das war die treffende Bezeichnung.
ru: OTHER: О, это очень точное сравнение!

source: OTHER: Szkoda, że sam tego nie wymyśliłem.
de: OTHER: Könnte fast von mir stammen.
ru: OTHER: Жаль, что я сам до этого не додумался.

source: OTHER: Zostałem bezczelnie wrobiony!#B2
de: OTHER: Ich wurde einfach frech hereingelegt!#B2
ru: OTHER: Меня нагло подставили!#B2

source: OTHER: Dziękuję, książę.
de: OTHER: Danke, Prinz.
ru: OTHER: Спасибо, принц.

source: OTHER: Od razu widać, że znasz się na ludziach.
de: OTHER: Man sieht sofort, daß du eine gute Menschenkenntnis hast.
ru: OTHER: Сразу видно, что вы неплохо разбираетесь в людях.

source: OTHER: Proszę, uwolnij mnie!
de: OTHER: Bitte, befreie mich!
ru: OTHER: Пожалуйста, освободите меня!

source: HERO: Zastanowię się nad tym...#X1
de: HERO: Ich denke darüber nach...#X1
ru: HERO: Я подумаю об этом…#X1

source: OTHER: Ja?!
de: OTHER: Ich?!
ru: OTHER: У меня?!

source: OTHER: Chropowate palce?!
de: OTHER: Rauhe Hände?!
ru: OTHER: Грубые руки?!

source: OTHER: Obrobiłem nimi samego królewskiego doradcę|Keidana, kiedy zagapił się na dziewczyny|z objazdowego cyrku!
de: OTHER: Mit diesen Händen habe ich den|königlichen Berater Kaidan bestohlen, als dieser|den Mädels vom Wanderzirkus nachgegafft hat!
ru: OTHER: Вот этими самыми руками я обобрал|королевского советника Кайдана, когда тот глядел|на девок из бродячего цирка!

source: OTHER: Tylko może nie mów o tym w zamku.
de: OTHER: Aber sag nichts davon auf Schloß Garrahan.
ru: OTHER: Только в замке об этом никому не говорите.

source: OTHER: Nie oparł się nim nawet ten zdzierca|podatkowy Gandar! Zabrałem mu dwakroć|tyle, co on mi!
de: OTHER: Und auch der Steuereintreiber Gandar hat|nichts davon bemerkt. Ich habe ihm das|doppelte abgenommen, wie er mir!
ru: OTHER: Даже сборщик налогов Гандар ничего не заметил!|Я взял у него вдвое больше,|чем он у меня.

source: OTHER: Ale nie powtarzaj tego, dobrze?
de: OTHER: Aber behalte das für dich, ja?
ru: OTHER: Только об этом тоже не расказывайте, ладно?

source: OTHER: To są palce mistrza, a nie jakieś|tam, tfu, chropowate...
de: OTHER: Das hier sind die Finger eines Meisters|und nicht irgendwelche, bäh, rauhen...
ru: OTHER: Это — руки мастера!

source: HERO: Nie wierzę, mówisz tak tylko, bo wstyd|ci odcisków od pracy na polu.
de: HERO: Ich glaube dir nicht, du redest nur so,|weil du dich der Spuren schämst, die die|Feldarbeit hinterlassen hat.
ru: HERO: Я тебе не верю. Ты так говоришь лишь потому,|что тебе стыдно своих мозолистых|от грубой работы рук.

source: OTHER: Tak?
de: OTHER: Was?
ru: OTHER: Что?

source: OTHER: TAK?!?
de: OTHER: BITTE WAS?!?
ru: OTHER: ЧТО?!

source: OTHER: No to niech książę sprawdzi moje kieszenie.
de: OTHER: Na dann überprüft doch mal meine Taschen, Prinz.
ru: OTHER: Тогда пусть принц проверит мои карманы.

source: P#HERO: Twoje kieszenie?
de: P#HERO: Deine Taschen?
ru: P#HERO: Твои карманы?

source: OTHER: Bardzo proszę. Moje kieszenie. Zaraz się|okaże, kto tu ma rację.
de: OTHER: Ja, bitte schön. Meine Taschen.|Gleich wird es sich herausstellen,|wer hier recht hat.
ru: OTHER: Очень прошу. Мои карманы.|Вам сразу станет ясно, кто перед вами.

source: P#HERO: Hmm... No dobra.#D1#X2
de: P#HERO: Hmm... Na gut.#D1#X2
ru: P#HERO: Гм… Ну ладно.#D1#X2

source: P#OTHER: Książę to ma gadane lepsze niż ci kupcy.
de: P#OTHER: Prinz, ihr seid eine größere Labertasche|als diese Kaufmänner.
ru: P#OTHER: Принц, вы умеете уболтать лучше,|чем те торговцы.

source: OTHER: Co racja to racja.
de: OTHER: Das mußte mal gesagt werden.
ru: OTHER: Что правда то правда.

source: OTHER: Więc zostanę uwolniony?
de: OTHER: Also werde ich nun freigelassen?
ru: OTHER: Так меня отпустят?

source: HERO: Zobaczymy, muszę się zastanowić...#X1
de: HERO: Mal schauen, ich muß darüber nachdenken...#X1
ru: HERO: Посмотрим, мне ещё надо это обдумать…#X1

source: HERO: Wytrychy i fałszywe kości.
de: HERO: Ein Dietrich und gezinkte Würfel.
ru: HERO: Отмычки и шулерские кости.

source: P#HERO: A więc jednak jesteś właściwym człowiekiem|na właściwym miejscu.
de: P#HERO: Also bist du doch der richtige Mensch|am richtigen Platz.
ru: P#HERO: Ты здесь на своём месте.

source: HERO: Zwracam honor do kieszeni. Nie masz|chropowatych paluchów.
de: HERO: Bei meiner Ehre, ich nehme alles zurück.|Du hast keine rauhen Hände.
ru: HERO: Беру свои слова назад. У тебя не грубые руки.

source: OTHER: Kłaniam się do stóp, książę. I proszę|o zwrot narzędzi pracy.
de: OTHER: Ich verneige mich bis zu Euren Füßen, Prinz,|und erbitte meine Arbeitswerkzeuge zurück.
ru: OTHER: Я кланяюсь вам в ноги, принц, и прошу|вернуть мои рабочие инструменты.

source: HERO: Co to to nie. Nie mogę przecież|popierać przestępczości!
de: HERO: Wenn es darum geht, dann tut es mir leid.|Ich kann doch keine Verbrechen unterstützen.
ru: HERO: Ну уж нет. Я не могу поощрять преступность!

source: OTHER: Ależ książę!...
de: OTHER: Aber Prinz!...
ru: OTHER: Но принц!…

source: HERO: Co za ironia losu, okraść złodzieja.
de: HERO: Was ist das für eine Ironie des Schicksals,|einen Dieb zu bestehlen.
ru: HERO: Какая ирония судьбы — обокрасть вора.

source: HERO: Mam nadzieję, że to cię czegoś nauczy|i porzucisz ten niecny proceder.
de: HERO: Ich habe die Hoffnung, daß du hieraus gelernt hast|und daß du diese schändliche Tätigkeit aufgibst.
ru: HERO: Я надеюсь, что это послужит тебе уроком|и побудит бросить это порочное ремесло.

source: OTHER: <westchnienie>
de: OTHER: Seufz
ru: OTHER: Уф...

source: OTHER: Do licha, znowu będę musiał|dorobić nowy komplet.
de: OTHER: So ein Mist, jetzt muß ich schon wieder|einen kompletten Werkzeugsatz nachmachen lassen.
ru: OTHER: Вот блин, теперь придётся|мастерить инструменты заново.

source: HERO: Dzień dobry.
de: HERO: Guten Tag.
ru: HERO: Добрый день.

source: OTHER: Dzień dobry, książę. Czym mogę służyć?
de: OTHER: Guten Tag, Prinz. Womit kann ich dienen?
ru: OTHER: Добрый день, принц. Чем могу служить?

source: $0: Słyszałeś waszmość co mówił herold?
de: $0: Habt Ihr gehört, worüber der Herold gesprochen hat?
ru: $0: Вы слышали, о чём говорил глашатай?

source: $1: Jak tam interesy?
de: $1: Wie laufen die Geschäfte?
ru: $1: Как дела?

source: $2: Czy waszmość znasz jakieś demony?
de: $2: Kennt Ihr irgendwelche Dämonen?
ru: $2: У тебя есть знакомые демоны?

source: $3: Ech, nic tam, porozmawiamy później.
de: $3: Wir sprechen später noch.
ru: $3: Поговорим позже.

source: $4: Cóż... No wiesz waszmość...
de: $4: Nun denn... Na Ihr wißt schon...
ru: $4: Ну… Сам знаешь…

source: $5: Nie jestem prawdziwym księciem.
de: $5: Ich bin kein richtiger Prinz.
ru: $5: Я не настоящий принц.

source: $6: Dowcip? Były inne?
de: $6: Wieso ein weiterer Witz?
ru: $6: Что, продолжаем шутить?

source: OTHER: Tak, wasza wysokość.
de: OTHER: Ja, Euer Hochwohlgeboren.
ru: OTHER: Да, Ваше Высочество.

source: OTHER: Tuszę, iż to kolejny dowcip waszej wysokości,|nieprawdaż?#B1
de: OTHER: Ich hoffe, daß dies ein weiterer Witz von|Euer Hochwohlgeboren ist, richtig?#B1
ru: OTHER: Я надеюсь, что это очередная шутка|Вашего Высочества, ведь так?#B1

source: OTHER: Jak to zawsze u dobrych kupców.
de: OTHER: Wie immer bei guten Händlern.
ru: OTHER: Как и у всех хороших торговцев.

source: OTHER: Daniny za wysokie, rynek nasycony,|towar nie schodzi.
de: OTHER: Die Abgaben sind zu hoch, der Markt|ist gesättigt, die Ware geht nicht weg.
ru: OTHER: Налоги высоки, рынок переполнен, товары|не продаются.

source: OTHER: Dzień jak co dzień.
de: OTHER: Ein Tag wie jeder andere.
ru: OTHER: День как день.

source: HERO: Ale łańcuch waszmość masz fachowy.
de: HERO: Aber Eure Kette sieht sehr|wertvoll aus.
ru: HERO: Однако я вижу на вас дорогую цепочку.

source: OTHER: Cóż, głodem jeszcze nie przymieram,|ale jak tak dalej pójdzie, to będę musiał|przestać karmić konie kawiorem.
de: OTHER: Was soll's, des Hungers muß ich noch nicht sterben,|aber wenn das so weiter geht, dann muß ich aufhören|die Pferde mit Kaviar zu füttern.
ru: OTHER: Что ж, от голода я ещё не помираю. Но если|дела так пойдут и дальше, то придётся|перестать кормить лошадей икрой.

source: P#HERO: No tak, a tego byśmy nie chcieli...#B0
de: P#HERO: Na ja, das wollen wir doch nicht hoffen...#B0
ru: P#HERO: Да, мы бы тоже этого не хотели…#B0

source: OTHER: Na bogów Południa, książę!
de: OTHER: Bei den Göttern des Südens, Prinz!
ru: OTHER: Во имя Богов Юга, принц!

source: OTHER: Co prawda na naszej drodze mijaliśmy jakiś zamek,|w którym ponoć żyją wampiry, ale nigdy w życiu|nie miałem do czynienia z mocami nieczystymi!
de: OTHER: In der Tat! Auf unserem Weg sind wir|an einem Schloß vorbeigekommen,|in dem angeblich Vampire leben,|aber ich hatte noch nie mit|unreinen Mächten zu tun.
ru: OTHER: Мы по дороге проезжали мимо замка,|где якобы живут вампиры, но а так я|ни разу в жизни не имел дело с нечистой силой!

source: OTHER: O ile, oczywiście, odliczymy|poborców podatkowych.#F1#B0
de: OTHER: Sofern wir, selbstverständlich, die|Steuereintreiber nicht dazuzählen wollen.#F1#B0
ru: OTHER: Не считая сборщиков налогов, разумеется.#F1#B0

source: OTHER: Zawsze do usług, książę.#E3
de: OTHER: Immer zu Diensten, Prinz.#E3
ru: OTHER: Всегда рад, принц.#E3

source: HERO: Sprytny i przebiegły. Powinienem|to wiedzieć.
de: HERO: Ihr seid offenbar sehr schlau und durchtrieben.|Ich hätte es wissen müssen.
ru: HERO: Умён и хитёр. Я должен был это знать.

source: OTHER: Skarbnik ojca waszej wysokości|też tak uważa.
de: OTHER: Der Schatzmeister Eures Vaters,|Hochwohlgeboren, teilt Eure Meinung.
ru: OTHER: Казначей отца вашего высочества|тоже так думает.

source: HERO: Nie wątpię...#B0
de: HERO: Ich zweifle nicht daran...#B0
ru: HERO: Я не сомневаюсь…#B0

source: OTHER: Ależ oczywiście, oczywiście, książę.
de: OTHER: Aber selbstverständlich,|selbstverständlich, Prinz.
ru: OTHER: Конечно, конечно, принц.

source: HERO: Poważnie. Jestem zwykłym chłopakiem,|któremu demon ukradł duszę i przeniósł|ją do ciała znanego wam księcia.
de: HERO: Nein ernsthaft. Ich bin ein einfacher Junge,|dem ein Dämon die Seele gestohlen hat|und sie in den Körper des Euch|bekannten Prinzen eingepflanzt hat.
ru: HERO: Серьёзно. Я простой парень,|у которого демон украл душу и вселил|её в тело известного вам принца.

source: P#OTHER: Naiwna bajeczka, książę. Ale może na|damach zrobi wrażenie.
de: P#OTHER: Das ist eine alberne Geschichte, Prinz.|Aber vielleicht macht sie auf die Damen|Eindruck.
ru: P#OTHER: Наивная сказочка, принц. Может,|только на дам она и произведёт впечатление.

source: OTHER: Chyba ci się już wyczerpują pomysły.
de: OTHER: Euch gehen scheinbar die Ideen aus.
ru: OTHER: Думаю, у вас заканчиваются идеи.

source: OTHER: Hej, Stefanello, książę dzisiaj mówi, że|w jego ciele jest dusza demona.
de: OTHER: Hey, Stefanello, der Prinz erzählt gerade,|daß in seinem Körper die Seele eines|Dämons sitzt.
ru: OTHER: Эй, Стефанелло, принц говорит, что в его|теле сидит душа демона.

source: OTHER: Nie zaraz, że demon ukradł duszę innego|demona i... Ach, tam wszystko mi się|pomyliło.
de: OTHER: Nein, Moment mal, ein Dämon hat|die Seele eines anderen Dämons gestohlen und...|Ach, jetzt habe ich alles durcheinander gebracht.
ru: OTHER: Нет, то есть демон укралдушу у другого демона и…|Ну вот, я сам запутался.

source: OTHER2: Co?
de: OTHER2: Was?
ru: OTHER2: Что?

source: OTHER2: Zamiana dusz?
de: OTHER2: Ein Seelentausch?
ru: OTHER2: Обмен душ?

source: OTHER2: HA HA HA!
ru: OTHER2: Ха-ха-ха!

source: OTHER2: To ci się udało, książę!
de: OTHER2: Das ist gut, Prinz!
ru: OTHER2: У вас получилось, принц!

source: OTHER2: Niech ja skonam...
de: OTHER2: Ich sterbe gleich vor...
ru: OTHER2: Я сейчас лопну…

source: HERO: W porządku, w porządku, nic nie mówiłem.#B0
de: HERO: In Ordnung, ich habe nichts gesagt.#B0
ru: HERO: Ладно, ладно, я ничего не говорил.#B0

source: OTHER: Ależ książę, wszyscy pamiętamy, jak|udawałeś śmiertelnie rannego w karczmie...
de: OTHER: Aber Prinz, wir alle erinnern uns doch noch,|als Ihr im Wirtshaus einen auf tödlich verletzt|gemacht habt...
ru: OTHER: Принц, мы все помним, как вы в таверне|прикидывались смертельно раненным…

source: OTHER: ...aż nie zaczął cię lizać pies i wydało|się, że to zalewka z czereśni.
de: OTHER: ...bis der Hund angefangen hat Euch abzulecken|und es sich herausstellte, daß das Blut Kirschsaft war.
ru: OTHER: …пока вас не начала лизать собака,|и тогда обнаружилось, что кровь на вас|это вишнёвая наливка.

source: OTHER: Hej, Stefanello, a pamiętasz jak książę|przebrał się za panienkę i poderwał|barda?
de: OTHER: Hey, Stefanello, weißt du noch|wie der Prinz sich als Fräulein verkleidet|hat und den Barden angemacht hat?
ru: OTHER: Эй, Стефанелло, а помнишь, как|принц переоделся женщиной и заигрывал с бардом?

source: OTHER2: Zaraz...
de: OTHER2: Moment...
ru: OTHER2: Сейчас…

source: OTHER2: Ach, faktycznie!
de: OTHER2: Ach ja, tatsächlich!
ru: OTHER2: А, да!

source: OTHER2: Nigdy nie zapomnę jego miny, jak zbliżył|się nagle by ukraść całusa i zobaczył|zarost!
de: OTHER2: Ich werde nie seine Miene vergessen,|als er sich plötzlich genähert hat|um einen Kuß zu erhaschen und|dann den Bartwuchs bemerkt hat!
ru: OTHER2: Никогда не забуду выражение его лица|в тот миг, когда он полез целоваться|и вдруг обнаружил бороду!

source: OTHER2: Myślałem, że nigdy go nie docucimy.
de: OTHER2: Ich dachte schon, daß wir ihn nie mehr|zur Besinnung kriegen.
ru: OTHER2: Я думал, что мы его уже никогда не откачаем.

source: OTHER: Oddech żebraka postawi na nogi nawet|umarłego.
de: OTHER: Ja, aber der Atem eines Bettlers bringt|sogar Tote wieder auf die Beine...
ru: OTHER: Дыхание нищего и мёртвого поставит на ноги.

source: HERO: Chyba usłyszałem już wystarczająco dużo...#B0
de: HERO: Ich glaube, jetzt habe ich genug gehört...#B0
ru: HERO: Всё, я уже наслушался.#B0

source: HERO: Witaj, kupcze.
de: HERO: Sei gegrüßt, Händler.
ru: HERO: Привет, торговец.

source: OTHER: Witaj, książę.
de: OTHER: Seid gegrüßt, Prinz
ru: OTHER: Пока, принц.

source: $0: Słyszałeś może, drogi człowieku, coś o demonach?
de: $0: Hast du vielleicht etwas über Dämonen gehört?
ru: $0: Слышали ли вы что-нибудь о демонах?

source: $1: Widzę, że mocno pracujesz nad tą zupką...
de: $1: Ich sehe, daß du schwer an der Suppe arbeitest...
ru: $1: Я смотрю, вы заняты супом…

source: $2: Co właściwie sprzedajesz?
de: $2: Was verkaufst du eigentlich?
ru: $2: Что именно вы продаёте?

source: $3: Nie przeszkadzam, porozmawiamy jeszcze później.
de: $3: Ich will nicht stören, wir reden später.
ru: $3: Я не буду мешать, поговорим позже.

source: OTHER: Przeżyłem z jednym dwadzieścia lat.|To była moja żona.
de: OTHER: Ich war mit einem über zwanzig Jahre|verheiratet.
ru: OTHER: С одним из них я жил двадцать лет. Это была моя жена.
