Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: HERO: Hej, zna ktoś jakiegoś krasnoluda? Założyłem|się z przyjaciółką, że jak go wytargam za|brodę, to wyleci co najmniej sto wszy.
de: HERO: Hey, kennt jemand von euch einen Zwerg? Ich bin|mit meiner Freundin die Wette eingegangen,|daß wenn man einen Zwerg am Bart zieht,| mindestens hundert Läuse herausfallen.
ru: HERO: Кто-нибудь знает какого-нибудь гнома? Я тут|поспорил с подругой, что если я его дёрну за бороду,|то оттуда вылетит не меньше сотни вшей.

source: HERO: Słyszeliście kiedy krasnolud potrafi zdjąć|majtki przez głowę?
de: HERO: Wißt ihr, wann ein Zwerg seine Unterhosen|über den Kopf ausziehen kann?
ru: HERO: Знаете, когда гном может замолчать?

source: HERO: Jak mu przegniją w kroku.
de: HERO: Wenn sie ihm im Schritt verfault sind.
ru: HERO: Когда у него губы за ноги запутаются!

source: OTHER: Masz coś przeciwko krasnoludom? Zaraz|dam ci prawdziwy powód!
de: OTHER: Hast du was gegen Zwerge? Ich werde|dir gleich einen guten Grund dafür geben!
ru: OTHER: Вы что-то имеете против гномов? Сейчас|я вам добавлю причин!

source: OTHER: Nie zniosę takiej zniewagi!|Na ubitą ziemię!
de: OTHER: Diese Beleidigung lasse ich mir nicht gefallen!|Ich fordere dich zum Duell!
ru: OTHER: Я не прощу вам этого оскорбления! Я вызываю вас|на дуэль!

source: OTHER: Od początku mi się nie podobałeś!|Czas na wymianę facjaty!
de: OTHER: Von Anfang an hast du mir nicht gefallen!|Es ist an der Zeit, dir die Fresse zu polieren!
ru: OTHER: Ты мне с самого начала не понравился. Пора|начистить тебе рыло.

source: OTHER: Mój kufelek-pupelek...
de: OTHER: Mein Krüglein...
ru: OTHER: Мой кругленький...

source: OTHER: Jedyny i najukochańszy...
de: OTHER: Einziges und Liebstes...
ru: OTHER: Единственный и любимый...

source: OTHER: Kto, kto był na tyle okrutny?...
de: OTHER: Wer, wer konnte soo grausam sein?...
ru: OTHER: Кто, кто мог быть так ужасен?

source: OTHER: Gdzie jesteś, mój kufeleczku?...
de: OTHER: Wo bist du, mein Krüglein...?
ru: OTHER: Где ты, мой милый?

source: OTHER: Och... To nie może być prawda...
de: OTHER: Ach... Das kann nicht wahr sein...
ru: OTHER: Ах.. Не может быть...

source: HERO: Oto trucizna.
de: HERO: Hier ist das Gift.
ru: HERO: Вот яд.

source: HERO: Najlepsza z najlepszych.
de: HERO: Das Beste von Besten.
ru: HERO: Лучший из лучших.

source: OTHER: Mm.
ru: OTHER: Мм...

source: OTHER: To na pewno nie jest żadna trucizna.
de: OTHER: Das ist sicher kein Gift.
ru: OTHER: Это не яд.

source: OTHER: Jakoś tak dziwnie wygląda.
de: OTHER: Es sieht irgendwie nicht richtig aus.
ru: OTHER: Он не похож.

source: OTHER: Lepiej chyba poczekam na swojego|dostawcę.
de: OTHER: Ich warte lieber auf meinen|Lieferanten.
ru: OTHER: Я лучше подожду своих поставщиков.

source: HERO: Ależ to naprawdę znakomita trutka!
de: HERO: Aber das ist wirklich ein tolles Gift!
ru: HERO: Но это действительно хороший яд!

source: HERO: Mogę udowodnić!
de: HERO: Ich kann es beweisen!
ru: HERO: Я могу доказать!

source: OTHER: Cóż, jak tylko zobaczę to na własne|oczy...
de: OTHER: Wenn ich mich mit eigenen Augen|davon überzeugen könnte...
ru: OTHER: Если вы сможете мне это доказать...

source: HERO: Leżało niedaleko...
de: HERO: Das hier fand ich ganz in der Nähe...
ru: HERO: Я вот прямо поблизости...

source: HERO: No i jak?
de: HERO: Na also!
ru: HERO: Ну!

source: HERO: Rezultat chyba piorunujący...
de: HERO: Der Effekt ist wohl umwerfend...
ru: HERO: Эффект был неподражаем...

source: HERO: A to tylko łyk trucizny zmieszanej z piwem.
de: HERO: Und das war nur ein Schluck Gift,|gemischt mit Bier.
ru: HERO: И это был всего лишь глоток яда с|пивом.

source: OTHER: Faktycznie, to może wystarczyć|do moich celów.
de: OTHER: Das könnte tatsächlich für meine|Zwecke ausreichen.
ru: OTHER: Этого может быть достаточно...

source: OTHER: Masz silniejszą dawkę?
de: OTHER: Habt Ihr eine stärkere Dosis?
ru: OTHER: У вас есть большие дозы?

source: OTHER: Taką, żeby zabić... powiedzmy...|coś wielkości człowieka?
de: OTHER: Die ausreicht um etwas zu töten... sagen wir mal...|etwas von menschlicher Größe?
ru: OTHER: Достаточные чтобы кого-нибудь убить... Кого-либо размером|с человека?

source: HERO: Myślałem, to ma być trutka na|szczury?
de: HERO: Ich dachte, das sollte ein Rattengift|sein!?
ru: HERO: Думаю, это яд для крыс?

source: OTHER: Chodzi mi o naprawdę duże szczury.
de: OTHER: Es geht mir um wirklich große Ratten.
ru: OTHER: Речь идет об очень больших крысах.

source: HERO: Weź ten kufelek i postaw na dzień|na świeżym powietrzu.
de: HERO: Nehmt den Bierkrug und stellt ihn für|einen Tag nach draußen.
ru: HERO: Возьми пивную кружку и выставь ее на сутки|на улицу.

source: HERO: Piwo wywietrzeje i po kłopocie.
de: HERO: Die Flüssigkeit wird verdampfen und dann|hat sich Ihr Problem in Luft aufgelöst.
ru: HERO: Жидкость выдохнется и проблема исчезнет.

source: HERO: Zostanie sama esencja.
de: HERO: Es bleibt nur die Essenz übrig.
ru: HERO: Останется только эссенция.

source: HERO: No, no, no...
de: HERO: Na, na, na
ru: HERO: На -на -на ...

source: HERO: Gdybyś założyła tę woalkę, mogłabyś udawać|naszą tajemniczą znajomą i przejąć|truciznę...
de: HERO: Wenn du den Schleier anziehst, könntest du|vorgeben, unsere geheimnisvolle Bekannte|zu sein und dann das Gift übernehmen...
ru: HERO: Если увидишь торговца, то передай ему яд...

source: OTHER: Nie ściągnę swojej maski za żadne skarby!
de: OTHER: Ich werde meine Maske um keinen Preis ablegen!
ru: OTHER: Я ни за какие деньги не сниму маски!

source: OTHER: A chyba dość głupio wyglądałabym ubrana|i w maskę i woalkę.
de: OTHER: Und ich würde wohl ziemlich dämlich|mit Maske und Schleier aussehen.
ru: OTHER: Хотя я думаю, что буду выглядеть довольно глупо, надев и маску и вуаль.

source: HERO: A propos maski...
de: HERO: Apropos Maske...
ru: HERO: Что касается маски...

source: OTHER: Cicho!
de: OTHER: Kein Wort mehr!
ru: OTHER: Ни слова больше!

source: OTHER: Ale zaraz...
de: OTHER: Aber moment mal...
ru: OTHER: Погоди-ка...

source: OTHER: Masz przecież długie włosy...
de: OTHER: Du hast doch langes Haar...
ru: OTHER: У тебя еще и волосы длинные...

source: OTHER: Wystarczy, że podniesiesz nieco głos|i już cię nikt nie pozna...
de: OTHER: Es reicht, wenn du mit höherer Stimme sprichst|und niemand wird dich mehr erkennen.
ru: OTHER: Достаточно тебе будет говорить высоким голосом|и никто тебя не узнает.

source: HERO: <westchnienie>
de: HERO: Seufz
ru: HERO: <вздох>

source: HERO: Wiedziałem.
de: HERO: Ich habe so etwas kommen sehen.
ru: HERO: Я такое уже видел.

source: OTHER: Mmmmam czego chchchciałaśśś...
de: OTHER: Ich ha-haabe, was du wo-ol-ltessst
ru: OTHER: У меня есть то что ты хочешь

source: OTHER2: Ja też.
de: OTHER2: Ich auch.
ru: OTHER2: У меня тоже

source: OTHER: Tylllko jej nie żżżałujjjj...
de: OTHER: Kn-Knnausre bb-bloß nicht dda-damit...
ru: OTHER: Кроме того

source: OTHER: Mmmała dddawka nnnie jessst w pełni|skkkuteczna...
de: OTHER: Eine kleine Ddosis ist nn-nur zum Tt-teil|ww-wirksam...
ru: OTHER: Маленькой дозы мне не очень достаточно

source: OTHER: ...powoduje jedynie zbliżżżżony do śśśśśmierci|letarg. Żeby zzzzabić...
de: OTHER: ...sie verursacht ll-lediglich|Sch-scheintttod. Um zu töttten...
ru: OTHER: Она слабовата, чтобы убить...

source: OTHER: Zużyj cccałą fffiolkę...
de: OTHER: mußt du die gg-ganze Ampp-pulle verbrauchen...
ru: OTHER: Надо использовать целую ампулу.

source: OTHER: Życzę szybkiego rozwodu...
de: OTHER: Ich wünsche eine sch-schnelle Scheidung...
ru: OTHER: Желаю быстрой работы...

source: OTHER: He-he-he...
ru: OTHER: Хе-хе-хе...

source: HERO: No cóż, chyba czas na...
de: HERO: Tja, nun ist es soweit...
ru: HERO: Ха, как-то это дале...

source: HERO: Boisz się?
de: HERO: Hast du Angst?
ru: HERO: Ты боишься?

source: OTHER: Nieważne.
de: OTHER: Das ist jetzt unwichtig.
ru: OTHER: Это уже не важно.

source: OTHER: I tak musimy to zrobić.
de: OTHER: Es bleibt uns ja nichts anderes übrig.
ru: OTHER: Нам ничего не остается.

source: P#HERO: <ciężkie westchnienie>
de: P#HERO: SEUFZ!
ru: P#HERO: ЫХ!

source: HERO: Do dzieła.
de: HERO: Dann an's Werk.
ru: HERO: Тогда за работу.

source: OTHER: Dzięki za pomoc, pa!
de: OTHER: Danke für die Hilfe, tschüs!
ru: OTHER: Спасибо за помощь. Пока.

source: HERO: Bardzo przepraszam za moją towarzyszkę.
de: HERO: Ich entschuldige mich vielmals|für meine Gefährtin.
ru: HERO: Я сто раз извиняюсь за свою спутницу.

source: HERO: Mogę wejść?
de: HERO: Dürfte ich wohl eintreten?
ru: HERO: Можно войти?

source: P#HERO: Halo?!...
de: P#HERO: Hey! Hallo?!
ru: P#HERO: Аллё?

source: HERO: Właściwie to wcale jej nie znam.
de: HERO: Eigentlich kenne ich sie gar nicht.
ru: HERO: Кажется, я вас не знаю.

source: HERO: Tak tylko razem znaleźliśmy się|w tej samej łodzi.
de: HERO: Wir waren nur zufällig zusammen|im selben Boot.
ru: HERO: Мы однажды плыли в одной лодке.

source: HERO: Przez przypadek.
de: HERO: Reiner Zufall.
ru: HERO: Случайно.

source: HERO: Ciągle zły?
de: HERO: Immer noch böse?
ru: HERO: Все еще злитесь?

source: OTHER: Witam szanownego grzesznika.
de: OTHER: Sei gegrüßt, verehrter Sünder.
ru: OTHER: Приветствую, уважаемого грешника.

source: OTHER: Służymy miłą, sympatyczną celą|grzechów lekkich.
de: OTHER: Wir hätten hier eine nette, sympathische|Zelle für leichte Sünden.
ru: OTHER: У нас тут есть симпатичная клетка для маленьких|грешников.

source: OTHER: Dla postaci bardziej zasłużonych mamy|komnatę grzechów ciężkich.
de: OTHER: Für verdienstvollere Personen haben wir|unsere Suite der schweren Sünden.
ru: OTHER: Для особых персон у нас есть камеры тяжелых|грехов.

source: OTHER: Prawdziwa rozkosz to jednak cela dla|V.I.P.-ów, ale trzeba na nią sobie|zasłużyć.
de: OTHER: Unsere V.I.P. Lounge mit gehobener Ausstattung|für besonders schwere Sünden muß man sich aber|wirklich verdient haben.
ru: OTHER: ВИП ложа для жутких грешников...

source: OTHER: Jakimiż to uczynkami może się|szanowny grzesznik pochwalić?
de: OTHER: Welcher Untaten kann sich der|verehrte Sünder denn rühmen?
ru: OTHER: Что может сказать уважаемый грешник?

source: $0: Nie płaciłem podatków.
de: $0: Ich habe keine Steuern gezahlt.
ru: $0: Я не платил налогов.

source: $1: Płaciłem podatki.
de: $1: Ich habe Steuern gezahlt.
ru: $1: Я платил налоги.

source: $2: Pobierałem podatki.
de: $2: Ich habe Steuern erhoben.
ru: $2: Я собирал налоги.

source: $3: Zaraz wrócę, tylko się jeszcze trochę rozejrzę.
de: $3: Ich schaue mich erst noch ein bißchen um.
ru: $3: Я должен подумать.

source: OTHER: W zasadzie to nie grzech, a zasługa, ale|skoro już tu jesteś...
de: OTHER: Im Prinzip ist das gar keine Sünde sondern|ein Verdienst, aber wenn du schon mal da bist...
ru: OTHER: В принципе, это не такие уж и грехи, но раз|уж ты тут...

source: OTHER: Sala grzechów lekkich - raz!#E0#X1
de: OTHER: Hinein in die Zelle der leichten Sünden!#E0#X1
ru: OTHER: В камеру легких грешников!#E0#X1

source: OTHER: Głupota to grzech ciężki...
de: OTHER: Dummheit ist eine schwere Sünde...
ru: OTHER: Глупость - тяжелый грех...

source: OTHER: Sala czeka!#E1#X2
de: OTHER: Suite der schweren Sünden!#E1#X2
ru: OTHER: Комната тяжелых грешников!#E1#X2

source: OTHER: Cudownie!
de: OTHER: Herrlich!
ru: OTHER: С удовольствием!

source: OTHER: Esencja zła!
de: OTHER: Die Essenz des Bösen!
ru: OTHER: Эссенция зла!

source: OTHER: Krystaliczna postać grzechu!
de: OTHER: Die Sünde in kristalliner Form!
ru: OTHER: Греховность в твердом состоянии!

source: OTHER: Specjalna sala dla V.I.P.-ów!#E2#X3
de: OTHER: Unsere spezielle V.I.P. Lounge!#E2#X3
ru: OTHER: Наша специальная ВИП ложа!#E2#X3

source: OTHER: Ależ oczywiście, mamy przez|sobą całą wieczność.
de: OTHER: Aber natürlich, uns steht noch die ganze|Ewigkeit bevor.
ru: OTHER: Но нам еще много чего надо осмотреть:

source: OTHER: Proszę się nie spieszyć.#E3#X4
de: OTHER: Nur keine Eile.#E3#X4
ru: OTHER: Только не надо торопиться.#E3#X4

source: HERO: Może spróbujemy jeszcze raz?
de: HERO: Wollen wir es nochmal versuchen?
ru: HERO: Попробуем еще раз?

source: OTHER: Do czego to doszliśmy a propos grzechów?
de: OTHER: Wo waren wir bei den Sünden stehengeblieben?
ru: OTHER: Где мы там остановились?

source: OTHER: Co za licho?...
de: OTHER: Was zum Teufel?...
ru: OTHER: Какого черта?

source: HERO: Nie wiem, samo jakoś się tak porobiło.
de: HERO: Ich weiß auch nicht, es geschah irgendwie|von selbst.
ru: HERO: Я не знаю... Это как-то само получилось...

source: OTHER: Czy aby na pewno szanowny klient|jest martwy?...
de: OTHER: Ist unser verehrter Kunde auch wirklich|tot?...
ru: OTHER: Наш уважаемый клиент и вправду мертв?

source: HERO: O tak, tak, samobójca.
de: HERO: Aber ja, ich bin ein Selbstmörder.
ru: HERO: Да, я - самоубийца.

source: OTHER: No to pewnie źle zaklasyfikowałem|grzechy.
de: OTHER: Dann habe ich die Sünden falsch|klassifiziert.
ru: OTHER: Тогда я неправильно классифицировал|греховность.

source: OTHER: Bardzo przepraszam, mam nadzieję,|że to się więcej nie powtórzy.
de: OTHER: Ich bitte vielmals um Entschuldigung,|das wird nicht mehr passieren.
ru: OTHER: Сто раз извиняюсь, больше такого не будет.

source: OTHER: No i znowu!...
de: OTHER: Das kommt schon mal vor!...
ru: OTHER: Это уже было!

source: OTHER: Ech, starzeje się diabeł...
de: OTHER: Ja, ja, auch Teufel werden alt...
ru: OTHER: Да да, даже дьяволы стареют...

source: HERO: Bardzo przepraszam, czego panowie|pilnujecie?
de: HERO: Verzeihung, was bewachen Sie?
ru: HERO: Извините, за чем вы наблюдаете?

source: OTHER: Niczego.
de: OTHER: Nichts...
ru: OTHER: Ничего...

source: OTHER: Jak widać.
de: OTHER: ... wie man sieht.
ru: OTHER: ... как видите.

source: HERO: To po co tu stoicie?
de: HERO: Wozu stehen Sie dann hier herum?
ru: HERO: Зачем же вы тут стоите?

source: OTHER2: Tak ćwiczymy sobie wartę.
de: OTHER2: Wir üben Wache halten.
ru: OTHER2: Мы тренируем несение караула.

source: HERO: Jakoś nie wierzę...
de: HERO: Irgendwie glaube ich das nicht...
ru: HERO: Что-то мне не верится...

source: OTHER: Diabłom nikt nie wierzy.
de: OTHER: Teufeln glaubt niemand.
ru: OTHER: Черти никому не верят.

source: OTHER: Taki już nasz los...
de: OTHER: Das ist unser Schicksal...
ru: OTHER: Это наша судьба.

source: HERO: No to może mnie przepuścicie?
de: HERO: Vielleicht laßt Ihr mich doch mal eben durch?
ru: HERO: Может, вы меня пропустите?

source: OTHER2: Niestety.
de: OTHER2: Leider nein..
ru: OTHER2: Увы, нет.

source: HERO: Ha!
ru: HERO: Ха!

source: HERO: Więc jednak!
de: HERO: Also doch!
ru: HERO: Ну ладно!

source: HERO: Pilnujecie czegoś!
de: HERO: Ihr bewacht doch etwas!
ru: HERO: Вы за чем-то следите!

source: P#OTHER: Właśnie się zaczynam zastanawiać,|dlaczego nie masz ogona...
de: P#OTHER: Ich mache mir gerade Gedanken,|warum er eigentlich keinen Schwanz hat...
ru: P#OTHER: Что-то я задумываюсь, почему у него|нет хвоста...

source: P#OTHER: I różków jakoś nie widać...
de: P#OTHER: Und Hörnchen kann ich auch nirgendwo sehen...
ru: P#OTHER: И рогов что-то не видать...

source: HERO: Pozwólcie, że się przedstawię: Asmodeusz|Balla-ze-bubba.
de: HERO: Erlauben Sie, daß ich mich vorstell': |Asmodeus Balla-ze-bubba.
ru: HERO: Позвольте представиться: Асмодеус Балла-зе-бубба.

source: HERO: Jednostka do zadań piekielnie piekielnych.|Nasza specjalność, to charakteryzacja.
de: HERO: Von der Einheit für höllisch höllische|Aufgaben. Unsere Spezialität ist|das Schminken und Maskieren.
ru: HERO: Из подразделения адских заданий. Наша специальность|- маскировка и грим.

source: HERO: Muszę przyznać, że wykonujecie swoje obowiązki|idealnie. Trzymać tak dalej, chłopaki.
de: HERO: Ähem. Ihr erfüllt Eure Pflichten vorbildlich!|Weiter so, Jungs.
ru: HERO: Эхем. Вы прекрасно справляетесь! Так держать!

source: HERO: To ja już sobie pójdę.
de: HERO: Ich werde dann mal weitergehen..
ru: HERO: Я тогда пойду дальше.

source: HERO: Muszę przejść.
de: HERO: Ich muß hier durch.
ru: HERO: Я должен пройти.

source: HERO: Ważna sprawa.
de: HERO: Eine äußerst wichtige Angelegenheit.
ru: HERO: Очень важное дело.

source: OTHER: Ki diabeł?!
de: OTHER: Was zum Teufel?
ru: OTHER: Какого черта?

source: HERO: No właśnie, jako diabeł mam chyba|prawo wstępu.
de: HERO: Du sagst es, als Teufel darf ich doch wohl|hinein!
ru: HERO: Ты сам сказал, что как дьявол я могу пройти.

source: OTHER2: Coś ty jakiś taki dziwny...
de: OTHER2: Du kommst mir irgendwie komisch vor.
ru: OTHER2: Ты выглядишь странновато...

source: OTHER2: Różek złamany, ogona nie ma...
de: OTHER2: Mit dem abgebrochenen Hörnchen,|so ganz ohne Schwanz...
ru: OTHER2: С закрытыми рогами и без хвоста...

source: OTHER2: Choć capisz niewąsko...
de: OTHER2: Obwohl du zugegebenermaßen fürchterlich stinkst...
ru: OTHER2: Хоть ты и воняешь...

source: $0: Ten róg smok mi odgryzł.
de: $0: Ein Drache hat mir das Horn abgebissen.
ru: $0: Мне дракон откусил рога...

source: $1: Ogon straciłem przez pewnego nekromantę...
de: $1: Ein Nekromant ist schuld, daß ich den Schwanz verlor.
ru: $1: Некромант виноват, что я хвост потерял.

source: $2: O tak, śmierdzę jak nikt!
de: $2: Ja nicht wahr, ich stinke wie sonst niemand!
ru: $2: О, я вонюч как никто другой!

source: $3: Czy musicie być takimi formalistami?
de: $3: Muß das alles so formell sein?
ru: $3: Ну зачем все так формализовывать?

source: OTHER: Oj, kręcisz, kolego...
de: OTHER: Das ist doch geschwindelt, Freundchen...
ru: OTHER: Это все отговорки, друзья...

source: OTHER: Nawet magiczne kule ogniste nie są|w stanie skruszyć rogu...
de: OTHER: Selbst magische Feuerkugeln können kein|Teufelshorn zerbrechen....
ru: OTHER: Даже магические фаерболы не отшибают рогов.

source: HERO: Ale to był strasznie silny smok!
de: HERO: Aber es war ein schrecklich starker Drachen!
ru: HERO: Но это был очень крутой дракон!

source: OTHER: Musiałby mieć sztuczną szczękę|z żelaza, aby naruszyć róg.
de: OTHER: Er müßte schon ein künstliches Eisengebiß haben,|um das Horn zu beschädigen.
ru: OTHER: У него должны были быть стальные зубы, чтобы повредить|рогам!

source: OTHER: Poza tym...
de: OTHER: Außerdem...
ru: OTHER: Кроме того...

source: OTHER: Smocze zęby są dużo większe. Jakim|cudem zdołały dziabnąć tak mały róg?
de: OTHER: Drachenzähne sind viel zu groß.|Wie könnten sie so ein kleines|Horn abzwicken?
ru: OTHER: Зубы дракона слишком велики, чтобы|повредить такую мелочь...

source: HERO: No... Smok był silny, ale malutki.
de: HERO: Na ja... Der Drachen war zwar sehr stark, aber|andererseits war er wiederum ein sehr kleiner Drachen.
ru: HERO: Ну да... Он был крутой, но очень маленький...

source: OTHER2: To chyba smoczek, a nie smok.
de: OTHER2: Das kann doch kein richtiger Drachen|gewesen sein.
ru: OTHER2: Это не может быть настоящий дракон.

source: OTHER2: Nie podoba mi się twoja historia...#B0
de: OTHER2: Deine Geschichte gefällt mir nicht...#B0
ru: OTHER2: Мне не нравится твоя история.#B0

source: OTHER: Odciął?
de: OTHER: Uff...! Abgeschnitten?
ru: OTHER: Отрубил?

source: HERO: Nie, wezwał mnie do pentagramu, a potem|podstępem przybił ogon do podłogi|i odesłał mnie z powrotem.
de: HERO: Nein, er ließ mich zu einem Pentagramm kommen, dann|hat er hinterlistig meinen Schwanz am Fußboden|angeschlagen und dann schickte er mich weg.
ru: HERO: Нет. Он позволил мне вступить в пентаграмму, а затем|околдовал и отрезал хвост.

source: HERO: Ja wróciłem, a ogon został.
de: HERO: Ich kam zurück, doch der Schwanz blieb angeschlagen.
ru: HERO: Я вырвался, но хвост остался там.

source: OTHER2: A dlaczego go nie zagryzłeś, kiedy|przybijał ci ogon?
de: OTHER2: Und warum hast du ihn nicht totgebissen, als er|deinen Schwanz anschlug?
ru: OTHER2: А почему ты его не закусал до смерти?

source: OTHER2: Przecież musiał przekroczyć linie|pentagramu?
de: OTHER2: Er muß doch die Linien des Pentagramms|überschritten haben, oder?
ru: OTHER2: Он же должен был переступить линии пентаграммы?

source: HERO: Miałem chwilę dystrakcji.
de: HERO: Tja, das war weil ... ich hatte einen kleinen Blackout.
ru: HERO: Да, но я почти упал в обморок...

source: HERO: Ale poza tym zrobił to szybko. To był|bardzo szybki nekromanta.#B0
de: HERO: Außerdem hat er es so schnell gemacht. Ja, es war|ein sehr schneller Nekromant.#B0
ru: HERO: Потом, он так быстро все проделал... Это был очень|быстрый некромант.#B0

source: OTHER: Ale nie czuję ani strawionego robactwa,|ani zakrzepłego guana...
de: OTHER: Aber ich rieche weder verdautes Ungeziefer|noch verhärtetes Guano...
ru: OTHER: Что-то мне все это напоминает лапшу...

source: OTHER: Ani nawet zgnilizny moralnej.
de: OTHER: Und keine Spur moralischer Verkommenheit...
ru: OTHER: И ни следа моральности...

source: HERO: Bo właśnie wpadłem do wody.
de: HERO: Nun, ich bin gerade ins Wasser gefallen.
ru: HERO: Нет, я только что упал в воду.

source: HERO: Przypadkiem.
de: HERO: Durch Zufall.
ru: HERO: Случайно.

source: HERO: Poślizgnąłem się.
de: HERO: Ich bin ... ausgerutscht.
ru: HERO: Меня... Столкнули.

source: P#OTHER: Coś suchy jesteś jak na kogoś,|kto "właśnie wpadł do wody"...
de: P#OTHER: Du bist ganz schön trocken für jemanden,|der "gerade ins Wasser gefallen ist"...
ru: P#OTHER: Ты слишком сух для того, кто "только что упал|в воду".

source: HERO: Mam gorączkę i szybko schnę...|To rodzinne.
de: HERO: Äh, ich habe Fieber und deswegen trockne|ich so schnell. Das liegt bei uns in der Familie.
ru: HERO: У меня температура поднялась, поэтому я быстро|высушился. Это у нас семейное.

source: OTHER2: Coś mi fałszem zalatuje ta|twoja opowieść...#B0
de: OTHER2: An dieser Geschichte stinkt doch was...#B0
ru: OTHER2: Что-то от этой истории пахнет...#B0

source: OTHER: Lucyfer kazał pilnować, to|pilnujemy.
de: OTHER: Luzifer hat befohlen, daß Wache gehalten wird|also halten wir Wache.
ru: OTHER: Люцифер приказал охранять, вот мы и охраняем.

source: OTHER: Szef też ma prawo odpocząć od polityki.
de: OTHER: Außerdem hat unser Chef auch das Recht,|sich mal von seinen Geschäften zu erholen.
ru: OTHER: Потом, шеф тоже может отдохнуть малость,|не так ли?

source: OTHER: Tylko ważne sprawy, powiedział.
de: OTHER: Nur wenn es wichtig ist, hat er gesagt.
ru: OTHER: Он сказал, пускать только по особо важным делам.

source: HERO: Ja mam bardzo ważną sprawę.
de: HERO: Aber ich bin hier in einer sehr wichtigen Sache.
ru: HERO: Но я тут по очень важному делу.

source: OTHER2: E tam, każdy tak mówi.
de: OTHER2: Ach was, das sagen sie alle.
ru: OTHER2: Так все говорят.

source: OTHER2: A ostatnio jakoś dużo tu się|kręci podejrzanych typów.
de: OTHER2: Und in der letzten Zeit treiben sich hier|viele verdächtige Typen herum.
ru: OTHER2: И многовато стало подозрительных типов шляться...

source: OTHER2: Poza tym, coś mi się w tobie|nie podoba...
de: OTHER2: Irgendwas gefällt mir nicht|an dir...
ru: OTHER2: Что-то мне в тебе не нравится...

source: OTHER2: Sam nie wiem co, ale jakiś taki jesteś,|no czy ja wiem...
de: OTHER2: Ich weiß nicht was, aber du bist,|irgendwie, ach was weiß ich...
ru: OTHER2: Я не знаю, но ты кажешься... Я не|знаю...

source: OTHER2: Choć z drugiej strony, przyjmują teraz|byle kogo.
de: OTHER2: Anscheinend wird in letzter Zeit so gut wie|jeder hier aufgenommen.
ru: OTHER2: Как кто-то кто сюда совсем недавно попал...

source: OTHER2: Ani piekielnego wyglądu, ani demonicznego|zapału, ani lucyferycznego zaangażowania.
de: OTHER2: Auch solche ohne jedes höllische Aussehen, ohne jeden|teuflischen Eifer und ohne jedes luziferische Engagement.
ru: OTHER2: Как кто-то у кого еще нет отличительных знаков черта.

source: OTHER2: Dddiabli tam!#B0
de: OTHER2: Zum Teufel!#B0
ru: OTHER2: К черту!#B0

source: OTHER: Słuchaj, może ty i jesteś diabeł, ale jeśli|coś kręcisz, to Lucyfer zrobi nas w anioła.
de: OTHER: Hör mal, vielleicht bist du tatsächlich|ein Teufel, aber wenn du gelogen hast,|wird uns Luzifer in Engel verwandeln.
ru: OTHER: Слушай, может ты и черт, но если ты соврал,|то Люцифер нас ангелами сделает!

source: OTHER: Wróć, jak dorośniesz.
de: OTHER: Komm zurück, wenn du erwachsen bist.
ru: OTHER: Возвращайся, когда подрастешь...
