Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: HERO: Znowu!
de: HERO: Na sieh mal einer an!
ru: HERO: Ты только посмотри!

source: OTHER: Ciebie jeszcze nie dorwali?
de: OTHER: Dich haben sie noch nicht erwischt?
ru: OTHER: Тебя еще не поймали?

source: HERO: Nie dorwali i nie dorwą.
de: HERO: Sie haben mich nicht erwischt|und sie werden mich auch nicht erwischen.
ru: HERO: Меня еще не поймали, и никогда|не поймают!

source: HERO: Trzeba mieć trochę oleju w głowie, a nie|tylko pewność siebie.
de: HERO: Man muß eben ein bißchen mit Bedacht handeln|und nicht nur von sich selbst eingenommen sein.
ru: HERO: Нужно действовать осмотрительно и все планируя.

source: OTHER: O nie mój drogi, myślisz, że|się przed tobą ukorzę?
de: OTHER: Ha, mein Lieber, du glaubst wohl, jetzt hast du mich,|daß ich mich vor dir erniedrige?
ru: OTHER: Думаешь, я тебя недооцениваю?

source: OTHER: "Ależ jesteś silny i mądry,| mój ty bohaterze".
de: OTHER: "Mein starker und kluger Held,|mein Erretter".
ru: OTHER: "Мой сильный и хитрый герой, мой|спаситель".

source: HERO: Mów dalej, dobrze ci idzie.
de: HERO: Sprich nur weiter, du machst das ganz gut.
ru: HERO: Ты говори, у тебя неплохо получается.

source: OTHER: Tym razem znowu nie potrzebuję|twojej pomocy!
de: OTHER: Diesmal brauche ich deine Hilfe|nicht!
ru: OTHER: Мне твоя помощь больше не нужна!

source: OTHER: Poradzę sobie sama!
de: OTHER: Ich komme alleine zurecht!
ru: OTHER: Сама справлюсь!

source: HERO: Cóż, ponoć do trzech razy sztuka.
de: HERO: Na ja, aller guten Dinge sind drei.
ru: HERO: Да, все хорошее бывает трижды.

source: HERO: Posiedzisz chwilę, to zmienisz|zdanie.
de: HERO: Wenn du hierbleibst, wirst du deine Meinung|bald ändern.
ru: HERO: Если ты тут останешься, то ты скоро сменишь|свое мнение.

source: HERO: Czy próbowałaś ominąć tych dwóch|strażników niedaleko?
de: HERO: Hast du versucht, den beiden Wächtern|in der Nähe zu entkommen?
ru: HERO: Ты пытался пройти стражу?

source: OTHER: A jak myślisz, dlaczego tu jestem?
de: OTHER: Was meinst du wohl, warum ich hier bin?
ru: OTHER: А как ты думаешь, почему я здесь?

source: OTHER: Walczyłam jak mogłam, nawet zdołałam|kopnąć jednego w ...no wiesz...
de: OTHER: Ich habe alles gegeben im Kampf...|es ist mir sogar gelungen, ihn in die...|du weißt schon... zu treten.
ru: OTHER: Я все отдал борьбе... мне почти удалось...

source: HERO: O chłopie...
de: HERO: Uiuiui!
ru: HERO: Юююю!

source: OTHER: ...ale miał diabelnie twarde i chyba tylko|posiniaczyłam sobie stopę. Potem drugi mnie|ogłuszył.
de: OTHER: ...Aber es war teuflisch hart und ich habe|nun ich einen riesigen blauen Fleck am Fuß.|Danach hat mich der zweite K.O. geschlagen.
ru: OTHER: Но это было чертовски тяжело и меня победили.

source: OTHER: Następne, co pamiętam, to ta cela.
de: OTHER: Das nächste, woran ich mich erinnere,|ist diese Zelle.
ru: OTHER: Все, что я потом помню - эта камера.

source: P#HERO: No tak.
de: P#HERO: Na ja.
ru: P#HERO: Ну да.

source: HERO: Mnie nie złapali, ale nawet przebranie|za diabła nie pomogło.
de: HERO: Mich haben sie zwar nicht gefangen,|aber selbst die Teufelsverkleidung|hat nichts genützt.
ru: HERO: Меня они не поймали, но оказалось,|что только одежды черта недостаточно.

source: OTHER: A to dlaczego?
de: OTHER: Warum das?
ru: OTHER: Почему?

source: HERO: Brak mi najwyraźniej siły przekonywania.
de: HERO: Höchstwahrscheinlich fehlt mir|die Überzeugungskraft.
ru: HERO: Мне не хватает силы убеждения.

source: P#OTHER: Posłuchaj mnie teraz uważnie.
de: P#OTHER: Jetzt hör' mir mal gut zu.
ru: P#OTHER: Теперь послушай.

source: OTHER: Choć to co powiem może cię zdziwi.
de: OTHER: Obwohl das, was ich dir nun sage,|dich vielleicht wundern wird.
ru: OTHER: Хотя тебе это, скорее всего, не понравится.

source: P#HERO: Słucham, słucham.
de: P#HERO: Ich höre zu. Ich höre ja zu.
ru: P#HERO: Я слушаю, слушаю.

source: OTHER: Po pierwsze, bardzo cię przepraszam|za wszystko.
de: OTHER: Erstens möchte ich mich für alles bei|dir entschuldigen.
ru: OTHER: Во-первых, я хочу попросить за все прощения.

source: OTHER: Trzeba spojrzeć prawdzie w oczy.
de: OTHER: Ich muß der Wahrheit schließlich|ins Gesicht sehen.
ru: OTHER: Я должен сказать правду в лицо.

source: OTHER: Choć na takiego nie wyglądasz,|to jednak wychodzisz z kłopotów|obronną ręką.
de: OTHER: Obwohl du wirklich nicht danach|aussiehst, scheinst du immer mit einem|blauen Auge davonzukommen.
ru: OTHER: Хотя ты этого и не видишь, ты всегда|легко отделываешься.

source: OTHER: Ja natomiast wciąż się w nie pakuję.
de: OTHER: Ich dagegen komme immer wieder in Schwierigkeiten.
ru: OTHER: Я же, напротив, всегда попадаю в неприятности.

source: OTHER: Byłam niesprawiedliwa i nieuprzejma.|I to się więcej nie powtórzy.
de: OTHER: Ich war ungerecht und sehr unhöflich zu dir.|Das wird nicht wieder vorkommen.
ru: OTHER: Я был к тебе несправедлив. Этого не повториться.

source: OTHER: Słowo.
de: OTHER: Versprochen.
ru: OTHER: Обещаю.

source: $0: Słowo honoru?
de: $0: Ehrenwort?
ru: $0: Честное слово?

source: $1: Przysięgasz?
de: $1: Schwörst du?
ru: $1: Ты клянешься?

source: $2: Poważnie poważnie?
de: $2: Im Ernst?
ru: $2: Честно?

source: OTHER: Słowo honoru.
de: OTHER: Ehrenwort.
ru: OTHER: Честное слово.

source: OTHER: Przysięgam.
de: OTHER: Ich schwöre.
ru: OTHER: Клянусь.

source: OTHER: Bardzo bardzo.
de: OTHER: Voller Ernst.
ru: OTHER: Абсолютно.

source: P#OTHER: A teraz po drugie.
de: P#OTHER: Und nun zweitens.
ru: P#OTHER: А теперь второе.

source: OTHER: Musisz dostać się do więzienia.
de: OTHER: Du mußt hierher ins Gefängnis kommen.
ru: OTHER: Ты должен войти в тюрьму.

source: OTHER: O nic nie pytaj, zaufaj mi, w końcu|mam w tym interes, żeby się stąd|wydostać.
de: OTHER: Frag' nicht, vertraue mir einfach,|schließlich habe ich ja ein Interesse daran,|hier herauszukommen.
ru: OTHER: Только ничего не спрашивай и верь мне.|Я сам заинтересован выйти отсюда скорее.

source: OTHER: Idź i daj się zaaresztować.
de: OTHER: Geh' jetzt und laß dich verhaften.
ru: OTHER: Иди и позволь себя поймать.

source: OTHER: Sposób znasz...
de: OTHER: Du weißt, was du zu tun hast...
ru: OTHER: Ты знаешь, что тебе делать.

source: HERO: <ciężkie westchnienie>
de: HERO: Hmmm.
ru: HERO: Хм...

source: OTHER: O... mój... Boże...
de: OTHER: O...mein...Gott...
ru: OTHER: О.. мой.. бог...

source: OTHER: Tylko nie to...
de: OTHER: Nur das nicht...
ru: OTHER: Ну ничего...

source: OTHER: A oto plan.
de: OTHER: Und das ist mein Plan.
ru: OTHER: А вот и мой план.

source: OTHER: Zauważyłam, że już jacyś więźniowie|przed nami starali się stąd uciec.
de: OTHER: Ich habe bemerkt, daß frühere Gefangene|schon versucht haben, auszubrechen.
ru: OTHER: Я заметил, что предыдущие пленники уже пытались|бежать отсюда.

source: OTHER: Jeden z tych olbrzymich kamieni, z których|wymurowano ścianę, jest naruszony.
de: OTHER: Einer der riesigen Steine der|Gefängnismauer ist locker geworden,|das wird unsere Rettung sein.
ru: OTHER: И цемент в камнях совсем раскрошился.|Это - наш путь к спасению.

source: OTHER: Kiedy się w niego wali podeszwą, to słychać|inny dźwięk.
de: OTHER: Wenn man tüchtig mit dem Absatz dagegen schlägt,|hört sich dieser Stein anders an.
ru: OTHER: Если тут постучать, то слышна пустота.

source: OTHER: Mam nadzieję, że dasz radę go wyciągnąć.
de: OTHER: Ich hoffe nur, du kommst mit dem Stein zurecht.
ru: OTHER: Я надеюсь, ты справишься с камнем.

source: OTHER: To chyba bułka z masłem dla takiego|rosłego chłopca...
de: OTHER: Das kann doch nicht so schwer sein für so einen|starken Kerl wie dich...
ru: OTHER: Это не должно быть тяжело для такого сильного парня...

source: P#HERO: Wyczuwam ironię...
de: P#HERO: Höre ich da etwa Ironie in deiner Stimme...
ru: P#HERO: Что-то мне чудится ирония в твоем голосе...

source: HERO: Czy przypadkiem całe te twoje|przeprosiny nie były tylko po|to, żeby mnie tu ściągnąć?
de: HERO: Waren deine Entschuldigungen etwa|nur ein Vorwand, um mich herzulocken?
ru: HERO: Твои извинения были всего лишь трюком,|чтобы меня приманить?

source: HERO: Żebym odwalił czarną robotę?
de: HERO: Damit ich die Drecksarbeit mache?!
ru: HERO: Чтобы заставить меня выполнять тяжелую физическую работу?

source: OTHER: A co to za różnica? Lepiej|weź się za kamień. Szkoda|czasu.
de: OTHER: Was macht das jetzt für einen Unterschied?|Mach dich lieber an die Arbeit, los doch!|Worauf wartest du?
ru: OTHER: Да какая разница? Давай, за работу!

source: OTHER: Hej! Raz, dwa!
de: OTHER: Und eins und zwei und eins und zwei...
ru: OTHER: И раз, и два, и раз, и два!

source: OTHER: Chyba nie potrzebujesz pomocy słabej|kobiety?...
de: OTHER: Du wirst doch wohl nicht die Hilfe einer|schwachen Frau benötigen?...
ru: OTHER: Ты же не захочешь пользоваться помощью слабой|женщины?..

source: OTHER: Żyłki pękają?...
de: OTHER: Platzen dir die Äderchen vor Anstrengung?...
ru: OTHER: Ты что, перенапрягаешься?

source: OTHER: To chyba nie był dobry pomysł...
de: OTHER: Das war wohl doch keine gute Idee...
ru: OTHER: Это было не лучшей идеей...

source: OTHER: No to sobie tu chyba posiedzę...
de: OTHER: Ich werde wohl für immer dableiben müssen...
ru: OTHER: Я должен буду остаться тут навсегда...

source: HERO: W porządku, jesteśmy uratowani.
de: HERO: In Ordnung, wir sind gerettet.
ru: HERO: Все в порядке, мы спасены.

source: HERO: Zaraz nas stąd magicznie przeniesie|do rozdzielni.
de: HERO: Wir werden gleich von hier in|eine Art Verteilerraum versetzt.
ru: HERO: Мы сейчас перенесемся куда-нибудь...

source: HERO: Coś mi się wydaje, że ta magiczna|moc przenosząca zgłupiała.
de: HERO: Ich glaube, die magische Kraft, die uns versetzen|soll, hat uns versetzt...
ru: HERO: Мне кажется, магическая сила не действует...

source: HERO: Pewnie dlatego, że w celi jest aż|dwoje ludzi, i nie wie, kogo|odesłać.
de: HERO: Ach, ich weiß warum. Sicher deswegen, weil es in der|Zelle zwei Personen gibt und sie nicht weiß, wer zu|versetzen ist.
ru: HERO: Я знаю почему. В комнате два человека, и она не знает,|кого переносить.

source: OTHER: No to co teraz?
de: OTHER: Und was nun?
ru: OTHER: И что делать?

source: HERO: Może gdybyśmy udawali jednego|człowieka, to by pomogło?
de: HERO: Wenn wir so tun, als ob wir nur ein einziger Mensch|sind, das könnte helfen...
ru: HERO: Если бы могли притвориться одним существом...

source: HERO: Na przykład gdybyśmy się mocno|przytulili?...
de: HERO: Ich meine, wenn wir uns ganz eng aneinander|drücken?...
ru: HERO: Если плотно прижаться друг к другу?..

source: OTHER: Chyba oszalałeś!...
de: OTHER: Du bist wohl verrückt!...
ru: OTHER: Ты, пошляк!

source: P#P#OTHER: Ale zdaje się, że nie mam wyjścia.
de: P#P#OTHER: Es scheint aber, als hätte ich|keinen anderen Ausweg.
ru: P#P#OTHER: Но у меня нету выбора.

source: OTHER: Zacisnę zęby i może to jakoś|przetrzymam.
de: OTHER: Ich werde die Zähne zusammenbeißen und|irgendwie werde ich das überstehen.
ru: OTHER: Я стисну зубы и попытаюсь это пережить.

source: OTHER: To chyba nie działa.
de: OTHER: Es nützt nichts...
ru: OTHER: Это не поможет...

source: HERO: Poczekajmy jeszcze chwilkę.
de: HERO: Warten wir noch eine Weile.
ru: HERO: Подождем чуть-чуть...

source: OTHER: Puść mnie.
de: OTHER: Laß mich los!
ru: OTHER: Отпусти меня!

source: HERO: Jeszcze sekundkę.
de: HERO: Noch eine Sekunde.
ru: HERO: Еще секунду.

source: OTHER: PUŚĆ MNIE, DO DIABŁA!!!
de: OTHER: LASS MICH LOS ZUM TEUFEL!!!
ru: OTHER: ОТПУСТИ МЕНЯ К ЧЕРТУ!!!

source: HERO: Ale zaraz...
de: HERO: Aber Moment mal...
ru: HERO: Но секундочку...

source: HERO: Ja mogę przebrać się za diabła, ale ciebie|w tej masce natychmiast rozpoznają.
de: HERO: Ich kann mich als Teufel verkleiden,|aber du wirst in deiner Maske sofort erkannt.
ru: HERO: Я могу переодеться чертом, но тебя узнают|в твоей маске.

source: P#OTHER: Cóż...
de: P#OTHER: Na ja...
ru: P#OTHER: Ну да...

source: P#OTHER: W końcu i tak musiałabym pokazać swą|twarz Lucyferowi.
de: P#OTHER: Letztendlich müßte ich sowieso Luzifer|mein Gesicht zeigen.
ru: P#OTHER: В конце концов все равно пришлось бы показать|Люциферу свое лицо.

source: OTHER: Skoro jesteśmy już tak blisko celu...
de: OTHER: Nun, da wir schon so nahe am Ziel sind...
ru: OTHER: Мы так близки к цели...

source: HERO: Nic nie rozumiem!
de: HERO: Jetzt verstehe ich gar nichts mehr!
ru: HERO: Теперь я вообще ничего не понимаю!

source: HERO: Jesteś śliczna!
de: HERO: Du bist ja wunderschön!
ru: HERO: Ты прекрасна!

source: HERO: Jesteś ...śliczna!
de: HERO: Schön bist du!
ru: HERO: Ты... прекрасна!

source: HERO: Jesteś...
de: HERO: Du bist...
ru: HERO: Ты...

source: OTHER: Śliczna.
de: OTHER: Schön.
ru: OTHER: Прекрасна.

source: OTHER: Właśnie dlatego ją nosiłam.
de: OTHER: Gerade deswegen habe ich sie ja getragen.
ru: OTHER: Вот поэтому я её и носила.

source: OTHER: Jestem córką króla z południa,|na imię mi Shandria.
de: OTHER: Ich bin die Tochter eines Königs der|südlichen Länder und ich heiße Shandria.
ru: OTHER: Я - дочь короля южных земель. Меня зовут|Шандрия.

source: OTHER: Przypuszczam, że tatko mnie od dawna|poszukuje.
de: OTHER: Ich vermute, daß mein Papa mich|seit langem sucht.
ru: OTHER: Я подозреваю, что отец давно меня|ищет.

source: OTHER: Każdy rozpoznałby moją twarz bez trudu...
de: OTHER: Jeder würde mein Gesicht|erkannt haben...
ru: OTHER: Все могут меня узнать в лицо...

source: OTHER: A ja chciałam mścić się sama.
de: OTHER: Aber ich wollte mich selbst rächen.
ru: OTHER: Но я сама хочу за себя решать.

source: OTHER: Nie jestem już taką małą dziewczynką,|za jaką mnie tatko uważa.
de: OTHER: Ich bin nicht das kleine Mädchen|für das mich mein Papa hält.
ru: OTHER: Я не маленькая девочка, какой меня|считает папа.

source: HERO: To na pewno...
de: HERO: Das auf gar keinen Fall...
ru: HERO: Да уж...

source: OTHER: To znowu ty?
de: OTHER: Du bist es wieder?
ru: OTHER: Это опять ты?

source: P#OTHER: Uuuu...
de: P#OTHER: Uhh...
ru: P#OTHER: Гххх...

source: OTHER: A co to za piękna dziewoja|ci towarzyszy?
de: OTHER: Und was für ein schönes Mädchen|begleitet dich da...
ru: OTHER: И что за красивая спутница?

source: OTHER: Mój przyjacielu...
de: OTHER: ... mein Freund?
ru: OTHER: ... мой друг?

source: HERO: Teraz to przyjacielu....
de: HERO: Nun mein Freund...
ru: HERO: Ага, теперь я друг...

source: HERO: Ta grzesznica twierdzi, że przed przydzieleniem|do celi musi koniecznie porozmawiać z Lucyferem.
de: HERO: Diese Sünderin hier besteht darauf, daß sie vor|der Zuteilung einer Zelle unbedingt mit Luzifer|persönlich sprechen muß.
ru: HERO: Эта южанка говорит, что ей надо обязательно переговорить|с Люцифером.

source: HERO: Mówi, iż ma niezwykle pilną sprawę.
de: HERO: Sie sagt, es sei in einer äußerst wichtigen|Angelegenheit.
ru: HERO: Это по очень важному делу.

source: OTHER2: Jacy silni strażnicy, mmm...
de: OTHER2: Was für ein starker Wächter, hmmm...
ru: OTHER2: Какой сильный охранник... Хм...

source: OTHER2: Jak tylko rzucę okiem na Lucyfera,|chętnie z wami dłużej porozmawiam...
de: OTHER2: Sobald ich Luzifer gesprochen habe, würde ich|mich gerne ein wenig mit Euch unterhalten...
ru: OTHER2: Пока я с удовольствием поговорю с тобой.

source: OTHER2: Pamiętajcie, trafiłam do Piekła za|wyjątkowo nieprzystojne rzeczy...
de: OTHER2: Übrigens bin ich wegen ganz obszöner Dinge|hierher in die Hölle geraten...
ru: OTHER2: В конце концов, я не просто так попал в ад...

source: OTHER: <gulp>
de: OTHER: grmpf
ru: OTHER: гмф

source: OTHER: Ależ proszę, proszę, żaden problem.
de: OTHER: Aber bitte, bitte, kein Problem.
ru: OTHER: Пожалуйста, пожалуйста, никаких проблем.

source: OTHER: Lucyfer będzie zachwycony. He he he...
de: OTHER: Luzifer wird entzückt sein. He he he...
ru: OTHER: Люцифер будет поражен. Хе хе хе .

source: OTHER: Czekamy, dziecinko na ...nagrodę.
de: OTHER: Ich bin hier, Süße, wenn du mich brauchst...
ru: OTHER: Я тут, дорогуша, раз ты меня зовешь...

source: OTHER: Przebyliśmy taki kawał drogi, a ten|stary dureń drzemie!
de: OTHER: Wir haben so einen weiten Weg zurückgelegt,|und der alte Trottel pennt!
ru: OTHER: Мы проделали такой длинный путь..

source: $0: Szanowny panie Lucyferze!
de: $0: Sehr verehrter Herr Luzifer!
ru: $0: Уважаемый господин Люцифер!

source: $1: Lucyferze!
de: $1: Hey, Luzifer!
ru: $1: Эй, Люцифер!

source: $2: O wielki Lucyferze!
de: $2: O Großer Luzifer!
ru: $2: О Великий Люцифер!

source: $3: Lucyferze, panie Piekła!
de: $3: Luzifer, Herr der Hölle!
ru: $3: Люцифер, владыка ада!

source: $4: Padliśmy ofiarą jednego z twoich demonów.
de: $4: Wir sind zum Opfer eines deiner Dämonen geworden.
ru: $4: Мы стали жертвами одного из твоих демонов.

source: $5: Jesteśmy niesprawiedliwie więzionymi śmiertelnikami.
de: $5: Wir werden ungerecht gefangengehalten.
ru: $5: Нас несправедливо посадили.

source: $6: To świństwo!
de: $6: Es ist eine Sauerei!
ru: $6: Это все несправедливо!

source: $7: Została wyrządzona nam straszna krzywda!
de: $7: Uns ist ein schreckliches Unrecht widerfahren!
ru: $7: Мы - жертвы ошибки!

source: $8: Żądamy surowego ukarania winnych!
de: $8: Wir wollen, daß die Schuldigen streng bestraft werden!
ru: $8: Мы хотим, чтобы виновных покарали!

source: $9: Chcę odzyskać swoje ciało!
de: $9: Ich möchte meinen Körper wieder zurück!
ru: $9: Я хочу назад свое тело!

source: $10: I trzeba coś z tym fantem zrobić!
de: $10: Es muß etwas geschehen!
ru: $10: Что-то должно произойти!

source: $11: Chcemy zemsty!
de: $11: Wir wollen Rache!
ru: $11: Мы хотим мести!

source: $12: Halo?!
de: $12: Hallo?
ru: $12: Але?

source: $13: Ktoś nas w ogóle słucha?!
de: $13: Hört uns jemand?!
ru: $13: Нас кто-нибудь слышит?

source: $14: Do licha ciężkiego, co za ignorancja!
de: $14: Verdammt noch mal, was für eine Ignoranz!
ru: $14: Ты подумай, какой непочтение!

source: $15: Słyszysz nas, Lucyferze?!
de: $15: Hörst du uns, Luzifer?!
ru: $15: Ты нас слышишь, Люцифер?

source: OTHER: Co?...
de: OTHER: Was?...
ru: OTHER: Что?

source: OTHER: Co mówicie?...
de: OTHER: Was ist los?...
ru: OTHER: Что случилось?

source: OTHER: Opowiedzcie wszystko jeszcze raz...
de: OTHER: Fangt nochmal von vorne an...
ru: OTHER: Начните сначала...

source: OTHER: W miarę trwania opowieści Lucyfer był coraz|mniej śpiący, lecz za to coraz bardziej|zdumiony.
de: OTHER: Im Laufe der Erzählung wurde Luzifer immer weniger|müde und staunte dafür umso mehr.
ru: OTHER: В течение рассказа Люцифер становился все менее сонным|и все более грозным.

source: HERO: To właśnie on!
de: HERO: Das ist er!
ru: HERO: Вот он!

source: OTHER: To właśnie on!
de: OTHER: Das ist er!
ru: OTHER: Вот он!

source: HERO: Ten sam demon był przyczyną naszych|nieszczęść?
de: HERO: War etwa der gleiche Dämon schuld|an unser beider Unglück?
ru: HERO: Что, один и тот же демон виноват в|наших бедах?

source: OTHER: Poznaję go!
de: OTHER: Ich habe ihn auch erkannt!
ru: OTHER: Я его тоже узнал!

source: OTHER: A my mamy więcej wspólnego niż myślałam...
de: OTHER: Damit haben wir wirklich mehr gemeinsam|als ich dachte...
ru: OTHER: Мы и в правду имеем много общего...

source: OTHER: Tak, mój panie?
de: OTHER: Ja, mein Meister?
ru: OTHER: Да, господин?

source: OTHER: Rozpoczął się iście piekielny ogień pytań.
de: OTHER: Und nun begann ein höllisches Verhör.
ru: OTHER: И начался адский допрос.

source: OTHER: Jesteś najbardziej nikczemnym, zuchwałym|i zepsutym diabłem w ostatnich latach.
de: OTHER: Du bist der frechste, der gemeinste|und der unanständigste Teufel, der mir|in den letzten Jahren begegnet ist.
ru: OTHER: Ты - самый мерзкий, наглый и лживый|черт, которого я встречал за последние|годы!

source: OTHER: Przebijasz nawet Belzebuba.
de: OTHER: Du übertriffst selbst Beelzebub!
ru: OTHER: Ты переигрываешь, Беельцебууб!

source: OTHER2: Wszystko dla twojej chwały,|mój panie.
de: OTHER2: Alles nur zu Eurer Ehre,|mein Meister.
ru: OTHER2: Все только в вашу честь,|Мастер.

source: OTHER2: Mówiłem, że moje nowoczesne metody|przyniosą rezultat i dotrzymuję|słowa.
de: OTHER2: Ich sagte doch, daß meine moderne Methoden|Erfolg bringen werden und ich habe mein Wort|gehalten.
ru: OTHER2: Я обещал, что мои модные методы будут успешными|и я сдержал слово.

source: OTHER2: Zasady są po to, by je łamać!
de: OTHER2: Die Regeln sind dazu da, daß man sie bricht!
ru: OTHER2: Правила существуют для того, чтобы их нарушать!

source: OTHER2: Postęp musi skruszyć zmurszałe|i przestarzałe prawo!
de: OTHER2: Der Fortschritt muß den morschen|Ast abbrechen!
ru: OTHER2: Прогресс должен идти вперед!

source: OTHER: I za to należy ci się nagroda, a tym dwóm|idiotom jakaś specjalna kara, może małe|przypalanko, może...
de: OTHER: Ja, und dafür wirst du einen Preis erhalten und die|beiden Idioten hier eine spezielle Strafe bekommen,|vielleicht eine Hauptrolle beim höllischen Barbecue...
ru: OTHER: Да, и ради этого ты готов заплатить цену, и назначить|этим двум идиотам специальное наказание, например,|особую роль на нашей пирушке...

source: P#OTHER: Z drugiej jednak strony...
de: P#OTHER: Andererseits...
ru: P#OTHER: С другой стороны...

source: P#OTHER: ...nie można tolerować narobionych|przez ciebie kłopotów.
de: P#OTHER: ...läßt sich nicht leugnen, daß du großen|Schaden angerichtet hast.
ru: P#OTHER: ... Нельзя отрицать, что ты нанес серьезный|ущерб...

source: OTHER: I tego, że do Piekła dostali się|zwykli śmiertelnicy, a ten na górze|znowu mnie upokarza.
de: OTHER: Wegen dir haben normale Sterbliche die|Hölle betreten und der da oben konnte mich|mal wieder demütigen...
ru: OTHER: Из-за этого у нас теперь в аду появились|смертные, а мне теперь наверху отдуваться...

source: OTHER: Jeśli nie odkręcisz tego w 5 sekund,|ja odkręcę ci łeb.
de: OTHER: Wenn du das nicht innerhalb von 5 Minuten wieder|gut machst, werde ich dir den Hals umdrehen.
ru: OTHER: Если через пять минут ты все не исправишь, я тебе|всю рожу раскурочу.

source: OTHER: A potem spokojnie porozmawiamy sobie o|ŁAMANIU, KRUSZENIU I WYPALANIU.
de: OTHER: Und dann können wir ein bißchen über|KNACKEN und BACKEN plaudern, he,he.
ru: OTHER: А потом мы сможем поболтать о побоях...|Хе хе хе.

source: OTHER: I to będzie długa rozmowa.
de: OTHER: Und das wird ein langes Gespräch werden.
ru: OTHER: И это будет долгий разговор.

source: OTHER: Kyytzaz oz ysokai-ert, de'ien syp|fijunok elintishetem olczoban.
ru: OTHER: Киитаз оз йоскай-эрт, дьен сип фьенк|ольсбан.

source: HERO: Co to za język?!
de: HERO: Was für eine Sprache ist das denn?
ru: HERO: Это еще что за язык?

source: OTHER: No kiczi yrdekel wodź nem.
ru: OTHER: Но кирци ирдкель инц идеем.

source: HERO: Przepraszam, czy mówi pan w jakimś|normalnym języku?
de: HERO: Verzeihung, sprechen Sie vielleicht|eine normale Sprache?
ru: HERO: Извините, может вы будете говорить нормально?

source: OTHER: Kopi le soruś, nincz ideem.
de: OTHER: Kopi le soruá, nincz ideem.
ru: OTHER: Копиле соруб, нинц идеем...

source: HERO: Potrzebuję pomocy... Tłumacza...
de: HERO: Ich brauche die Hilfe... eines Übersetzers...
ru: HERO: Мне нужна помощь, переводчик.

source: OTHER: Eket meturerery tu dekemetere vo ioy.
ru: OTHER: Экет мутенрей ту декеметере во илое.

source: HERO: Halo? Jaki to kraj? Gdzie ja|jestem?
de: HERO: Hallo? Was für ein Land ist das? Wo bin ich hier?
ru: HERO: Але! Это что за страна? Как я сюда попал?

source: OTHER: Ne huijeszkedj! Bessej|yrthetyen.
de: OTHER: Niensch bijesoryö.
ru: OTHER: Ниекш бьесрос.

source: HERO: Czy sprzedaje pan może czosnek?
de: HERO: Verkaufen Sie vielleicht Knoblauch?
ru: HERO: Вы продаете чеснок?

source: OTHER: Chodj mondod? Mi jez o newetrzigesz|bessied.
ru: OTHER: Чод мондон? Ми егр сьез безис.

source: HERO: Potrzebuję czosnku!
de: HERO: Ich brauche Knoblauch!
ru: HERO: Мне нужен чеснок!

source: OTHER: Newetrzegesz wolt, de mosztmar nem.
ru: OTHER: Нервеген, кроль старпин.

source: HERO: Potrzebuję na chwilę pani szala...
de: HERO: Ich bräuchte Ihren Schal für einen Augenblick...
ru: HERO: Дайте на секунду шаль...

source: HERO: Czy ta błyskotka może go zastąpić?
de: HERO: Kann ich Ihnen diesen Flitter dafür anbieten?
ru: HERO: Можно попросить этот фильтр?
