Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: OTHER: Najpierw opowiedz mi, jak wygląda, to czego|mam szukać, a potem spróbujemy to znaleźć.
de: OTHER: Erzähl mir erst einmal, wie das ... Objekt ... aussieht,|nach dem ich suchen soll. Und erst dann versuchen|wir es zu finden.
ru: OTHER: Расскажи мне, как выглядит.. объект... который я должен|искать.

source: OTHER: Muszę wiedzieć, czy to jaszczur, czy wąż,|czy jakaś magiczna cholera.
de: OTHER: Ich muß schon wissen, ob es eine Echse ist|oder ein Fisch oder vielleicht nur jemand|mit 'nem Haarproblem.
ru: OTHER: Я должен знать, на что это похоже. На рыбу,|на осла, на панка хайрастого...

source: HERO: Myślałem, ze pustelnicy znają się na|przyrodzie?
de: HERO: Ich dachte immer, Einsiedler seien gut mit|der Natur vertraut.
ru: HERO: Я думал, что поселенцы на дружеской ноге с|природой.

source: OTHER: Oczywiście. Ale na grzybkach, roślinkach,|korzonkach, wywarach...
de: OTHER: Ja, sicher doch. Mit Pilzen, Wurzeln, Kräutern und|Aufgüssen und so...
ru: OTHER: Да, конечно, с грибами, насекомыми, растениями и так|далее...

source: HERO: Wrócę, jak tylko dowiem się czegoś więcej.
de: HERO: Aha. Sobald ich mehr herausbekommen habe,|komme ich wieder.
ru: HERO: Ага. Я скоро приду.

source: HERO: Sklep otwarty, czyżby studia nad księgą|zostały zakończone?
de: HERO: Das Geschäft ist geöffnet? Sind die Studien|über das Buch beendet?
ru: HERO: Уже открылся магазин? А занятия по книге закончились?

source: OTHER: Ech, książę, nadal masz powietrze w głowie.
de: OTHER: Ach, Prinz, Ihr habt mit Verlaub immer|noch Stroh im Kopf.
ru: OTHER: Ах, принц, у вас все еще ветер в голове.

source: OTHER: W takim krótkim czasie można lekturę jeno|pobieżnie przekartkować.
de: OTHER: In so kurzer Zeit kann man ein solches Werk nur|oberflächlich durchblättern.
ru: OTHER: За такое короткое время такую книгу можно максимум|пролистать.

source: HERO: Znalazłeś coś ciekawego?
de: HERO: Hast du etwas Interessantes gefunden?
ru: HERO: Ты нашел что-либо интересное?

source: OTHER: Okazało się, że to nie jest księga magiczna,|ale zapiski pewnego podróżnika sprzed|wieków.
de: OTHER: Es hat sich herausgestellt, daß es kein|magisches Buch ist. Es handelt sich vielmehr|um jahrhundertealte Aufzeichnungen|eines Pilgerers.
ru: OTHER: Выяснилось, что это - не магическая книга.|Она вся состоит из историй столетней давности.

source: OTHER: Szczegółowy opis dziwnych roślin, zaginionych|zwierząt, tajemniczych miejsc.
de: OTHER: Um eine detaillierte Beschreibung von Pflanzen,|ausgestorbenen Tiere und rätselhaften Orten.
ru: OTHER: С детальными описаниями растений, животных и мест,|которых давно уже нет.

source: OTHER: Fascynująca lektura.
de: OTHER: Eine faszinierende Lektüre.
ru: OTHER: Интересный урок.

source: OTHER: Prawie że encyklopedia.
de: OTHER: Fast wie ein Lexikon.
ru: OTHER: Почти лекция.

source: HERO: Hmmm...
ru: HERO: Хммм...

source: P#HERO: Mógłbyś powiedzieć mi o niej coś więcej?
de: P#HERO: Könnt Ihr mir mehr daraus zeigen?
ru: P#HERO: Лы можешь показать мне больше?

source: HERO: Na początek choćby opis zwierząt?
de: HERO: Zum Beispiel die Tierbeschreibungen,|die würden mich interessieren.
ru: HERO: Например, описания животных, интересных|мне.

source: OTHER: A po cóż to?!
de: OTHER: Wozu braucht Ihr das?
ru: OTHER: Зачем это тебе?

source: OTHER: Czyżbyś chciał rozpocząć...
de: OTHER: Ihr beginnt doch nicht etwa mit...
ru: OTHER: Ты не собираешься заняться...

source: OTHER: ...EDUKACJĘ?!?...
de: OTHER: BILDUNG?!?
ru: OTHER: ОБРАЗОВАНИЕМ?

source: HERO: Oczywiście!
de: HERO: Aber sicher doch!
ru: HERO: Конечно!

source: HERO: Właśnie to chcę zrobić.
de: HERO: Genau das!
ru: HERO: Правильно!

source: HERO: Spoważnieć.
de: HERO: Ich will gesetzt und seriös werden.
ru: HERO: Я осяду и стану серьезным.

source: HERO: Uczyć się.
de: HERO: Mich weiterbilden.
ru: HERO: Буду образовываться.

source: HERO: Nie uganiać już więcej za dziewczętami, tylko|poświęcić sprawom poważnym i wzniosłym.
de: HERO: Nicht mehr den Mädchen nachjagen und|mich nur noch ernsthaften und gehobenen|Angelegenheiten widmen.
ru: HERO: Не буду бегать за девушками, и буду культурным.

source: HERO: Na przykład nauce.
de: HERO: Zum Beispiel der Wissenschaft.
ru: HERO: Например, пойду в науку.

source: OTHER: Jestem zdumiony i wzruszony. Skoro tak się|sprawy mają nie mogę ci odmówić.
de: OTHER: Ich bin verblüfft und ... gerührt. Wenn das|so ist, kann ich Euch nichts abschlagen.
ru: OTHER: Я тронут. Если ты говоришь правду, я не могу|возразить.

source: OTHER: Poczekaj tu chwilkę.
de: OTHER: Wartet einen Augenblick.
ru: OTHER: Подожди немного.

source: HERO: Pamiętasz łuskę, którą ci pokazałem?
de: HERO: Erinnerst du dich noch an die Schuppe,|die ich dir einmal zeigte?
ru: HERO: Помнишь, я тебе показывал чешую?

source: HERO: Wiem już, że to smocza łuska.
de: HERO: Ich weiß jetzt, daß es eine Drachenschuppe ist.
ru: HERO: Я теперь знаю, что это - чешуя дракона.

source: HERO: Mam do ciebie prośbę, jako do wizjonera.
de: HERO: Ich habe eine Bitte an dich in deiner|Eigenschaft als Seher.
ru: HERO: Я хочу тебя кое о чем попросить.

source: HERO: Potrzebuję zlokalizować pewien, hm,|obiekt...
de: HERO: Ich muß ein bestimmtes ... hm ...|Objekt finden.
ru: HERO: Мне нужно кое-что найти...

source: OTHER: Zaginione żony, dzieci, koty i psy to|moja specjalność.
de: OTHER: Verschollene Ehefrauen, Kinder, Katzen und Hunde|sind meine Spezialität.
ru: OTHER: Пропавшие жены, дети, собачки и кошки - моя специальность.

source: OTHER: Tych pierwszych czasem lepiej nie odnajdywać.
de: OTHER: Die ersteren wollen normalerweise lieber nicht|gefunden werden...
ru: OTHER: Первых, правда, обычно лучше не искать.

source: OTHER: Przez skromność nie wspomnę o...
de: OTHER: Nun ja, meine Bescheidenheit läßt mich über meine|Erfolgsquote schweigen...
ru: OTHER: Ну да, впрочем, я лучше из скромности промолчу о|своих успехах.

source: HERO: Chodzi o pewnego gada.
de: HERO: Es geht um einen bestimmten Drachen.
ru: HERO: Речь идет о конкретном драконе.

source: HERO: Oto jego łuska.
de: HERO: Und das ist seine Schuppe.
ru: HERO: А вот его чешуя.

source: HERO: Wiadomo ponad wszelką wątpliwość, że|to łuska smocza.
de: HERO: Es steht außer Zweifel,|daß dies eine Drachenschuppe ist.
ru: HERO: Правда, сомнительно еще,|что это - драконья чешуя...

source: OTHER: Smocza!
de: OTHER: Eine Drachenschuppe!
ru: OTHER: Драконья!

source: OTHER: Żarty!
de: OTHER: Du scherzt wohl!
ru: OTHER: Ты шутишь!

source: OTHER: Smoków nie ma!
de: OTHER: Drachen gibt's nicht!
ru: OTHER: Драконов не существует!

source: OTHER: Chociaż w sumie o jednym ostatnio|śniłem.
de: OTHER: Obwohl ich letztens von einem|träumte.
ru: OTHER: Хотя я и видел во сне одного.

source: OTHER: Nad ranem zamienił się co prawda|w księżniczkę Sheilę, ale to już inna|historia.
de: OTHER: Am Morgen verwandelte er sich dann|in Prinzessin Sheila, aber das ist wieder|eine andere Geschichte.
ru: OTHER: На утро он, правда, превратился в принцессу|Шейлу, но это - совсем другая история.

source: HERO: Więc skup się i powiedz mi, gdzie jest|ten potwór.
de: HERO: Dann versuche dich zu konzentrieren|und sage mir, wo dieser Drachen ist.
ru: HERO: Тогда попробуй сконцентрироваться и|скажи, где находится этот дракон.

source: HERO: To sprawa życia i śmierci.
de: HERO: Es ist eine Frage von Leben oder Tod!
ru: HERO: Это вопрос жизни и смерти!

source: HERO: Czy mógłbym spytać o coś największego|siłacza w okolicy?
de: HERO: Könnte ich wohl den stärksten Kraftprotz|weit und breit nach etwas fragen?
ru: HERO: Можно разве задавать такие вопросы?

source: HERO: W jaki sposób można pokonać smoka?
de: HERO: Wie kann man den Drachen besiegen?
ru: HERO: Как я могу победить дракона?

source: OTHER: Zapewne chcesz wiedzieć, w jaki sposób|TY mógłbyś pokonać smoka.
de: OTHER: Du möchtest wohl wissen, wie DU|den Drachen besiegen könntest?
ru: OTHER: Ты хочешь узнать, как ТЫ можешь|победить дракона?

source: OTHER: Sposób jest więcej niż prosty.
de: OTHER: Die Methode ist mehr als einfach.
ru: OTHER: Методика очень проста.

source: OTHER: Wziąć ze sobą dziesięciu krasnoludów|silnych jak ja, pokazać im legowisko|potwora i schować się, póki walka trwa.
de: OTHER: Nimm dir zehn Zwerge mit, die so stark sind wie ich,|zeig' ihnen wo der Drachen ist und versteck' dich|so lange bis der Kampf vorüber ist.
ru: OTHER: Возьми десять гномов, сильных как я, покажи им место,|где живет дракон, и спрячься на время битвы.

source: HERO: Bardzo śmieszne.
de: HERO: Überaus witzig.
ru: HERO: Смешно.

source: HERO: Nie wiedziałem, że krasnoludy mają tak|wysublimowane poczucie humoru.
de: HERO: Ich wußte nicht, daß Zwerge einen so verfeinerten|Sinn für Humor haben.
ru: HERO: Я не знал, что у гномов такой странный юмор.

source: OTHER: To nie żart.
de: OTHER: Das war kein Witz.
ru: OTHER: Это не шутка.

source: OTHER: Człowiek kontra smok. Śmiechu warte.
de: OTHER: Mensch gegen Drachen. Das ist zum Lachen!
ru: OTHER: Человек против дракона - это смешно.

source: OTHER: No chyba, żebyś był paladynem z Zakonu|Smokobójców. Wtedy was stu dałoby sobie|radę. Ale nie jesteś paladynem, prawda?
de: OTHER: Es sei denn, du bist der Paladin des Ordens|der Drachentöter. Dann kommst du mit circa|hundert Mann gegen den Drachen|zurecht. Aber du bist kein Paladin, oder?
ru: OTHER: Может, конечно, быть и так, что ты - паладин|Ордена Убийц Драконов. Тогда тебе хватит|каких-нибудь сто помощников. Но|ты ведь не паладин?

source: OTHER: I nie masz dziewięćdziesięciu dziewięciu|kumpli?
de: OTHER: Und du hast keine neunundneunzig Kameraden?
ru: OTHER: И у тебя нету 99 помощников?

source: OTHER: Potrzebowałbyś cudu, żeby pokonać|choćby krowę, a co dopiero smoka.
de: OTHER: Tja, es müßte schon ein Wunder geschehen,|wenn du nur eine Kuh besiegen wolltest.
ru: OTHER: Ха, нужно чудо, чтобы ты хотя бы корову победил!

source: OTHER: Ale nawet gdybyś był sto razy silniejszy,|to i tak twoja skóra przy smoczej to jak|papier przy kamieniu.
de: OTHER: Auch wenn du hundert Mal stärker wärest...|Deine Haut ist im Vergleich zur Drachenhaut dünn|wie Butterbrotpapier.
ru: OTHER: Даже если бы ты был во сто раз сильнее... Твои|доспехи по сравнению с его доспехами - тонкая|бумага.

source: OTHER: Nawet i miecz tu nie pomoże.
de: OTHER: Selbst ein Schwert wird hier nicht helfen können.
ru: OTHER: Одним только мечом тут не справиться.

source: HERO: Czyli najlepiej dać sobie spokój, tak?
de: HERO: Ich soll es am besten bleiben lassen, ja?
ru: HERO: Я лучше оставлю это, а?

source: OTHER: I tak doszliśmy do rozsądnych wniosków.
de: OTHER: Womit wir einen weisen Entschluß gefaßt hätten.
ru: OTHER: Вот мы и пришли к заключению.

source: OTHER: Zawsze wierzyłem, że i w takiej dziurze|znajdą się ludzie światli.
de: OTHER: Ich war immer davon überzeugt,|daß man auch in so einem Nest|kluge Menschen finden kann.
ru: OTHER: Я всегда был уверен, что даже в|такой дыре бывают умные люди.

source: OTHER: Tacy, co to wiedzą, że powinno się|zabierać biednym, a dawać bogatym.
de: OTHER: Menschen, die wissen,|daß man den Armen nehmen|und den Reichen geben sollte.
ru: OTHER: Люди, которые понимают,|что надо брать у бедных|и отдавать богатым.

source: OTHER: Cieszę się, że znasz znak, książę.
de: OTHER: Es freut mich, daß Ihr unser Zeichen kennt, Prinz.
ru: OTHER: Хорошо, что ты сам все понимаешь, принц.

source: OTHER: Przedni wybór, chyba nie ma nic bardziej|symbolicznego niż okradzenie żebraka.
de: OTHER: Ausgezeichnete Wahl, es gibt wohl nichts|Symbolischeres als das Berauben eines Bettlers.
ru: OTHER: Нет ничего более символичного, чем ограбление...

source: OTHER: Ale to jeszcze nie wystarczy, by wstąpić|do Gildii...
de: OTHER: Aber das reicht noch nicht aus, wenn Ihr der|Gilde beitreten wollt...
ru: OTHER: Но этого недостаточно, если ты хочешь вступить|в гильдию.

source: $0: Potrzebny drugi kapeć?...
de: $0: Vielleicht der zweite Hausschuh?...
ru: $0: Нужен второй тапочек?

source: $1: Gildii?
de: $1: ...der Gilde?
ru: $1: Гильдию?

source: $2: Kradniecie biednym i rozdajecie bogatym?!
de: $2: Ihr beraubt die Armen und gebt den Reichen?
ru: $2: Вы крадете у бедных и отдаете богатым?

source: $3: Chyba należy dawać biednym, a zabierać bogatym?
de: $3: Man sollte den Armen geben und den Reichen nehmen!?
ru: $3: А то, надо делать наоборот?!

source: $4: Coś naprawdę cennego? Czyli co?
de: $4: Etwas tatsächlich Wertvolles? Aber was?
ru: $4: Что-либо воистину ценное. Но что?

source: $5: Nie mam nic naprawdę wartościowego.
de: $5: Ich habe nichts wirklich Wertvolles.
ru: $5: У меня нет ничего ценного.

source: $6: Kapeć nie wystarcza?
de: $6: Der Schlappen reicht nicht aus?
ru: $6: А вот всякой мелочи недостаточно?

source: $7: Macie zniżki dla arystokratów?
de: $7: Gibt es eine Ermäßigung für Aristokraten?
ru: $7: А аристократам скидки дают?

source: OTHER: Żarcik, żarcik, żarcik...
de: OTHER: Immer ein Witzchen auf den Lippen.
ru: OTHER: Всегда готов пошутить, не так ли?

source: OTHER: Jesteś niewyczerpany, książę.
de: OTHER: Ihr seid unerschöpflich, Prinz.
ru: OTHER: Вы неподражаемы, принц.

source: OTHER: Nasze tajne Stowarzyszenie, nasza|prześwietna Gildia, to bardzo|poważna sprawa.
de: OTHER: Aber unser Geheimverein,|unsere herrliche Gilde ...|...ist eine ernsthafte Sache.
ru: OTHER: Но наше общество, наша гильдия|- очень серьезное дело.

source: OTHER: Znakiem dowiodłeś, książę, że nasze|idee nie są ci obce.
de: OTHER: Mit dem Zeichen habt Ihr bewiesen, Prinz,|daß Euch unsere Ideen nicht fremd sind.
ru: OTHER: Вы доказали, принц, что наши идеи вам не|чужды.

source: OTHER: Teraz jeszcze musisz tylko wnieść,|jak my to nazywamy, posag, aby|zostać jednym z nas.#B1
de: OTHER: Nun müßt Ihr lediglich noch eine Mitgift|einbringen, wie wir das nennen, um|einer von uns zu werden.#B1
ru: OTHER: Теперь вам осталось только одно испытание,|чтобы стать одним из нас.#B1

source: OTHER: Stowarzyszenia, Gildii, nazwa nie|jest tu ważna.
de: OTHER: des Vereins, der Gilde, der Name|ist hier unwichtig.
ru: OTHER: Род деятельности, гильдия, имя -|тут не важны.

source: OTHER: Niejawnej organizacji czuwającej nad|właściwym przepływem wartości|pieniężnych.
de: OTHER: Eine geheime Organisation, die für die richtige|Verteilung der Geldwerte zuständig ist.
ru: OTHER: Тайная организация для справедливого перераздела|ценностей.

source: OTHER: Czyli, krótko mówiąc, obławiamy się|u tych samych, u których obławia się|każde państwo świata.
de: OTHER: Kurz gesagt, wir bereichern uns auf Kosten|derjenigen, auf Kosten derer sich|jeder Staat bereichert.
ru: OTHER: Короче говоря, Мы богатеем за счет того, за|счет чего богатеет государство.

source: OTHER: U biedaków.
de: OTHER: Auf Kosten der Armen.
ru: OTHER: За счет бедных.

source: OTHER: Kiedy tylko wniesiesz do Gildii coś|wyjątkowo cennego, staniesz się|jednym z nas.
de: OTHER: Sobald Ihr etwas Wertvolles in die Gilde|mitbringt, werdet Ihr einer von uns sein.
ru: OTHER: Как только вы принесете что-либо ценное,|вы станете одним из нас.

source: OTHER: A wtedy świat stanie przed tobą|otworem.#B1
de: OTHER: Und dann wird Euch die Welt|offenstehen.#B1
ru: OTHER: И мир откроется перед вами.#B1

source: OTHER: Oczywiście. A można inaczej?
de: OTHER: Was sonst?
ru: OTHER: Что еще?

source: OTHER: Bogatych jest niewielu i pilnują swojego|majątku bardzo czujnie.
de: OTHER: Es gibt nur wenige Reiche und die bewachen|ihr Eigentum sehr scharf.
ru: OTHER: Богатых слишком мало и они слишком хорошо|охраняют свои богатства.

source: OTHER: Biedaków jest o wiele więcej i nikt się|nie przejmuje, kiedy są okradani.
de: OTHER: Arme wiederum gibt es viel mehr als Reiche und niemand|macht sich was draus, wenn sie bestohlen werden.
ru: OTHER: Бедных же намного больше и никого не волнует, если их ограбят.

source: OTHER: Czasem mamy tylko pewne konflikty|z ministrami finansów. W końcu|działamy w jednej branży.
de: OTHER: Ab und zu gibt es freilich Ärger mit dem Finanzminister.|Schließlich sind wir in derselben Branche tätig.
ru: OTHER: Мы занимаемся почти тем же, чем и министр финансов.

source: OTHER: Obrabiając biedaków hurtem, zyskujemy|na ilości.
de: OTHER: Wenn wir bei der großen Menge der Armen abschöpfen,|dann gewinnen wir an Quantität.
ru: OTHER: Если мы будем работать на массовость, то у нас улучшается|качество.

source: OTHER: Podstawy ekonomii każdego państwa,|książę.
de: OTHER: Das sind die Grundlagen der Betriebswirtschaft|jeden Landes, Prinz.
ru: OTHER: Это - основы экономики, принц.

source: OTHER: Kiedy tylko wniesiesz do Gildii coś|wyjątkowo cennego, wtedy staniesz|się jednym z nas.
de: OTHER: Sobald Ihr etwas Wertvolles in die|Gilde mitbringt, werdet Ihr einer von|uns sein.
ru: OTHER: Пока не принесете что-либо ценное,|вы не сможете стать одним из нас.

source: OTHER: He he he...
de: OTHER: Hey hey hey...
ru: OTHER: Хей -хей -хей!

source: OTHER: Oj, bo się popłaczę, książę...
de: OTHER: Ich werde gleich in Tränen ausbrechen, Prinz...
ru: OTHER: Я расплачусь, принц...

source: OTHER: Ty to jak coś powiesz...
de: OTHER: Aber wenn wir schon dabei sind.
ru: OTHER: Но раз уж мы об этом заговорили.

source: OTHER: Jaki to sens robić z bogacza biedaka?
de: OTHER: Welchen Sinn sollte das ergeben,|aus einem Reichen einen Armen zu machen?
ru: OTHER: Какой смысл делать из богатого бедного?

source: OTHER: Żeby inny biedak mógł stać się|bogaczem?
de: OTHER: Damit ein anderer Armer reich|werden kann?
ru: OTHER: Чтобы другой бедный стал богатым?

source: OTHER: Przecież to nielogiczne....
de: OTHER: Das ist doch unlogisch...
ru: OTHER: Это нелогично...

source: OTHER: Jeśli masz jakiekolwiek wątpliwości, miesiąc|członkostwa w naszym Stowarzyszeniu powinien|cię przekonać.
de: OTHER: Wenn Ihr irgendwelche Zweifel habt... ich bin|sicher, daß eine einmonatige Mitgliedschaft in|unserem Verein ausreiche wird, um Euch|zu überzeugen.
ru: OTHER: Если вы еще сомневаетесь, то, думаю, ежемесячный|взнос вас убедит.

source: OTHER: A wtedy świat stanie przed tobą otworem.#B1
de: OTHER: Und dann wird Euch die Welt offenstehen.#B1
ru: OTHER: И мир откроется перед вами.#B1

source: OTHER: Coś wyjątkowego.
de: OTHER: Etwas Außergewöhnliches.
ru: OTHER: Что-то необычное.

source: OTHER: Kiedyś otrzymaliśmy magiczną kłódkę, która nie|dość, że zabezpiecza sejf, to jeszcze sama|jest z białego złota wysadzanego brylantami.
de: OTHER: Einmal bekamen wir ein magisches Save-Schloß|aus mit Brillanten besetzem Weißgold.
ru: OTHER: Например, что-нибудь с бриллиантами.

source: OTHER: Że nie wspomnę o krysztale lokalizującym poborców|podatkowych i rzucającym na nich automatycznie|czar o wdzięcznej nazwie Hemoroidus Maximus.
de: OTHER: Ein andermal einen Kristall, der Steuerfahnder|mit dem Zauber Hämorrhoidius Maximus verhexte,|He, he.
ru: OTHER: Какой-либо кристалл, что-нибудь волшебное...

source: OTHER: Hmm...
ru: OTHER: Хм...

source: P#OTHER: Nie ukrywam, że jest taki przedmiot, którego|wszyscy pożądają.
de: P#OTHER: Offen gesagt es gibt da einen Gegenstand, den|alle begehren.
ru: P#OTHER: Есть одно общее правило.

source: OTHER: Być może o nim słyszałeś.
de: OTHER: Vielleicht habt Ihr davon gehört.
ru: OTHER: Ты, наверное, об этом слышал.

source: OTHER: To tytanowy kastet wysadzany diamentami.
de: OTHER: Es ist ein mit Diamanten besetzter|Schlagring aus Titan.
ru: OTHER: Это - кольцо из титана с бриллиантами.

source: OTHER: Problem w tym, iż należał on do słynnego|wojownika, który dawno temu poległ|w bitwie pod miastem.
de: OTHER: Er gehörte einem berühmten Kriegshelden,|der vor langer Zeit in einer Schlacht|nahe der Stadt fiel.
ru: OTHER: Оно принадлежало одному воину, давно погибнувшему|недалеко от города.

source: OTHER: Wojownika pochowano w kurhanie wraz|z całym dobytkiem.
de: OTHER: Er wurde samt seinem Vermögen in einem Grabhügel|bestattet.
ru: OTHER: Он пересытился грабежами.

source: OTHER: Nikt jednak jeszcze nie zdołał wejść do|kurhanu... A w każdym razie nie wiemy o|nikim, kto zdołał stamtąd WYJŚĆ.
de: OTHER: Niemandem ist es je gelungen, in den Grabhügel|einzudringen... oder wieder herauszukommen.
ru: OTHER: Никому еще не удавалось войти к нему в гробницу.|Или выйти оттуда.

source: OTHER: Pewnie dlatego, że kurhan strzeżony jest|dzień i noc przez upiory zabitych rycerzy.
de: OTHER: Dieser Grabhügel wird Tag und Nacht von Geistern|der getöteten Ritter bewacht.
ru: OTHER: Эта гробница охраняется духами рыцарей.

source: HERO: Mmmmm...
ru: HERO: Хм...

source: HERO: Coś mi się obiło o uszy.
de: HERO: Ich habe da vielleicht etwas aufgeschnappt.
ru: HERO: Я, кажется, что-то недопонял.

source: HERO: Zobaczę, co się da zrobić.
de: HERO: Ich will sehen, was sich machen läßt.
ru: HERO: Я посмотрю, что тут можно сделать.

source: OTHER: Wierzyć mi się nie chce.
de: OTHER: Kaum zu glauben.
ru: OTHER: Не верится.

source: OTHER: W końcu jesteś synem władcy tej|krainy.
de: OTHER: Schließlich seid Ihr der Sohn des Herrschers|dieses Landes.
ru: OTHER: В конце концов, вы - сын правителя этой страны.

source: OTHER: Choć może... Hm...
de: OTHER: Andererseits... Hm...Wenn ich Euch so anschaue...
ru: OTHER: С другой стороны, если посмотреть...

source: P#OTHER: Kiedyś otrzymaliśmy magiczną kłódkę, która nie|dość, że zabezpiecza sejf, to jeszcze sama|jest z białego złota wysadzanego brylantami.
de: P#OTHER: Einmal bekamen wir ein magisches Save-Schloß|aus mit Brillanten besetzem Weißgold.
ru: P#OTHER: Например, что-нибудь с бриллиантами.

source: OTHER: Ależ książę, przecież to|bardzo poważna sprawa.
de: OTHER: Aber Prinz, es muß schon eine wirklich|bedeutende Sache sein.
ru: OTHER: Но принц, Это должна быть значимая вещь.

source: OTHER: Ależ książę...
de: OTHER: Aber Prinz...
ru: OTHER: Но принц...

source: OTHER: ...przecież to|bardzo poważna sprawa.
de: OTHER: ...es muß schon eine wirklich bedeutende|Sache sein.
ru: OTHER: ... Это должно быть что-то ценное...

source: $0: Obiecuję, że...
de: $0: Ich verspreche, daß...
ru: $0: Я обещаю, что...

source: $1: Przysięgam na swój honor, że...
de: $1: Ich schwöre bei meiner Ehre, daß...
ru: $1: Я клянусь, что...

source: $2: Klnę się, że...
de: $2: Ich gelobe feierlich, daß...
ru: $2: Я обещаю честно...

source: $3: Słowo księcia, że...
de: $3: Prinzenehrenwort, daß...
ru: $3: Слово принца...

source: $4: ...przyjmę od ciebie świętą misję...
de: $4: ...ich deine heilige Mission fortsetze...
ru: $4: ... я продолжу твою миссию...

source: $5: ...byłem zawsze bardzo grzeczny...
de: $5: ...ich immer sehr brav war und...
ru: $5: ... я всегда был отважен...

source: $6: ...jesteś moim ideałem wojownika...
de: $6: ...du mein Ideal eines Kriegers bist
ru: $6: ... ты - мой идеал воина...

source: $7: ...mam dobre zamiary...
de: $7: ...ich gute Absichten habe...
ru: $7: ... у меня хорошие намерения.

source: $8: ...i użyję twojej broni...
de: $8: ...und daß ich deine Waffe dazu benutzen werde...
ru: $8: ... и для этого я воспользуюсь твоим оружием...

source: $9: ...i po prostu potrzebuję czegoś...
de: $9: ...und daß ich einfach etwas dazu benötige...
ru: $9: ... и мне для этого кое-что нужно...

source: $10: ...i oddam twoją broń jeszcze dziś i użyję jej...
de: $10: ...und daß ich deine Waffe nur dazu benutze...
ru: $10: ... и мне для этого нужно оружие...

source: $11: ...i twoja drogocenna broń zostanie użyta...
de: $11: ...und daß deine wertvolle Waffe dazu benutzt wird...
ru: $11: ... И для этого мне нужно твое бесценное оружие...

source: $12: ...do wkupienia się w łaski pewnych intrygantów.
de: $12: ...die Gunst bestimmter Intriganten zu gewinnen.
ru: $12: ... выиграть игру некоторых интриганов...

source: $13: ...tylko do zniszczenia zła.
de: $13: ...das Böse zu vernichten.
ru: $13: ... бороться со злом...

source: $14: ...do uwolnienia swojej duszy.
de: $14: ...meine Seele zu befreien.
ru: $14: ... освободить свою душу...

source: $15: ...tylko i wyłącznie do pokojowych celów.
de: $15: ...den Frieden im Land zu fördern.
ru: $15: ... принести мир в страну...
