Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: OTHER: Podróżując po całym świecie widzieliśmy różne|złe rzeczy, książę, ale zawsze trzymaliśmy się|od nich z daleka.
de: OTHER: Auf unseren ganzen Weltreisen stießen|wir auf viele seltsame und ungute ... Dinge|aber wir haben uns immer davon ferngehalten.
ru: OTHER: Путешествуя по миру, мы видели много|нехороших вещей, однако мы всегда держались|от них подальше.

source: OTHER: Ta kraina jest spokojna pod rządami|twego ojca.
de: OTHER: Diese Land hier ist sehr ruhig unter der|Herrschaft deines Vaters.
ru: OTHER: Эта страна пребывает в мире|под властью твоего отца.

source: OTHER: Ale nawet i tu słyszeliśmy po drodze|o starym, przeklętym zamku, w którym|od lat już nie widziano człowieka.
de: OTHER: Doch auch hier gibt es ... Unterwegs hörte|ich von einem alten Schloß, auf dem ein Fluch|liegen soll. Keine lebende Menschenseele|soll es dort geben.
ru: OTHER: Хотя даже здесь мы слышали|об одном старом проклятом замке,|куда годами не ступала нога человека.

source: OTHER: Żywego człowieka.
de: OTHER: Ich meine keine lebendigen Menschen.
ru: OTHER: Живого человека.

source: OTHER: Nic więcej nie wiem i nie chciałbym wiedzieć.#F1#B0
de: OTHER: Mehr weiß ich nicht und mehr möchte ich|auch gar nicht wissen.#F1#B0
ru: OTHER: Больше я ничего не знаю и не хочу знать.#F1#B0

source: OTHER: Wybacz mi, książę, ale twoi poddani nie|potrafią się delektować subtelnościami|prawdziwej kuchni.
de: OTHER: Vergebt mir, Prinz, aber Eure Untergebenen|sind nicht geschaffen, die Raffinessen einer|exquisiten Küche richtig zu würdigen.
ru: OTHER: Простите меня, принц, но ваши подданные|не способны насладиться тонкостями настоящей|кухни.

source: OTHER: A ta zupa bez czosnku po prostu nie|może istnieć!
de: OTHER: Und diese Suppe ist ohne Knoblauch|einfach undenkbar!
ru: OTHER: Вот этот суп просто не мыслим без чеснока!

source: HERO: Czostnek? Cóż to takiego?
de: HERO: Knodlauch? Was ist das denn?
ru: HERO: Честнок? Что такое честнок?

source: OTHER: Czosnek. Nie "czostnek", tylko czosnek.
de: OTHER: Knoblauch. Nicht "Knodlauch" ... Knoblauch!
ru: OTHER: Чеснок. Не "честнок," а "чеснок".

source: OTHER: To taka przyprawa, wygląda jak mała cebulka,|ale cebulki są już passe.
de: OTHER: Das ist so ein Gewürz, sieht aus wie ein kleines|Zwiebelchen, aber es hat sich leider ausgezwiebelt...
ru: OTHER: Это такая специя, похожа на лук, только меньше.

source: OTHER: Czosnek leczy przeziębienie i ból gardła.
de: OTHER: Dabei heilt Knoblauch Erkältungen|und Halsschmerzen.
ru: OTHER: Ещё чеснок помогает при простуде и насморке.

source: OTHER: Poza tym polecany jest kochankom, którzy chcą|zerwać z partnerem. Działa niezawodnie już po|kilku tygodniach intensywnego zażywania.
de: OTHER: Darüber hinaus wird es Liebhabern empfohlen,|die mit ihrem Partner Schluß machen möchten.|Es wirkt schon nach einigen Wochen|intensiver Einnahme.
ru: OTHER: Кроме того, он рекомендуется влюбленным,|которые хотят расстаться со своим|партнером. Работает уже после|пары недель интенсивного применения.

source: OTHER: I najważniejsze: nic nie dodaje tak aromatu|zupie czy mięsu jak szczypta czosnku.
de: OTHER: Und das Wichtigste: nichts gibt einer Suppe oder|Fleisch so ein Aroma, wie eine Prise Knoblauch.
ru: OTHER: И самое главное: ничто не улучшает|вкус супа или мяса так, как чеснок.

source: HERO: I nikt w tym... to jest, w moim|królestwie nie zna czosnku?
de: HERO: Und niemand in diesem... ich meine,|in meinem Königreich, kennt Knoblauch?
ru: HERO: И никто в этом… то есть, в моём|королевстве не знает о чесноке?

source: OTHER: Niestety, moda na tę przyprawę jeszcze|nie dotarła do ziem waszej wysokości.
de: OTHER: Leider, die Vorliebe für Knoblauch ist noch|nicht in diese Gefilde vorgedrungen.
ru: OTHER: К сожалению, мода на эту приправу|ещё не дошла до земель вашего высочества.

source: OTHER: Och, oddałbym brodę za choćby jeden ząbek!#B0
de: OTHER: Oh, ich würde meinen linken Fuß nur für|eine Zehe geben!#B0
ru: OTHER: О, да я бы бороду свою отдал|даже за один маленький зубчик!#B0

source: OTHER: Przyprawy, przepisy, a od czasu do czasu|specjalne potrawy na królewskie stoły.
de: OTHER: Gewürze, Rezepte und von Zeit zu Zeit|spezielle Gerichte für die königliche Tafel.
ru: OTHER: Приправы, рецепты и иногда специальные|блюда к королевскому столу.

source: OTHER: Ale przecież wiesz, kosztowałeś wczoraj|mojego jaszczurzego ogona w śliwkach|i pieprzu.
de: OTHER: Aber Ihr erinnert Euch doch, daß Ihr gestern|meinen Eidechsenschwanz in Pflaumen|und Pfeffer gekostet habt?
ru: OTHER: Помните, вы вчера пробовали приготовленный|мной хвост ящерицы в сливах и перце.

source: P#HERO: Er, kahem, jasne, zapomniałem.
de: P#HERO: Äh, ähem, klar, hatte ich vergessen.
ru: P#HERO: Эм, ну, я что-то подзабыл.

source: OTHER: Czyżby nie smakował?...
de: OTHER: Hat er etwa nicht geschmeckt?...
ru: OTHER: Вы разве не пробовали?

source: HERO: Nieee, skąąąd, był pyszny!
de: HERO: Neee, ach was, er war lecker!
ru: HERO: Ну что вы, было очень вкусно!

source: OTHER: To dobrze, bo jak niektórzy goście|zzielenieli, to myślałem, że i książę|będzie wybrzydzał.
de: OTHER: Ich dachte schon, Ihr wolltet auch hier rumnörgeln...|so wie einige der Gäste, denen es so schlecht wurde.
ru: OTHER: Это хорошо, а то когда некоторые гости позеленели,|я подумал, что принцу может не понравиться.

source: OTHER: Barbarzyńcy, jeść ogon jaszczurki|bez maczania go w sosie z wilczych|grzybków.#B0
de: OTHER: Diese Barbaren, wie kann man einen|Eidechsenschwanz essen, ohne ihn|vorher in Wolfspilzsauce zu dippen?#B0
ru: OTHER: Варвары, как только они могут есть|хвост ящерицы, не поливая его|соусом из волчьих грибов?#B0

source: OTHER: Kiedy tylko sobie życzysz, książę.#E3
de: OTHER: Wann immer Ihr es wünscht, Prinz.#E3
ru: OTHER: Как вам будет угодно, принц.#E3

source: HERO: Nie chcę wam psuć zabawy, ale...
de: HERO: Ich möchte euch nicht das Spiel verderben, aber...
ru: HERO: Я не хочу мешать вашей игре, но…

source: $0: Te kości to tak z nudów?
de: $0: Spielt ihr Würfel nur so zum Zeitvertreib?
ru: $0: Вы играете в кости от безделья?

source: $4: Chciałbym zagrać z wami.
de: $4: Ich würde gerne mit euch spielen.
ru: $4: Я бы хотел поиграть с вами.

source: $1: Jakie towary macie na sprzedaż?
de: $1: Welche Waren bietest du zum Verkauf an?
ru: $1: Что вы продаёте?

source: $2: Czy słyszałeś, a może widziałeś kiedyś... demony?
de: $2: Hast du jemals von Dämonen gehört?
ru: $2: Вы когда-нибудь слышали о демонах… или может даже видели их?

source: $3: Grajcie dalej.
de: $3: Spielt nur weiter.
ru: $3: Играйте дальше.

source: OTHER: Nie, z drewna.
de: OTHER: Sehen wir vielleicht so aus?
ru: OTHER: Не, кости это то ещё рукоделье.

source: P#OTHER: Och, wybacz mi książę, oderwany od gry|nie wiem czasem co plotę.
de: P#OTHER: Oh, vergebt mir Prinz, aber wenn ich|beim Spielen unterbrochen werde, dann|weiß ich manchmal nicht, was ich sage.
ru: P#OTHER: Ох, извините меня, принц, порой когда меня|отвлекают от игры я сам не знаю, что несу.

source: OTHER: Ano tak sobie turlamy, dzień jak co dzień.
de: OTHER: Na ja, so würfeln wir, Tag für Tag.
ru: OTHER: Да, так мы и играем, день за днём.

source: OTHER: Trochę treningu przed następnym|przystankiem nie zaszkodzi.#E4#B0
de: OTHER: Man muß ja im Training bleiben.|Tja, hmmm....#E4#B0
ru: OTHER: Небольшая тренировка перед|следующим перерывом не повредит.#E4#B0

source: OTHER: Szczerze mówiąc wszystkiego po ździebełku,|tyle że Vandrusowi nie chciało się jeszcze|rozpakować plecaka.
de: OTHER: Ehrlich gesagt ziemlich wenig von allem.|So wenig, daß Vandrus noch nicht mal Lust hatte,|seinen Rucksack auszupacken.
ru: OTHER: Честно говоря, Вандурс ещё даже|не распаковал свой рюкзак.

source: OTHER: "Raz zagrajmy", powiedział.
de: OTHER: " Spielen wir erst mal", sagte er.
ru: OTHER: "Сыграем разок", — сказал он.

source: OTHER: Nałóg jeden.
de: OTHER: Es ist wie eine Sucht.
ru: OTHER: Всё равно что зависимость.

source: OTHER2: Co ty bredzisz?
de: OTHER2: Was quatschst du da?
ru: OTHER2: Ты чего несёшь?

source: OTHER2: Przecież to TY chciałeś grać!
de: OTHER2: DU wolltest doch spielen!
ru: OTHER2: Это ты захотел поиграть!

source: OTHER2: "Słaby ruch dzisiaj, dawaj kości", mówiłeś.
de: OTHER2: "Schwacher Kundenverkehr heute, gib die Würfel her",|hast du gesagt.
ru: OTHER2: "Покупатели не идут, давай сюда кости", — так ты сказал.

source: OTHER2: A że mam miękkie serce, to uległem.
de: OTHER2: Und da ich ein weiches Herz habe, habe ich nachgegeben.
ru: OTHER2: А у меня мягкий характер, и я поддался.

source: OTHER: Niech mnie niedźwiedź pocałuje, co za|kłamstwo w biały dzień!
de: OTHER: Ich glaub mich knutscht ein Elch,|was für eine Lüge am hellichten Tag.
ru: OTHER: Укуси меня пчела, какая ложь средь бела дня!

source: OTHER: A kto pierwszy...
de: OTHER: Wer war das, der...
ru: OTHER: А кто первый…

source: HERO: Panowie!
de: HERO: Meine Herren!
ru: HERO: Господа!

source: HERO: Spokojnie.
de: HERO: Immer mit der Ruhe.
ru: HERO: Спокойно.

source: HERO: Sam sobie obejrzę wasze towary, nie|musicie się tak od razu fatygować.
de: HERO: Ich werde mir selbst eure Waren anschauen,|ihr müßt euch nicht sofort bemühen.
ru: HERO: Я сам осмотрю ваши товары, не беспокойтесь.

source: P#OTHER: Phrmpf.
de: P#OTHER: Grmpf.
ru: P#OTHER: Пфф.

source: OTHER: Ale milczę tylko z szacunku dla|ciebie, książę.#B0
de: OTHER: Aber ich schweige nur aus|Achtung vor Euch, Prinz#B0
ru: OTHER: Я молчу только из уважения|к вам, принц.#B0

source: OTHER: Że jak? Demona?
de: OTHER: Wie bitte? Einen Dämon?
ru: OTHER: Как? Демоны?

source: OTHER: Masz zachcianki, książę...
de: OTHER: Ihr habt Einfälle, Prinz...
ru: OTHER: Интересные у вас желания, принц…

source: OTHER: Słyszałem plotki o podzielonym na dwie|części straszliwym zamczysku, ale na|szczęście to tylko plotki.
de: OTHER: Ich habe Gerüchte über ein in zwei Hälften|geteiltes, schreckenerregendes Schloß gehört,|aber zum Glück sind das nur Gerüchte.
ru: OTHER: Ходят слухи об одном ужасном замке,|разделённом на две части, но,|к счастью, это только слухи.

source: OTHER: Ale sam wiesz, panie, jak to jest z plotkami.
de: OTHER: Aber Ihr wißt ja selbst, wie das so ist mit Gerüchten.
ru: OTHER: Только вы ведь знаете, как оно бывает со слухами.

source: OTHER: Mówią o buchających ogniem potworach, co włóczą|się nocami i napastują dzieweczki, a potem się|okazuje, że to podpici chłopi wracali z wesela.
de: OTHER: Es wird von feuerspeienden Monstern erzählt, die sich|in der Nacht herumtreiben und junge Frauen belästigen|und später stellt sich heraus, daß das betrunkene Bauern|waren, die von einer Hochzeit zurückgekehrt sind.
ru: OTHER: Сначала говорят об огнедышащих чудовищах,|пристающих к девкам по ночам, а потом|выясняется, что это были пьяные крестьяне,|шедшие домой со свадьбы.

source: OTHER: Jedyny demon jakiego widziałem na własne|oczy to demon hazardu.
de: OTHER: Den einzigen Dämon, den ich je mit meinen eigenen|Augen gesehen habe, ist der Dämon des Glücksspiels.
ru: OTHER: Единственный демон, которого я видел|своими глазами — демон азартных игр.

source: P#OTHER: Ale mnie to nie dotyczy, więc czy|mogę już wracać do gry?#F1#B0
de: P#OTHER: Zum Glück betrifft uns das nicht.|Also, können wir jetzt weitermachen und|zum Spiel zurückkehren?#F1#B0
ru: P#OTHER: Только меня это не касается. Я могу вернуться к игре?#F1#B0

source: OTHER: Twoja łaska nie zna granic, książę.#E3
de: OTHER: Eure Gnade kennt keine Grenzen, Prinz.#E3
ru: OTHER: Ваше милосердие не знает границ, принц.#E3

source: OTHER: Ależ!...
de: OTHER: Aber!...
ru: OTHER: Но!…

source: OTHER: Książę publicznie uprawiający hazard?!
de: OTHER: Ein Prinz, der öffentlich Glücksspiel betreibt?!
ru: OTHER: Принц, который у всех на глазах|играет в азартные игры?!

source: OTHER: Nie może być!
de: OTHER: Das kann nicht sein!
ru: OTHER: Не может быть!

source: HERO: Kahem, no tak.
de: HERO: Ähem, na ja.
ru: HERO: Ммм, да.

source: P#HERO: Racja.
de: HERO: Stimmt eigentlich.
ru: P#HERO: Именно.

source: P#HERO: Faktycznie.
de: HERO: In der Tat.
ru: HERO: В самом деле.

source: P#HERO: Jasne.
de: HERO: Ich meine...
ru: HERO: Конечно.

source: P#HERO: Tak tylko żartowałem.
de: HERO: Ich habe nur gescherzt.
ru: HERO: Я просто пошутил.

source: OTHER: Twoje poczucie humoru zawsze zapierało|mi dech w piersi, książę...#B0
de: OTHER: Bei Eurem Sinn für Humor stockt|mir immer der Atem in der Brust.#B0
ru: OTHER: От вашего чувства юмора у меня|всегда дыхание перехватывало, принц…#B0

source: OTHER: O w mordę...
de: OTHER: Oh, du meine Güte...nichts wie weg hier...
ru: OTHER: Ах ты ж…

source: HERO: Ummm... Ja tylko na sekundkę.
de: HERO: Ummm... Sekunde nur.
ru: HERO: Эмм… Я только на секунду.

source: $0: Kto wygrywa?
de: $0: Wer gewinnt?
ru: $0: Кто выигрывает?

source: $1: Demoniczna bródka...
de: $1: Oh, welch dämonisches Bärtlein...
ru: $1: Какая демоническая борода…

source: $2: Jaka jest najciekawsza rzecz, jaką sprzedajesz?
de: $2: Was ist die interessanteste Sache, die du verkaufst?
ru: $2: Какой из твоих товаров самый интересный?

source: $3: Porozmawiamy jeszcze później.
de: $3: Wir sprechen später noch.
ru: $3: Мы еще поговорим.

source: OTHER: Mistrz.
de: OTHER: Der Meister.
ru: OTHER: Мастер.

source: OTHER: Moje imię to Vandrus.
de: OTHER: Mein Name ist Vandrus.
ru: OTHER: Меня зовут Вандрус.

source: OTHER2: No to teraz przedstaw mistrza.
de: OTHER2: Na dann stelle ihm jetzt den Meister vor.
ru: OTHER2: Теперь представь мастера.

source: OTHER2: Bo chyba jeszcze pamiętasz,|jak mi na imię?
de: OTHER2: Du weißt doch wohl noch wie ich heiße?
ru: OTHER2: Ты ведь ещё помнишь моё имя?

source: P#OTHER: Bardzo śmieszne.
de: P#OTHER: Sehr witzig.
ru: P#OTHER: Очень остроумно.

source: OTHER: Przegrywasz prawie każdą rundkę,|i jeszcze masz ochotę na żarty.
de: OTHER: Du verlierst fast jede Runde|und hast noch Lust zu scherzen.
ru: OTHER: Почти каждый раз проигрываешь,|и всё шутки шутишь.

source: OTHER2: Liczymy tylko gry, w których nie|oszukiwałeś.
de: OTHER2: Wir zählen nur die Spiele,|in denen du nicht betrogen hast.
ru: OTHER2: Считаются только те игры,|в которых ты не жульничал.

source: OTHER: BOGOWIE!
de: OTHER: BEI DEN GÖTTERN!
ru: OTHER: О БОГИ!

source: HERO: PANOWIE!
de: HERO: MEINE HERREN!
ru: HERO: ГОСПОДА!

source: HERO: Pokłóćcie się potem, ja mam tylko|parę pytań...#B0
de: HERO: Streitet später weiter, ich habe da ein paar Fragen.#B0
ru: HERO: Ругаться будете потом, а сейчас|у меня к вам пара вопросов.#B0

source: OTHER: Raczej arystokratyczna.
de: OTHER: Eher ein aristokratisches.
ru: OTHER: Скорее аристократичная.

source: OTHER: Zło mnie nie fascynuje, mam inne|inspiracje.
de: OTHER: Das Böse hat keine Faszination für mich,|ich habe andere Inspirationen.
ru: OTHER: Меня вдохновляет не зло, а нечто другое.

source: OTHER: Małe, białe sześcianiki. To po pierwsze.|A poza tym duże białe piłeczki z brązowymi|czubeczkami. Mniam!
de: OTHER: Kleine, weiße Würfel an erster Stelle.|Und darüber hinaus große, weiße Bällchen|mit braunen Spitzen.
ru: OTHER: Маленькая белая кость на первом месте и|большая белая кружка с коричневой жидкостью...

source: OTHER: Przyznam jednak, że gdy w czasie podróży|mijaliśmy zatopiony w ciemności zamek,|to było dość interesujące.
de: OTHER: Aber, ich muß zugeben... als wir an diesem Schloß|vorbeikamen ... wißt Ihr, es ist völlig in Dunkelheit|versunken ... tja, das war schon ziemlich interessant.|das muß ich sagen.
ru: OTHER: Должен признать, однако, что когда мы|проезжали мимо того скрытого во тьме замка,|это было весьма интересно.

source: HERO: Zatopiony w ciemności?
de: HERO: In Dunkelheit versunken?
ru: HERO: Скрытого во тьме?

source: OTHER: Podobno nigdy nad nim nie świeci słońce.
de: OTHER: Angeblich scheint dort niemals die Sonne.
ru: OTHER: Вроде как над ним никогда не светит солнце.

source: OTHER: A co do bródki...
de: OTHER: Und was das Bärtchen anbelangt...
ru: OTHER: А что насчёт бороды…

source: HERO: Diabeł często ukazywany jest jako|arystokrata z kozią bródką.
de: HERO: Der Teufel wird oft als Aristokrat|mit Ziegenbärtchen dargestellt.
ru: HERO: Дьявола часто представляют аристократом|с козлиной бородой.

source: P#OTHER: Poważnie?...
de: P#OTHER: Ernsthaft?
ru: P#OTHER: Серьёзно?…

source: OTHER2: Na rany, nie gadaj tyle, tylko graj.
de: OTHER2: Meine Güte, red' nicht so viel,|spiel lieber!
ru: OTHER2: Да не болтай ты так много,|играй давай.

source: OTHER2: Starasz się wymigać?
de: OTHER2: Versuchst du dich zu drücken?
ru: OTHER2: Уклониться хочешь?

source: OTHER: Nie, ale nudzą mnie gry ze słabym|przeciwnikiem.
de: OTHER: Nein, aber mich langweilen Spiele|mit einem schwachen Gegner.
ru: OTHER: Нет, мне надоело играть со слабым|противником.

source: OTHER2: Słaba jest twoja wymówka,|starzejesz się.
de: OTHER2: Ach, du wirst alt. Das ist es.
ru: OTHER2: Слабое оправдание. Ты просто стареешь.

source: P#OTHER: Książę, przepraszam za mojego|przyjaciela. Cóż to chciałeś|zapytać?...#F1#B0
de: P#OTHER: Prinz, ich entschuldige mich|für meinen Freund. Was wolltet|Ihr fragen?#F1#B0
ru: P#OTHER: Принц, я извиняюсь за моего друга.|Что вы хотели спросить?#F1#B0

source: OTHER: Duży, gładki i gruby przedmiot z obsydianu.|Ale to tylko dla dam, książę.
de: OTHER: Ein großer, dicker Gegenstand aus Obsidian.|Aber der ist nur für Frauen, Prinz.
ru: OTHER: Большой, гладкий и толстый предмет|из обсидиана. Хотя этотолько|для женщин, принц.

source: OTHER: A tak poza tym... Trochę tego, trochę|tamtego. Rupiecie.
de: OTHER: Und ein bißchen hiervon,|ein bißchen davon. Trödel eben.
ru: OTHER: Ну а вообще… Чуть-чуть того,|чуть-чуть этого. Хлам.

source: OTHER: Pamiątki z podróży, różne dziwne|książki, z których nic nie rozumiem.
de: OTHER: Reiseandenken, verschiedene merkwürdige|Bücher, von denen ich nichts verstehe.
ru: OTHER: Сувениры для туристов,|разные странные книги, в которых|нет ничего мне понятного.

source: OTHER: Mam taką jedną, ponoć bezcenną, ale|w środku są głównie rysunki i jakieś|tajemnicze znaczki.
de: OTHER: Ein Buch ist darunter, es ist angeblich|unsagbar wertvoll, aber darin sind hauptsächlich|Zeichnungen und irgendwelche|geheimnisvollen Zeichen.
ru: OTHER: Есть одна книга, вроде как очень ценная.|Там внутри в основном картинки и|какие-то загадочные символы.

source: OTHER: No, ale to robi wrażenie na klientach.
de: OTHER: Nun, die Kunden sind immer sehr beeindruckt.
ru: OTHER: На клиентов всегда производит впечатление.

source: OTHER: Mam też parę cudownych leczniczych proszków,|starty róg feniksa, złote ozdoby|prymitywnych plemion.
de: OTHER: Ich habe auch einige wunderbare Heilpulver,|das geriebene Horn eines Phönix,|goldener Schmuck primitiver Stämme.
ru: OTHER: Еще у меня есть немного волшебных лекарств,|порошок из рога феникса,|золотые украшения дикарских племён.

source: OTHER: Jednym słowem, wszystko co może zainteresować|nowobogackich lub pretensjonalnych szlachetków|czy królewiczów.
de: OTHER: Mit einem Wort, alles was Neureiche oder|anspruchsvolle Edelmänner oder Prinzen|interessieren könnte.
ru: OTHER: Одним словом, всё, что может заинтересовать|нуворишей, чванливых дворян или|членов королевской семьи.

source: P#OTHER: Oczywiście, ty książę jesteś|wyjątkiem.
de: P#OTHER: Selbstverständlich seid Ihr, Prinz,|eine Ausnahme.
ru: P#OTHER: Конечно, исключая вас, принц.

source: P#OTHER: Kahem, to na czym stanęliśmy?#B0
de: P#OTHER: Ähem, wo waren wir stehengeblieben?#B0
ru: P#OTHER: Кхм, на чём мы остановились?#B0

source: OTHER: Fru!
de: OTHER: Hepp!
ru: OTHER: Хеп!

source: OTHER: Hopsa!
ru: OTHER: Оп-па!

source: OTHER: No!
de: OTHER: Und hepp!
ru: OTHER: Уй!

source: OTHER: Kto chce jeść, ten ma sześć!
de: OTHER: Wer mag Sex, der hat 'ne Sechs!
ru: OTHER: Кто слишком любит постель, никогда не выигрывает!

source: OTHER: Będzie wziątko, mam szóściątko!
de: OTHER: Wer es nimmt, der gewinnt!
ru: OTHER: Кто берет, тот побеждает!

source: OTHER: W porządalu, po szóstalu!
de: OTHER: Nach 'ner Sechs, bin ich|scharf wie 'ne Flex.
ru: OTHER: Шестерка делает меня острым|как бритва!

source: OTHER: Kości pieść i mam sześć!
de: OTHER: Hab ich die Würfel in der Hand,|ist 'ne Sechs schon allerhand.
ru: OTHER: Когда у меня в руке кость, шестерка|всегда рядом!

source: OTHER: Na początek, trochę szóściątek!
de: OTHER: Gar nicht schlecht für den Anfang,|geb' ich 'ner Sechs den Vorrang.
ru: OTHER: Неплохо для начала выкинуть шестерку.

source: OTHER: Przed moje oczy szóstka się toczy!
de: OTHER: Vor meinen Augen rollt 'ne Sechs,|werf' ich die Würfel ohne Gags!
ru: OTHER: Перед моими глазами крутится шестерка,|я бросаю, затаи в дыхание!

source: OTHER: Mam na dzieweczki, rzucam szósteczki!
de: OTHER: Ich hab viel Knete für die Chicks,|wenn ich heut werfe six, six, six!
ru: OTHER: У меня будет много денег на девочек,|если я выброшу шесть!

source: OTHER: Z radości płacze, znowu szóstaczek.
de: OTHER: Ein Raunen geht durch die Meute,|werf' ich 'ne Sechs freu'n sich die Leute.
ru: OTHER: Если я выброшу шесть, будет мне счастье!

source: OTHER: Się nie wstydzę, szóstkę widzę!
de: OTHER: Wozu soll ich mich schämen,|wer würde denn 'ne Sechs ablehnen?
ru: OTHER: Чего мне стыдиться, если я|выброшу шесть?

source: OTHER: Cholerny oszust!
de: OTHER: Verdammter Betrüger!
ru: OTHER: Поганый мошенник!

source: OTHER: To czysty przypadek!
de: OTHER: Das war reiner Zufall!
ru: OTHER: Это случайность!

source: OTHER: A niech to licho!
de: OTHER: Verdammt noch mal!
ru: OTHER: Еще раз проклятье!

source: OTHER: No, to jest oszustwo!
de: OTHER: Na, das ist doch Betrug!
ru: OTHER: Это обман!

source: OTHER: Przeklęty szczęściarz!
de: OTHER: Verfluchter Glückspilz!
ru: OTHER: Ты, удачливый негодяй!

source: OTHER: Klasyczny cud!
de: OTHER: Ein klassisches Wunder!
ru: OTHER: Просто чудо!

source: OTHER: Ale dam ci jeszcze szansę.
de: OTHER: Aber ich gebe dir noch eine Chance.
ru: OTHER: Я дам тебе еще один шанс.

source: OTHER: Ale zaraz sobie odbiję.
de: OTHER: Gleich hole ich mir meine Revanche.
ru: OTHER: Я хочу взять реванш.

source: OTHER: Ale i tak wygram.
de: OTHER: Ich gewinne sowieso.
ru: OTHER: Я и так выиграю.

source: HERO: Witaj, czarodzieju.
de: HERO: Seid gegrüßt, Zauberer.
ru: HERO: Пока, волшебник.

source: OTHER: O, bogowie, jaki ja jestem zapracowany,|jaki jestem zapracowany...
de: OTHER: Oh ihr Götter, habe ich viel Arbeit, so viel Arbeit...
ru: OTHER: У меня столько работы, столько работы...

source: $0: Cóż to za niezwykły sklep...
de: $0: Was ist dies für ein ungewöhnliches Geschäft?
ru: $0: Что это еще за занятие такое?

source: $4: A propos miłosnych wywarów...
de: $4: Apropos Liebestränke...
ru: $4: Апропо, любовь...

source: $1: Dlaczego nie przewracasz stron palcami?
de: $1: Warum schlagt Ihr die Seite nicht mit den Fingern um?
ru: $1: Почему ты не работаешь пальцами?

source: $2: Co to za śmieszny człowieczek w tym słoju?
de: $2: Was ist das für ein seltsames Menschlein in dem Glas?
ru: $2: Что это за человечек за стеклом?

source: $5: Ale po co dokładnie uwięziłeś homunkulusa?
de: $5: Wofür habt Ihr eigentlich den Homunkulus eingesperrt?
ru: $5: Где ты стащил гомункула?

source: $3: Rozejrzę się jeszcze, nie przeszkadzaj sobie.
de: $3: Laßt Euch nicht stören, ich will mich nur umschauen.
ru: $3: Не беспокойтесь? я только посмотрю...

source: $6: O czym ty mówisz?!
de: $6: Worüber redet Ihr?!
ru: $6: О чем вы?

source: $7: Ten wywar to dla mnie, nie lubię brzydkich kobiet.
de: $7: Ja, ein Liebestrank für mich, gegen häßliche Frauen.
ru: $7: Да, любовное зелье мне, против адских дам!

source: $8: Może jeszcze tylko jeden flakonik?...
de: $8: Bitte, nur noch ein Fläschchen.
ru: $8: Пожалуйста, еще бутылочку.

source: OTHER: Drogi książę, mówisz tak jakbyś był|tu po raz pierwszy.
de: OTHER: Werter Prinz, Ihr redet so,|als wärt Ihr zum ersten Mal hier.
ru: OTHER: Принц, вы так себя ведете, будто|первый раз тут.

source: OTHER: Nic się nie zmieniło od twojej|ostatniej wizyty.
de: OTHER: Es hat sich seit Eurer letzten|Visite nichts geändert
ru: OTHER: Ничего не изменилось со времен|вашего последнего визита.
