Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: OTHER: Czy mówię jasno, chłopcze?
de: OTHER: Habe ich mich klar ausgedrückt, Junge?
ru: OTHER: Я ясно выражаюсь?

source: OTHER: Znaczy to, iż jeżeli ktoś jest odważnym i silnym|człowiekiem, zamienić się może, powiedzmy, w mysz.
de: OTHER: Das bedeutet, daß wenn jemand ein tapferer und|starker Mensch ist, dann wird er vielleicht,|sagen wir mal ... in eine Maus verwandelt.
ru: OTHER: В смысле, если человек силен и грозен, он превратится|в мышь.

source: P#HERO: Aha.
de: P#HERO: Ach ja.
ru: P#HERO: Ах да...

source: OTHER: Chciałbyś, żebym coś zrobił z tym czarem?
de: OTHER: Willst du, daß ich etwas mit diesem Zauber mache?
ru: OTHER: Что ты хочешь сделать с этим?

source: P#HERO: Na razie nie wiem, ale jak coś wymyślę,|dam znać.
de: P#HERO: Im Moment weiß ich es noch nicht,|aber wenn mir etwas einfällt,|dann sage ich bescheid.
ru: P#HERO: Я еще не знаю. Но когда узнаю, скажу.

source: HERO: Arivaldzie, muszę się dostać do Garrahan,|ale jeżeli straże mnie zobaczą zostanę|uwięziony...
de: HERO: Arivald, ich muß nach Garrahan hineinkommen,|aber wenn die Wächter mich sehen,|werde ich gefangen genommen.
ru: HERO: Аривальд, мне надо попасть в Гаррахан, но когда|меня увидит стража, меня посадят.

source: HERO: Użyj tego czaru zamiany i wprowadź mnie|do zamku.
de: HERO: Benutze diesen Verwandlungszauber|und führe mich in das Schloß.
ru: HERO: Используй это волшебство и доставь|меня в замок.

source: HERO: Nie wiem, w co się zamienię, ale po|prostu wejdź ze mną do zamku.
de: HERO: Ich weiß nicht in was ich mich verwandle,|aber geh einfach mit mir in das Schloß hinein.
ru: HERO: Я не знаю, во что я превращусь, но просто|принеси меня в замок.

source: HERO: Oto wszystkie moje rzeczy, zostaw mi|tylko wytrychy.
de: HERO: Das hier sind alle meine Sachen.
ru: HERO: Вот все мои вещи.

source: HERO: Arivaldzie, czy wiesz co to za czar?
de: HERO: Arivald, weißt du, was das für ein Zauber ist?
ru: HERO: Аривальд, ты знаешь, что это за магия?

source: HERO: Dostałem go w prezencie.
de: HERO: Ich habe ihn geschenkt bekommen.
ru: HERO: Я получил это в подарок.

source: OTHER: Pospolity czar, ale efekty uboczne|...zastanawiające.
de: OTHER: Ach, das ist ein bekannter Zauber.|Nur, ähem, laß mich mal sehen...|mit merkwürdigen Nebenwirkungen.
ru: OTHER: Это известная вещь... Ну-ка...

source: OTHER: To czar zamiany w zwierzę.
de: OTHER: Das ist ein Zauber, der jemanden|in ein Tier verwandeln kann.|Ein gewöhnlicher Zauber.
ru: OTHER: Магия, которая превращает в животного.

source: HERO: Muszę się dostać do Garrahan, ale jeżeli|straże mnie zobaczą zostanę uwięziony.
de: HERO: Ich muß nach Garrahan hineinkommen,|aber wenn die Wächter mich sehen,|werde ich gefangen genommen.
ru: HERO: Мне надо попасть в Гаррахан. Но если|меня увидят, меня посадят.

source: HERO: Oto wszystkie moje rzeczy, zostaw|mi tylko wytrychy.
de: HERO: Das hier sind alle meine Sachen.
ru: HERO: Вот все мои вещи.

source: OTHER: Na Boga, książę! Co ty tu robisz? Twój ojciec|szaleje ze złości. Co się dzieje, mój panie?
de: OTHER: Bei Gott, Prinz! Was macht Ihr hier?|Euer Vater ist wahnsinnig vor Wut.|Was ist nur geschehen, Herr?
ru: OTHER: Принц! Что вы тут делаете? Я не верю своим глазам!|Ваш отец вне себя от ярости!

source: $0: Mam ważne sprawy do załatwienia.
de: $0: Ich habe wichtige Dinge zu erledigen.
ru: $0: У меня еще есть дела...

source: $1: Niektóre rzeczy są inne, niż się wydają...
de: $1: Manche Dinge sind anders als sie erscheinen...
ru: $1: Некоторые вещи значительно страннее, чем на первый взгляд.

source: $2: Nie jestem twoim panem!
de: $2: Ich bin nicht dein Gebieter!
ru: $2: Я не проситель!

source: $4: Uratowałem ci kiedyś życie?
de: $4: Habe ich dir das Leben gerettet?
ru: $4: Я спас тебе жизнь!

source: OTHER: Ja o tym wiem. Ale teraz...
de: OTHER: Ich weiß... Aber jetzt...
ru: OTHER: Я знаю... Но...

source: OTHER: Lepiej uciekaj, książę, na dziedzińcu|czekają na ciebie strażnicy.#B0
de: OTHER: Besser Ihr flieht, Prinz, auf dem Schloßhof|warten Wächter auf Euch.#B0
ru: OTHER: Лучше бегите, принц, во дворе вас уже поджидает|стража.#B0

source: OTHER: Wierzę w to, co ty powiesz, książę.
de: OTHER: Ich glaube Euch, Prinz.
ru: OTHER: Я верю вам, принц.

source: OTHER: Nie wiem, jakie miałeś powody, by...|nie zabić Czarnego Rycerza.
de: OTHER: Ich weiß nicht, welche Gründe Ihr hattet, den...|den Schwarzen Ritter nicht zu töten.
ru: OTHER: Я только не понимаю почему ныне убили черного рыцаря.

source: OTHER: Ale jestem ci wciąż wierny, mój panie.#B0
de: OTHER: Aber ich bin Euch immer noch|treu ergeben, mein Herr.#B0
ru: OTHER: Но я все еще ваш поданный.#B0

source: OTHER: Zawsze będziesz moim księciem. Cokolwiek|nie rozkazałby twój ojciec. Uratowałeś mi|życie, panie. Tego się nie zapomina.#E4#B0
de: OTHER: Ihr werdet immer mein Prinz sein.|Was auch immer Euer Vater befehlen würde.|Ihr habt mir mein Leben gerettet, Herr.|So etwas vergißt man nicht.#E4#B0
ru: OTHER: Вы всегда будете моим принцем. Вы|спасли мне жизнь.#E4#B0

source: OTHER: Co się z tobą stało, książę? Nie pamiętasz|jak zasłoniłeś mnie własnym ciałem, kiedy...|Ale ...dość!
de: OTHER: Was ist mit Euch passiert, Prinz?|Könnt Ihr Euch nicht mehr erinnern,|wie Ihr mich mit Eurem eigenen|Körper geschützt habt, als...|Aber...genug!
ru: OTHER: Что случилось, принц?

source: OTHER: Teraz czas, abym ja ocalił ci życie. Król,|twój ojciec, na razie skazał cię tylko na|banicję i utratę czci.
de: OTHER: Es ist an der Zeit, daß ich Euch das Leben rette.|Der König, Euer Vater, hat Euch im Moment|nur verbannt und Euch die Prinzenwürde entzogen.
ru: OTHER: Ваш отец сейчас отозвал все ваши королевские полномочия.

source: OTHER: Ale jego złość jest taka wielka, że może|skazać cię na utratę gardła. Zhańbiłeś go.
de: OTHER: Aber sein Zorn ist so groß, daß er Euch zum|Tode durch Aufschlitzen der Kehle verurteilen könnte.|Ihr habt Schande über ihn gebracht.
ru: OTHER: Но он настолько зол, что даже приговорил вас|к смерти.

source: OTHER: Musisz uciekać, panie!
de: OTHER: Ihr müßt fliehen, Prinz!
ru: OTHER: Вам надо бежать, принц!

source: HERO: Mam nadzieję, że spotkamy się jeszcze. Kiedyś|zrozumieją, że książę nie był tchórzem.
de: HERO: Wenn wir uns wiedersehen,|hoffe ich, daß alle verstehen werden,|daß der Prinz kein Feigling war.
ru: HERO: Когда снова увидимся, надеюсь,|все уже будет в порядке.

source: OTHER: Wiem, panie, że tylko ważne powody mogły cię|popchnąć do ucieczki. Ufam ci i wierzę, że|wrócisz na zamek.
de: OTHER: Ich weiß, Herr, daß nur wichtige Gründe|Euch zur Flucht bewegen konnten.|Ich vertraue Euch und bin sicher, daß Ihr|auf das Schloß zurückkehren werdet.
ru: OTHER: Я знаю, что только весомые причины могут|заставить Вас бежать. Я верю, что|вы выберетесь из замка.

source: OTHER: Ale ...dość! Musisz uciekać, panie!#X0
de: OTHER: Aber jetzt... Flieht Prinz!#X0
ru: OTHER: Бегите принц!#X0

source: OTHER: Ależ jesteś silny! Oczyściłeś taki wielki|słój jednym oddechem!
de: OTHER: Du bist aber stark! Du hast das Glas mit|nur einem Atemzug gereinigt!
ru: OTHER: А вы сильны! Одним дыханием!

source: OTHER: Ja męczyłem się przez kilka miesięcy!
de: OTHER: Ich habe mich damit mehrere Monate abgequält!
ru: OTHER: Я долго тренировался.

source: OTHER: Może i jestem tylko z mandragory, ale wiem|co to wdzięczność.
de: OTHER: Ich bin zwar nur aus der Mandragorawurzel,|aber ich weiß, was Dankbarkeit ist.
ru: OTHER: Я, конечно, всего лишь из мандрагоры, но я|знаю, что такое благодарность.

source: OTHER: Pomogę ci, kiedy tylko będziesz mnie|potrzebował. Powiedzmy ...trzy razy.
de: OTHER: Ich werde dir helfen, wann|immer du mich brauchst. |Sagen wir...drei Mal.
ru: OTHER: Я Вам помогу, когда только|потребуется. Скажем, три|раза.

source: OTHER: Daj znać, kiedy będę potrzebny.
de: OTHER: Wenn du mich wirklich brauchst.
ru: OTHER: Когда действительно потребуется.

source: HERO: To chyba dobra wiadomość.
de: HERO: Das ist, glaube ich, eine gute Nachricht.
ru: HERO: Это, кажется, справедливо.

source: OTHER: To pułapka?
de: OTHER: Ist das eine Falle?
ru: OTHER: Это подходит?

source: OTHER: Cudeńko błyszczy jak słońce, ale coś złego|z niego emanuje.
de: OTHER: Das Wunderding glänzt zwar wie die Sonne,|aber irgend etwas Böses strahlt davon aus.
ru: OTHER: Оно сияет как солнце, но тут кроется что-то|злое.

source: OTHER: Nie wezmę tego za żadne skarby.
de: OTHER: Für keinen Schatz der Welt will ich|dieses Ding haben.
ru: OTHER: Я бы ни за что не хотел его получить!

source: OTHER: Taki sam miał kiedyś nasz Król Pod Górą.|Mogłem patrzeć na niego całymi godzinami,|kiedy pilnowałem skarbca.
de: OTHER: Das gleiche Ding hatte einmal unser|König Unterberg. Ich konnte es viele Stunden|betrachten, als ich einmal auf die Schatzkammer|aufpassen sollte.
ru: OTHER: Я помню, такое же было у короля...

source: OTHER: A co to za bezwartościowy, brzydki, cuchnący|i odrażający śmieć?
de: OTHER: Was ist das für ein nichtsnutziger,|stinkender und abstoßender Müll?
ru: OTHER: Что это еще за вонючий порошок?

source: OTHER: I to ma być podarunek godny księcia? Czego|ty jesteś księciem? Śmietnika?
de: OTHER: Und das soll ein Geschenk sein,|das eines Prinzen würdig ist?
ru: OTHER: И это - подарок принца?

source: OTHER: Kto nie ryzykuje, ten ginie.
de: OTHER: Wer nicht wagt, der nicht gewinnt.
ru: OTHER: Кто не пробует, тот не выигрывает.

source: OTHER: Do dzieła!
de: OTHER: An's Werk!
ru: OTHER: За работу!

source: OTHER: Niedźwiedź...
de: OTHER: Ein Bär...
ru: OTHER: Но...

source: OTHER: Zabawne. Sądziłem, że zmienisz się w lwa.
de: OTHER: Auch nicht schlecht. Ich habe erwartet, daß du dich in|einen Löwen verwandelst.
ru: OTHER: Неплохо. Я думал, что ты превратишься во льва.

source: OTHER: Prowadzę bardzo ucieszne stworzenie|dla króla.
de: OTHER: Ich bringe hier einen Bären,|den König aufzuheitern!
ru: OTHER: У меня есть медведь для забавы|короля!

source: OTHER: Ten miś nie tylko tańczy, ale|także mruczy najlepsze dowcipy|na świecie.
de: OTHER: Das Tierchen tanzt nicht nur,|es erzählt auch die besten|Witze der Welt.
ru: OTHER: Это животное не только танцует,|но и рассказывает истории.

source: OTHER2: Hm...
ru: OTHER2: Хм...

source: OTHER2: Od kiedy pewien wędrowny magik chciał zabawić|nas czymś co nazywał "Para skunksów tańczy|kankana"...
de: OTHER2: Seitdem dieser Wanderzauberer hier war mit seiner|Belustigung, die er "Ein Skunk-Pärchen tanzt Can-Can"|genannt hat... nun seit dem...
ru: OTHER2: С тех пор, как он научился канкану...

source: OTHER2: ...nie wpuszczamy zwierząt na dziedziniec.
de: OTHER2: ...lassen wir keine Tiere mehr frei auf dem|Schloßhof herumlaufen.
ru: OTHER2: Мы больше не позволяем свободно перемещать животных|по двору.

source: OTHER: Słyszałem, że król kocha dobrą zabawę, a|ten miś ma tylko jedną wadę. Patrząc jak|tańczy można pęknąć ze śmiechu.
de: OTHER: Das verstehe ich. Aber ich hörte, daß der|König eine gute Vorführung zu schätzen weiß...|Und das einzige, was passieren könnte ist,|daß alle sich nicht mehr einkriegen vor Lachen.|Ho-ho-ho!
ru: OTHER: Да, но я слышал, что король - человек с юмором.|Ему понравится.

source: OTHER: A teraz, po tej historii z księciem...
de: OTHER: Und jetzt nach dieser Geschichte mit|dem Prinzen...
ru: OTHER: А особенно после истории с принцем.

source: OTHER2: I ja o tym myślę.
de: OTHER2: Hmm, ich denke darüber nach.
ru: OTHER2: Хм, я подумаю...

source: OTHER2: Dlatego chyba zrobię wyjątek.
de: OTHER2: OK, ich glaub' ich mach 'ne|Ausnahme.
ru: OTHER2: Ладно, я сделаю исключение.

source: OTHER2: Tylko nie bądźcie zbyt nachalni.
de: OTHER2: Nur seid bitte nicht zu aufdringlich.
ru: OTHER2: Только не будьте слишком навязчивы.

source: OTHER: Przyprowadziłem dar dla króla.
de: OTHER: Ich habe ein Geschenk für den König.
ru: OTHER: У меня подарок для короля.

source: OTHER2: Kiepski pomysł. Niedźwiedź mu syna|nie zastąpi.
de: OTHER2: Blöde Idee. Der Bär wird ihm den Sohn|nicht ersetzen.
ru: OTHER2: Классная идея. Этот медведь не заменит|ему сына.

source: OTHER: Ale na chwilę odepchnie troski.
de: OTHER: Aber für eine Weile kann er seine|Sorgen vergessen.
ru: OTHER: Но он может отвлечь его от забот.

source: OTHER: Mój podopieczny rozweselił kiedyś nawet|meble u maga Fraeda.
de: OTHER: Mein Schützling hat einmal sogar die Möbel|des Magiers Fraed zum Lachen gebracht.
ru: OTHER: Однажды он сумел рассмешить даже мебель в моем|доме.

source: OTHER: Tańczące krzesła, to niezapomniany widok,|mój dobry człowieku.
de: OTHER: Tanzende Stühle sind ein unvergeßlicher Anblick,|mein guter Mensch.
ru: OTHER: Танцующие стулья, это неподражаемо.

source: OTHER: Potem się okazało, że to byli zaczarowani|dłużnicy Fraeda. Nie na darmo nazywaliśmy|go Pomysłowym.
de: OTHER: Später hat sich herausgestellt, daß die|Stühle verzauberte Schuldner von Fraed waren.|Nicht umsonst haben wir ihn den|"Einfallsreichen" genannt. Ha-ha!
ru: OTHER: Так что кто знает...

source: OTHER: Ale to już inna historia.
de: OTHER: Aber das ist eine andere Geschichte.
ru: OTHER: Но это - отдельная история.

source: OTHER2: W porządku.
de: OTHER2: In Ordnung.
ru: OTHER2: В порядке.

source: OTHER2: Możesz zostać.
de: OTHER2: Du kannst bleiben.
ru: OTHER2: Можете остаться.

source: OTHER: Ale nie jestem tu tylko dla zabawy...
de: OTHER: Ja, ja. Aber ich bin hier nicht nur|zum Vergnügen da...
ru: OTHER: Да, да. Но я не уверен...

source: OTHER: Jakoś trzeba zarabiać na życie.
de: OTHER: Irgendwie muß man ja seinen|Lebensunterhalt verdienen.
ru: OTHER: Надо же человеку зарабатывать|на жизнь...

source: OTHER2: Widzisz ten skarbiec?
de: OTHER2: Siehst du diese Schatzkammer?
ru: OTHER2: Видите эту сокровищницу?

source: OTHER: Nasz król jest może nieszczęśliwy, ale|na pewno jest bardzo bogaty.
de: OTHER: Unser König ist vielleicht unglücklich,|aber er ist ganz bestimmt sehr reich.
ru: OTHER: Наш король, может, и несчастлив, но весьма|богат.

source: OTHER: Na razie jednak zapraszam na ucztę.
de: OTHER: Im Moment jedenfalls haben wir ein|Gelage.
ru: OTHER: Сейчас, правда, все заняты.

source: OTHER: Właśnie trwa biesiada na cześć Czarnego|Rycerza.
de: OTHER: Gerade findet der Begrüßungsschmaus|für den Schwarzen Ritter statt.
ru: OTHER: Сейчас приветствуют черного рыцаря.

source: OTHER: Wygrał co prawda walkowerem, ale|jednak.
de: OTHER: Der hat zwar nur deshalb gewonnen,|weil wir aufgegeben haben, aber was soll's.
ru: OTHER: Хотя он и победил только потому, что|мы сдались, но что поделаешь...

source: OTHER: Idź tam razem z paziem, przedstawi cię|i za kilka godzin zabawisz króla.
de: OTHER: Geh zusammen mit dem Pagen hinein,|er wird dich vorstellen und dann kannst du|den König in ein paar Stunden belustigen.
ru: OTHER: Идите туда, тебя представят и ты сможешь|повеселить короля.

source: OTHER2: Znakomicie.
de: OTHER2: Vorzüglich.
ru: OTHER2: Конечно.

source: OTHER: Tylko swojego pupilka...
de: OTHER: Nur deinen Kuschelbären...
ru: OTHER: Но вот медведь...

source: OTHER2: ...zostawiam tutaj.
de: OTHER2: ...ja, den laß ich erst mal hier.
ru: OTHER2: ..да, оставлю я его пока тут.

source: OTHER2: Oczywiście.
de: OTHER2: Selbstverständlich.
ru: OTHER2: Конечно.

source: OTHER: Mała drzemka przed pokazem|nie zaszkodzi...
de: OTHER: Ein kleines Schläfchen vor dem|Schauspiel kann nicht schaden...
ru: OTHER: Немного поспать перед представлением|не помешает.

source: OTHER: To ty, drogi kuzynku?
de: OTHER: Bist du es, werter Cousin?
ru: OTHER: Это ты, Кузин?

source: OTHER: Tata mówił, że przyjedziesz.
de: OTHER: Vater hat gesagt, daß du hierher|fahren würdest.
ru: OTHER: Отец сказал, что ты еще придешь.

source: OTHER: Wciąż taki nieśmiały?
de: OTHER: Immer noch so schüchtern?
ru: OTHER: Еще зол?

source: OTHER: Podejdź bliżej, bo mam słaby|wzrok.
de: OTHER: Komm ein bißchen näher,|ich sehe doch so schlecht.
ru: OTHER: Я не вижу, подойди поближе.

source: OTHER: Przywitaj kuzyneczkę Sheilę.
de: OTHER: Begrüße dein Cousinchen Sheila.
ru: OTHER: Приветствуй свою сестру Шейлу.

source: OTHER: Czy mi się wydaje, czy w końcu|zaczęły ci rosnąć włosy na|brodzie?
de: OTHER: Kommt es mir nur so vor, oder wachsen|dir endlich Barthaare auf dem Kinn?
ru: OTHER: Мне кажется, или у тебя усы растут?

source: $0: Dobrze, że lustra nie pękają od brzydoty.
de: $0: Gut, daß Spiegel nicht durch Häßlichkeit zerspringen.
ru: $0: Хорошо, что зеркало не разбилось.

source: $1: Czy na mycie nosa zużywasz całe mydło?
de: $1: Genügt ein Stück Seife, um deine Nase zu waschen?
ru: $1: Хватит одного куска, чтобы вырастить твой нос?

source: $2: Magiczne operacje plastyczne są ponoć tanie.
de: $2: Wie wäre es mit einer magischen Schönheitsoperation?
ru: $2: Как дела с волшебной пластической операцией?

source: $3: Koniec zabawy, ściągaj maskę.
de: $3: Spaß beiseite, nimm deine Maske ab.
ru: $3: Кстати, сними маску.

source: OTHER: I głos ci się obniżył.
de: OTHER: Und deine Stimme ist auch tiefer geworden.
ru: OTHER: И голос твой стал глубже...

source: OTHER: Och to cudownie!
de: OTHER: Oh wie wundervoll!
ru: OTHER: Как прекрасно!

source: OTHER: Robi się z ciebie prawdziwy|mężczyzna!#B0
de: OTHER: Du wirst zu einem richtigen Mann!#B0
ru: OTHER: Ты стал мужчиной!#B0

source: OTHER: Myślałam, że wzrok mam popsuty,|ale słyszę, że i z uszami nie|najlepiej.
de: OTHER: Ich weiß zwar, daß ich ein schwaches|Augenlicht habe, aber mit meinen Ohren scheint es|auch nicht zum besten bestellt zu sein...
ru: OTHER: Я знаю, что у меня слабое зрение, впрочем,|мой слух тоже уже не молод...

source: OTHER: Chyba mówisz z pełną buzią. To|bardzo nieładnie, kuzynku.#B0
de: OTHER: Oder sprichst du wohl mit vollem Mund...?|Das gehört sich aber nicht, Cousin.#B0
ru: OTHER: Или ты говоришь с набитым ртом, что не очень-то|культурно!#B0

source: OTHER: Podobają mi się te okrzyki zachwytu.
de: OTHER: Mir gefallen diese Laute der Verzückung.
ru: OTHER: Мне нравится как это звучит.

source: OTHER: Przyznasz, że z wiekiem staję się|coraz ładniejsza?...#B0
de: OTHER: Findest du nicht auch, daß ich mit|dem Alter immer schöner werde?#B0
ru: OTHER: Ты тоже считаешь, что я все хорошею?#B0

source: OTHER: Pocałowałabym cię na przywitanie, kuzynie,|ale musisz się ładnie wystroić. Lubię|zadbanych mężczyzn.
de: OTHER: Ich würde dich ja zur Begrüßung küssen, Cousin,|aber du mußt dich erst schick in Schale werfen.|Ich mag es, wenn Männer gepflegt sind.
ru: OTHER: Я бы поцеловала тебя, но ты бы сперва пошел и причесался|хотя бы.

source: OTHER: Nie lubię pedantów, ale za niechlujami|też nie przepadam.
de: OTHER: Ein Mann sollte kein Pedant sein ... aber ungepflegte|Rüpel kann ich auch nicht leiden.
ru: OTHER: Не надо быть педантом, но и неряхой тоже...

source: HERO: Grrhhl...
ru: HERO: Грхл!

source: HERO: Urgggh...
ru: HERO: Урх!

source: HERO: Harrrghl...
ru: HERO: Харгхл!

source: OTHER: Mmm...
ru: OTHER: Хм...

source: OTHER: Lubię owłosionych mężczyzn, kuzynie, bo nie|ma to jak zatopić zgrabne paluszki w gęstym|futrze.
de: OTHER: Ich mag behaarte Männer, Cousin. Es gibt|nichts Angenehmeres, als schlanke Finger|in ein dichtes Fell einzutauchen.
ru: OTHER: Мне нравятся волосатые мужчины. Нет ничего|лучше, чем запустить руки в мех...

source: OTHER: Witaj!
de: OTHER: Laß dich begrüßen!
ru: OTHER: Давай поприветствуем друг друга!

source: HERO: Grrrrlll!...
ru: HERO: Гррллл!..

source: OTHER: Jakim cudem?...
de: OTHER: Was zum Teufel?...
ru: OTHER: Какого черта?

source: OTHER: Zresztą nieważne, twoje wrzaski|na pewno przywołają strażników.
de: OTHER: Ach, ist ja auch egal. Dein Geschrei|wird gleich die Wächter auf den Plan rufen.
ru: OTHER: Впрочем, уже не важно. Твой рык наверняка|привлечет стражников.

source: OTHER: L'ours!
ru: OTHER: Лоурс...

source: OTHER: Obudził mnie jakiś ryk...
de: OTHER: Ein Brüllen hat mich geweckt...
ru: OTHER: У меня потерялась линза...

source: OTHER2: Cóż, mój przyjaciel widocznie musi|załatwić swoje przyziemne potrzeby.
de: OTHER2: Na ja, mein Freund muß wahrscheinlich|seine erdnahe Notdurft verrichten.
ru: OTHER2: Ну да, моему другу надо еще многое сделать.

source: OTHER: Przyziemne?
de: OTHER: Erdnah?
ru: OTHER: Эрдна?

source: OTHER2: Jeśli go zaraz wyprowadzę, to będą|przyziemne, a jeśli jeszcze chwilę|tu postoi, to będą przykamienne.
de: OTHER2: Wenn ich ihn sofort hinausführe, bleibt sie vielleicht|erdnah, wenn er aber noch eine Weile stehen bleibt,|landet sie sicher auf dem Steinboden.
ru: OTHER2: Если она еще сколько-то простоит, то упадет на пол.

source: OTHER2: A ostrzegam, że niedźwiedź dzisiaj|BARDZO dużo zjadł...
de: OTHER2: Im Vertrauen... der Bär hat heute|SEHR viel gegessen...
ru: OTHER2: Кстати, медведь сегодня слишком много|съел...

source: OTHER: No to sio stąd, ale szybko!
de: OTHER: Dann verschwindet, aber schnell!
ru: OTHER: Исчезни, но быстро!

source: OTHER: Na pewno oddałem ci wszystkie|rzeczy?
de: OTHER: Bist du ganz sicher, daß ich dir alle Sachen|zurückgegeben habe?
ru: OTHER: Ты уверен, что я все тебе отдал?

source: HERO: Tak, sprawdziłem dokładnie.
de: HERO: Ja, ich habe es ganz genau nachgeprüft.
ru: HERO: Да, я все проверил.

source: OTHER: Dobrze. Ale zaraz: jakim cudem w zamku|stałeś się znowu człowiekiem?
de: OTHER: OK. Aber warte mal! Wie hast du das gemacht,|daß du im Schloß wieder Menschengestalt|angenommen hast?
ru: OTHER: Ладно. Кстати, как тебе удалось в замке снова|стать человеком?

source: HERO: To bolesna historia.
de: HERO: Das ist eine unangenehme Geschichte, ähem...
ru: HERO: Это очень странная история...

source: HERO: Cieszę się, że przynajmniej ty|nie musiałeś mnie całowa...
de: HERO: Zumindest blieb mir ein Kuß von dir|erspart...
ru: HERO: По крайней мере, не пришлось тебе меня|целовать.

source: HERO: Łup, chyba się wygadałem.
de: HERO: Mist, jetzt hab' ich mich verplappert.
ru: HERO: Я счастлив.

source: OTHER: Ktoś cię całował? Wspaniale, chłopcze!
de: OTHER: Dich hat jemand geküßt? Na herrlich, mein Junge!
ru: OTHER: Тебя поцеловали?

source: OTHER: Ach tak, następny skutek uboczny.
de: OTHER: Ach ja, eine der Nebenwirkungen, hihi.
ru: OTHER: Ах да, побочные эффекты...

source: OTHER: Wystarczy pocałunek. Zapomniałem.|Muszę lecieć. Pa. Do zobaczenia.|Na razie. Trzymaj się.
de: OTHER: Ein Kuß reicht aus. Hatte ich fast vergessen.|Ich muß jetzt wieder weiter. Tschüs dann! Auf Wiederschaun!|Mach's gut!
ru: OTHER: Одного поцелуя достаточно. Почти забыл. Мне пора.|Пока! Всего!

source: OTHER: Zastanów się jeszcze.
de: OTHER: Überlege dir das noch mal.
ru: OTHER: Подумай еще раз.

source: OTHER: Ten demon nie wygląda zbyt przyjaźnie.
de: OTHER: Dieser Dämon sieht nicht besonders freundlich aus.
ru: OTHER: Этот демон не очень-то дружелюбно выглядит.

source: OTHER: Szczerze mówiąc, trochę się boję.
de: OTHER: Ehrlich gesagt, mir ist ziemlich bange.
ru: OTHER: Честно говоря, мне уже все равно.

source: HERO: Hm.
ru: HERO: Хм.

source: HERO: Znalazłem w zamku Fjord pewną księgę.
de: HERO: Ich habe in Schloß Fjord ein Buch gefunden.
ru: HERO: Я нашел в замке Фьорд одну книгу.

source: HERO: Pomyślałem, że może cię zainteresować.
de: HERO: Ich dachte, du würdest daran Interesse finden.
ru: HERO: Я думаю, тебе будет интересно.

source: OTHER: To tom poświęcony szarej magii, czyli|czarom pozornie neutralnym wobec|dobra czy zła.
de: OTHER: Dieser Band ist der Grauen Kunst gewidmet, d.h.|den Zaubereien, die gegenüber Gut und Böse|scheinbar neutral sind.
ru: OTHER: Это - том древней магии, которая, в отличие от черной|или белой, совершенно нейтральна!

source: OTHER: Bardzo ciekawe, większość zaklęć|jest mi nie znana.
de: OTHER: Ja, sehr interessant. Die meisten Zaubersprüche|sind mir unbekannt.
ru: OTHER: Очень интересно. Мне почти все незнакомо.

source: HERO: Coś ciekawego?
de: HERO: Gibt's etwas Interessantes?
ru: HERO: Что-нибудь еще?

source: OTHER: Bardzo interesujące.
de: OTHER: Sehr interessant.
ru: OTHER: Очень интересно.

source: OTHER: Większość czarów wymaga długich studiów.
de: OTHER: Die meisten Zauber bedürfen langer Studien.
ru: OTHER: Многие заклинания надо долго учить.
