Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: stragan - Niektóre warzywa i owoce znam, ale niektórych|nigdy wcześniej nie widziałem.
de: Marktstand - Viele Gemüse- und Obstsorten|kenne ich, aber einige habe ich|vorher noch nie gesehen.
ru: Прилавок - Много разных овощей и фруктов.| Но кое-что мне совсем незнакомо.

source: dziwna machina - Kołyska na kółkach - to po prostu genialne!
de: Merkwürdiges Fahrzeug - Eine Wiege auf Rädern -|einfach genial!
ru: Интересная повозка - Она на колесах! Гениально!

source: przechodzień - Co za dziwna moda...
de: Passant - Merkwürdige Mode...
ru: Прохожий - какая странная мода...

source: kapłan - Dziwne: ubrany na czarno, ale nie sprawia|wrażenia adepta czarnej magii.
de: Tempeldiener - Merkwürdig: Ganz in schwarz...|aber er macht nicht den Eindruck|eines Anhängers der schwarzen Magie.
ru: Служитель храма - Интересно: весь в черном... Но| совсем не похож на черного мага.

source: obraz - Artysta uwiecznił jakiegoś potężnego maga, który|ruchem dłoni ujarzmił morze.
de: Bild - Der Künstler hat einen mächtigen|Magier verewigt, der mit einer|Handbewegung das Meer bändigt.
ru: Картина - Художник изобразил колдуна, усмиряющего| море мановением руки.

source: drzwi - Prowadzą na zaplecze świątyni.
de: Tür - Führt zu den Hinterräumen|des Tempels.
ru: Дверь. - Ведет в подвалы замка.

source: ambona - Chwała na wysokości.
de: Hochsitz - Für wen er wohl ist?
ru: Высокое сиденье - Интересно, для кого?

source: ławy - Puste.+Niestety.
de: Bänke - Eindeutig leer.+Und unbequem.
ru: Скамья - Совсем пустая.

source: kropielnica - Wyschnięta, kamień jest tylko lekko wilgotny.
de: Becken - Ausgetrocknet, der Stein ist|nur ein wenig feucht.
ru: Очаг - Погашен. Камень еле-еле теплый.

source: wyjście - Powrót do ulicznego zgiełku.
de: Ausgang - Rückkehr ins Straßengetümmel.
ru: Выход. - Назад на улицы

source: człowiek o twarzy sadystycznego mordercy - Chyba wykonuje zawód zgodny z zainteresowaniami.
de: Ein Mensch mit dem Gesicht eines sadistischen Mörders - Wahrscheinlich verwirklicht er seine|Persönlichkeit in dem Beruf.
ru: Человек с лицом садиста - Наверное, в этой работе он реализует| себя.

source: drzwi - Jedyna droga ucieczki.
de: Tür - Sehr nützlich.
ru: Дверь. - Очень полезно.

source: certyfikat - Nie znam tutejszego języka, ale założyłbym się,|że ten dokument ma coś wspólnego z oceną|umiejętności machania toporkiem.
de: Zertifikat - Ich kenne die hiesige Sprache nicht,|aber ich würde wetten, daß dieses Dokument|eine Beurteilung über die Kunst des|Herumfuchtelns mit der Streitaxt enthält.
ru: Сертификат - Я не знаю местного языка, но мне| кажется, что это - сертификат| мучений.

source: wędliny - Mniam, mniam.
de: Würste - Mniam, mniam.
ru: Еда - Мням, мням.

source: mózg - No, to teraz już jasne, dlaczego ten|za ladą ma taki głupi wyraz twarzy.
de: Gehirn - Jetzt wird klar, warum mein|Gemütsmensch hier so einen|blöden Gesichtsausdruck hat.
ru: Блюда - Теперь ясно, почему у людей тут| такие рожи.

source: pojemnik - Zwierzęta mają bardzo bogate życie|wewnętrzne...
de: Behälter - Tiere haben ein sehr reiches|Innenleben.
ru: Клетка - У животных очень богатая внутренняя| жизнь...

source: siekiera - Gdyby nie drzwi... byłbym niższy|o głowę.
de: Axt - Wenn die Tür nicht wäre...|wäre ich um einen Kopf kürzer.
ru: Топор - Если бы не дверь, я бы стал короче| на голову.

source: strażnik - Idiotów z bejzbolami chyba nigdy nie zabraknie...
de: Wächter - Es wird nie an Idioten|mit Baseballschlägern fehlen...
ru: Стражник - Всегда найдется идиот с бейсбольной| битой...

source: wejście - Ciepło, ciepło...
de: Eingang - Warm...
ru: Вход - Тепло...

source: wyjście - Któżby chciał opuszczać piekielne otchłanie?
de: Ausgang - Wer würde wohl die Höllenabgründe|verlassen wollen?
ru: Выход. - Кто захочет отсюда уходить?

source: tabliczka - "Wstęp tylko dla diabłów i zmarłych. Obsługujemy|tylko jedną parę naraz. Przed wejściem należy|przygotować listę grzechów."
de: Schild - "Zutritt nur für Teufel und Verstorbene.|Wir bedienen nur zwei Sünder auf einmal.|Am Eingang bitte Sünden-Liste|bereithalten."
ru: Вывеска. - "Вход только для чертей и мертвых| душ. Мы обслуживаем не более| пары грешников зараз. Приготовьте| списки грехов"

source: drzwi - Solidne drewno z metalowymi okuciami.+Mucha nie siada.
de: Tür - Hartes Holz mit Metallbeschlägen.+Solide Wertarbeit.
ru: Дверь. - Твердое дерево с металлическими| полосками.

source: krata więzienna - Lepsza taka wentylacja niż żadna.
de: Gefängnisgitter - Besser so eine Belüftung als gar keine.
ru: Решетка - Лучше хоть такая вентиляция, чем| вообще никакой.

source: zamek - Widzę, że nowoczesna technika sięgnęła nawet|Piekła.
de: Schloß - Ich sehe, daß die moderne Technik|sogar die Hölle erreicht hat.
ru: Замок - Я вижу, что и в ад пришел прогресс.

source: drzwi - Nie do pokonania, chyba że ma się do dyspozycji|wściekłego słonia.*+Albo klucz.
de: Tür - Nicht zu überwinden, es sei|denn man hat einen tollwütigen|Elefanten zur Verfügung.*+Oder einen Schlüssel.
ru: Дверь. - похоже, что тут водятся бешенные| слоны!

source: czarka - Pewnie to właśnie naczynie trafia do więźniów.
de: Schüssel - Sicherlich bekommen die Gefangenen|dieses Gefäß.
ru: Замок - Конечно, на него запирают заключенных.

source: przejście - Droga w czeluście piekieł.
de: Durchgang - Weg im Höllenabgrund.
ru: Проход - Путь в адскую пропасть.

source: przejście - Prowadzi do znanych mi już obszarów piekielnych.
de: Durchgang - Er führt in mir schon bekannte|Bereiche der Hölle.
ru: Проход - Это приведет меня в уже знакомые| районы ада.

source: przejście - W inne rejony Piekła.
de: Durchgang - Zu anderen Bereichen der Hölle.
ru: Проход - В другие районы ада.

source: wnęka - Wnęka dość mroczna, ale widzę dwa pilnujące|czegoś diabły.
de: Nische - Ziemlich düstere Nische, aber ich sehe|zwei Teufel, die irgendetwas bewachen.
ru: Ниша - Глубокая ниша. Я вижу двух чертей,| которые что-то охраняют.

source: drzwi - Stare, ale jare.
de: Tür - Alt, aber oho.
ru: Дверь. - Старый, но еще о-го-го!

source: wejście - Pukajcie, a będzie wam otworzone.
de: Eingang - Klopft und es wird euch|geöffnet werden.
ru: Вход - Постучи и тебе откроют.

source: zawór - Kurek z dziwnego metalu...
de: Ventil - Hahn aus einem merkwürdigen|Metall...
ru: Вентиль - Из очень странного, надо сказать,| металла.

source: zbiornik - Tutaj lawa znajduje swoje ujście.+Ciekawe, co się z nią dalej dzieje.
de: Becken - Hier hat die Lava ihren Abfluß.+Würde mich interessieren,|was weiter mit ihr passiert.
ru: Очаг - Тут лава разливается дальше.

source: kawałek różka - Rozdzielnicowy.
de: Ein Stück vom Hörnchen - Verteiler.
ru: Кусочек рога - Делитель

source: diabeł - Rozdzielnicowy.
de: Teufel - Der Einweiser.
ru: Черт - Указатель

source: biała świeca - Mała, krótka świeca; stoi najbliżej drzwi do|sali z napisem "Grzechy lekkie".
de: Weiße Kerze - Eine kleine, kurze Kerze,|am nächsten zur Tür des Saales|mit der Inschrift "Leichte Sünden".
ru: Белая табличка - Маленькая белая табличка с надписью| "Легкие грехи".

source: czerwona świeca - Średniej wielkości świeca, stoi blisko drzwi|z napisem "Grzechy ciężkie".
de: Rote Kerze - Eine Kerze mittlerer Größe,|am nächsten zur Tür des Saales|mit der Inschrift "Schwere Sünden".
ru: Красная табличка - Табличка с надписью "Тяжелые грехи"

source: czarna świeca - Olbrzymia, gruba świeca. Jest najbliżej drzwi|z napisem "V.I.P.".
de: Schwarze Kerze - Riesige, dicke Kerze. Am nächsten|zur Tür mit der Aufschrift "V.I.P. Lounge".
ru: Черная табличка - Большая черная вывеска с надписью| "Ложа МШЗ"

source: drzwi - "Wirtualna sala grzechów lekkich."
de: Tür - "Saal der leichten Sünden"
ru: Дверь. - "Зал легких грехов"

source: drzwi - "Wirtualna sala tylko dla V.I.P.-ów."+Jest jeszcze dopisek: "Wersja beta."
de: Tür - "V.I.P. Lounge"+Da ist noch eine Kritzelei an der Wand:|"Scheiß Service hier!" Hmm...
ru: Дверь. - "МШЗ ложа"

source: drzwi - "Wirtualna sala grzechów ciężkich."
de: Tür - "Saal für schwere Sünden."
ru: Дверь. - "Зал тяжелых грехов"

source: wyjście - Zejście w głąb korytarzy Piekła.
de: Ausgang - Abstieg in die Tiefe der|höllischen Korridore.
ru: Выход. - Выход в глубину коридора

source: diabeł - Jedzonko nie posłużyło.
de: Teufel - Das Essen ist ihm wohl nicht|bekommen.
ru: Черт - Еду ему не дают.

source: różki - Śliczne!
de: Hörnchen - Wunderbar!
ru: Рожки - Отлично!

source: kociołek - Pusty, bez żadnej strawy.+Najprawdopodobniej nigdy jej tutaj nie było.
de: Kessel - Leer, keine Mahlzeit darin.+Höchstwahrscheinlich gab es|hier auch niemals eine.
ru: Котел - Пустой.

source: żar - Ognisko gorące, ale płomień wygaszony.
de: Glut - Die Glut ist noch heiß, aber|die Flammen sind erloschen.
ru: Угли - Еще горячие, хотя пламя и не горит.

source: skóra - To chyba z tego biedaka, który stracił|głowę dla ściany.
de: Fell - Das ist glaube ich das Fell|des armen Kerls, der seinen Kopf|an der Wand verloren hat.
ru: Ковер - Это случай того парня, который| потерял свою голову...

source: czaszka - Rozumiem potrzebę ozdobnika, ale dziwny mają|gust w tym Piekle...+I tak dobrze, że nie przybili tu gwoździami|czegoś żywego.
de: Totenkopf - Ich verstehe das Bedürfnis für|Verzierungen, aber die haben einen|schlechten Geschmack in dieser Hölle...+Nur gut, daß sie hier nichts|Lebendiges mit Nägeln|angeschlagen haben.
ru: Мертвая голова - Я все понимаю, но тут в аду оттого| как-то неуютно.

source: fotel - Mebel dwuosobowy, ale karę odbywa się|w samotności.+Nuda, samotność, pustka... I to tylko kara za|grzechy lekkie...
de: Sessel - Ein Möbelstück für zwei|Personen, aber die Strafe sitzt man|in Einsamkeit ab.+Langeweile, Einsamkeit, Leere...|Und das ist nur die Strafe|für leichte Sünden...
ru: Кресло - Двухместное арестантское кресло.| Если все здесь будет идти,| как шло - здесь, похоже, скоро| все сядут под большой замок.

source: węgielek - Superrozgrzany.
de: Kohlestück - Glühend.
ru: Уголек - Мерцает.

source: węgielek - Rozgrzany.
de: Kohlestück - Heiß.
ru: Уголек - Горячий.

source: fake - Nic. Tego tutaj nie ma. Zapomnij.
de: Nichts - Das ist NICHTS. Vergiß es einfach.
ru: Ничего - НИЧЕГО! Забудь.

source: udziec - Tłuściutki kawał mięcha.
de: Keule - Ein fettes Stück Fleisch.
ru: Мясо - Большой, жирный кусок.

source: łóżko - Wygląda na mięciutkie i przytulne.|W rzeczywistości jest zimne i twarde.
de: Bett - Es sieht sehr weich und kuschelig aus.|In Wirklichkeit ist es kalt und hart.
ru: Кровать - Выглядит очень мягкой и удобной.| Но на самом деле - холодная| и жесткая.

source: potrawy - Widok cudowny, rozczulający i ślinopędny, ale|nawet smoczy żołądek nie potrafi trawić|kamieni...
de: Speisen - Ein schöner Anblick, appettitlich und|den Speichelfluß anregend, aber selbst|der Magen eines Drachen kann keine|Steine verdauen.
ru: Еда - На первый взгляд аппетитно, хотя| понятно, что драконы чего| только не едят.

source: wino i słodycze - Torcik palce lizać, a wino aż błyszczy.|Doprawdy, perfidny miraż...
de: Wein und Süßigkeiten - Bei der Torte läuft einem schon das Wasser|im Munde zusammen und der Wein funkelt geradezu.|Eine ganz hinterhältige Täuschung.
ru: Вино и сладости - Аж слюнки текут при виде этого| торта. Очень привлекательно| выглядит.

source: owoce - Wyglądają bardzo smacznie, ale są|z polakierowanego drewna.+Chociaż banan mógłby się komuś przydać.
de: Früchte - Sie sehen zwar sehr lecker aus,|sind aber aus lackiertem Holz.+Allerdings könnte die Banane|jemandem nützlich sein.
ru: Фрукты - Они очень сочные. Но это - просто| крашеное дерево.

source: kukła - Model najwyraźniej symbolizujący niegrzeczne|dzieci i krasnoludy.
de: Marionette - Dieses Modell symbolisiert eindeutig|unartige Kinder..
ru: Марионетка - Эта модель символизирует судьбу| сирот.

source: wygasłe palenisko - Nic poza zwęglonym pyłem.
de: Erloschene Feuerstelle - Nichts außer verkohlter Asche.
ru: Камин - Только холодный пепел.

source: palenisko - Buzuje aż miło.
de: Feuerstelle - Es glimmt richtig angenehm.
ru: Камин - Очень приятно мерцает

source: zastygła smoła - "Model wycofany z produkcji. Napęd węglowy."
de: Getrockneter Teer - "Ein aus der Produktion genommenes|Modell. Kohleantrieb."
ru: Сухой уголь - "Модель снята с производства.| Угольный концерн"

source: smoła - Diabelskie jakuzi...
de: Teer - Ein teuflischer Whirlpool...
ru: Уголь - Дьявольский водоворот

source: wiadro - Wrrr... Jak wyobrażę to sobie w działaniu...
de: Eimer - Brr... Wenn ich mir das in seiner|Wirkungsweise vorstelle...
ru: Аймер - Бр! Как представлю его рядом...

source: probówki - Mają bardzo fantazyjne kształty, ale|nie wiem, do czego mogłyby służyć.+I nawet nie chcę wiedzieć.
de: Reagenzgläser - Sie haben sehr phantasievolle|Formen, aber ich weiß nicht wozu|sie dienen könnten.+Und ich will es auch nicht wissen.
ru: Химическая посуда - Очень фантастические формы. Яне| могу представить, для чего| такое нужно.

source: klepsydra - Odmierzała czas oprawcom.
de: Sanduhr - Sie diente den Henkern als Zeitmesser.
ru: Песочные часы - Они служат для измерения времени.

source: wyjście - Wyjście na korytarz.
de: Ausgang - Ausgang zum Korridor.
ru: Выход. - Выход в коридор

source: pomoce naukowe - Podręczny zestaw każdego szanującego się|poszukiwacza wrażeń.
de: Wissenschaftliche Hilfsmittel - Der handliche Werkzeugsatz eines jeden|ehrbaren Erforschers der Wahrheit.
ru: Научные инструменты - Очень полезные вещи для каждого,| кто гоняется за истиной.

source: madejowe łoże - Nie ma to jak wyciągnąć się na łóżku, co?
de: Streckbank - Es gibt nichts besseres, als sich mal|so richtig auszustrecken, was?
ru: Скамейка для битья - Нет ничего лучше, чем немного| себя поистязать, не так ли?

source: żelazna dziewica - Teraz już wiem, dlaczego smoków coraz mniej.
de: Eiserne Jungfrau - Jetzt weiß ich auch, warum es immer|weniger Drachen gibt.
ru: Железная статуя - Теперь я понимаю, почему драконов| становится все меньше.

source: zużyte narzędzia - Widać na nich lata intensywnej pracy.+Dla dobra ludzkości, rzecz jasna.
de: Seltsame Werkzeuge - Man sieht ihnen die jahrelange|intensive Nutzung an.+Zum Wohle der Menschheit sicherlich.
ru: Странные инструменты - Я вижу, что ими много пользовались.

source: hak - Na każdego jest jakiś hak.
de: Haken - Man kann überall einen Haken finden.
ru: Крюк - Везде тут можно найти крюки.

source: wrzątek - Trochę to dziwnie brzmi, ale wrzątek ostudził|pewnie niejednego grzesznika.
de: Heißwasser - Es mag sich seltsam anhören,|aber Heißwasser hat schon so|manchen Sünder abgekühlt.
ru: Горячая вода - Эта вода, наверное, должна охлаждать| грехи.

source: kamień - Jest przeogromny. Żaden człowiek nie jest|w stanie go poruszyć.
de: Stein - Er ist riesig. Kein Mensch ist|in der Lage, ihn zu bewegen.
ru: Камень - Он огромен. Его невозможно сдвинуть.

source: łańcuch - Grube, solidne ogniwa.
de: Kette - Dicke, solide Glieder.
ru: цепь - Толстые, солидные звенья.

source: prycza - Malutka. Widać nie przewidują gości.
de: Pritsche - Winzig. Man sieht, daß sie|hier keine Gäste erwarten.
ru: Платформа - Смешно. Сразу видно, что гостей| тут не ждали...

source: latarnia - No tak, nic dziwnego, w końcu do Piekła|światło słoneczne nie dochodzi.
de: Laterne - Na ja, kein Wunder, schließlich|erreicht kein Sonnenschein die Hölle.
ru: Факел - Ну да, конечно, света-то тут нет.

source: magiczne drzwi - Dlaczego nie ma tu Arivalda? Rozbiłby|je w puch jednym zaklęciem!
de: Magische Tür - Warum ist Arivald nicht hier?|Er würde sie durch einen Zauber|in Daunen verwandeln!
ru: Магическая дверь - Почему Аривальд не здесь? Он бы| ее развалил одним заклинанием!

source: wyjście - Powrót na główny korytarz.
de: Ausgang - Rückkehr zum Hauptkorridor.
ru: Выход. - Назад в коридор

source: diabeł - Lewy.
de: Teufel - Der Linke.
ru: Черт - Налево

source: diabeł - Prawy.
de: Teufel - Der Rechte.
ru: Черт - Направо

source: maszyna muzyczna - To chyba jakaś tajna broń Piekła w walce|z Niebem.+Może ma zakłócić brzmienie anielskich|chórów?
de: Musikmaschine - Das ist glaube ich eine Geheimwaffe|der Hölle im Kampf gegen den Himmel.+Vielleicht soll es den Gesang|der Engelschöre stören.
ru: Музыкальная машина - Это, наверное, тайное оружие ада| в борьбе с небесами.

source: wejście - Jestem u celu. Raz kozie śmierć, jak|mawiał rzeźnik.
de: Ausgang - Ich bin am Ziel. Der|Ziegenbock stirbt nur einmal, sprach|der Metzger.
ru: Выход. - Я у цели. Сапер ошибается лишь| один раз...

source: Lucyfer - Lucyfer. Wygląda może nie tak|przerażająco, ale...+Ci, którzy go zlekceważyli zostali|tu pewnie na zawsze.+Na godziny długie jak miesiące, miesiące|długie jak lata...+... i tak dalej.
de: Luzifer - Luzifer. Er sieht vielleicht nicht|so entsetzlich aus, aber...+die ihn nicht Ernst genommen|haben, sind sicherlich für immer|hier geblieben.+Für Stunden so lang wie Monate|und Monate so lang wie Jahre...+... und so weiter und so fort.
ru: Люцифер - Люцифер. А выглядит он не то чтобы| слишком грозно... Но...

source: Zapomniany cmentarz -
de: Friedhof -
ru: Кладбище -

source: Pustelnia -
de: Einsiedelei -
ru: хижина отшельника -

source: Miasto -
de: Städtchen -
ru: город -

source: Pan Słońce -
de: Sonnenfürst -
ru: солнечник -

source: Świątynia -
de: Tempel -
ru: храм -

source: Zamek Garrahan -
de: Schloß Garrahan -
ru: замок Гаррахан -

source: Zamek Fjord -
de: Schloß Fjord -
ru: замок Фьорд -

source: Silmaniona -
de: Silmanion -
ru: Силманион -

source: Kurhan -
de: Grabhügel -
ru: курган -

source: Smocza jaskinia -
de: Drachenhöhle -
ru: пещера дракона -

source: Młyn -
de: Mühle -
ru: мельница -

source: powrót -
de: rückkehr -
ru: выход -

source: Nie mogę tego użyć.
de: Das ergibt doch keinen Sinn.
ru: Это бессмысленно

source: Nie mogę tego zrobić.
de: Netter Einfall, aber leider nicht machbar.
ru: Хорошая попытка, но неудачная.

source: Nie mogę z tym rozmawiać.
de: Sieht nicht sehr gesprächig aus, oder?
ru: Выглядишь не очень разговорчивым, не так ли?

source: Nie jestem instytucją charytatywną!
de: Ich bin doch kein Wohltätigkeitsverein!
ru: Да ни за что!

source: Nie mam mu nic do powiedzenia.
de: Ich habe ihm nichts zu sagen.
ru: Мне нечего сказать.

source: Nie mam jej nic do powiedzenia.
de: Ich habe ihr nichts zu sagen.
ru: Мне нечего сказать.

source: Ho-ho!
ru: Хо-хо!

source: Hmmm... Szkoda, że czar działa tak krótko.
de: Hmmm... Schade, daß der Zauber nur so kurz dauert.
ru: Гм... Жаль, что магия действует так недолго.

source: Nic się nie dzieje...
de: Es geschieht ja gar nichts...
ru: Почти ничего не случилось...

source: Czuję się trochę nieswojo, ale skoro|Arivald pozwolił...
de: Ich fühle mich ein wenig unwohl dabei,|doch wenn Arivald es erlaubt hat...
ru: Мне это не очень нравится, но раз Аривальд|разрешил...

source: Dobrze mieć takiego przyjaciela u boku.
de: Gut, einen solchen Freund an seiner Seite zu haben.
ru: Хорошо иметь такого друга на своей стороне.

source: No, no... na szczęście to już koniec tej|bezładnej kopaniny.
de: Puh! ... Endlich ist Schluß mit dieser sinnlosen Buddelei.
ru: Пуф! Наконец-то с этим покончено.

source: Chciałem zobaczyć, co jest w pustym grobie,|a nie szukać ropy.
de: Ich wollte sehen, was in dem leeren Grab ist|und nicht nach Öl bohren.
ru: Я хотел узнать, что в той пустой могиле.

source: Lepiej nie ryzykować z takim|wojowniczym gnomem w pobliżu.
de: Bei so einem kämpferischen Gnom|gehe ich lieber kein Risiko ein.
ru: С таким боевым гномом я рисковать|не буду.

source: Hmm... Jeszcze nie działa.
de: Hmmm... Sie funktioniert noch nicht.
ru: Хм... Не работает.

source: Ale za to przy okazji mapa zaczęła działać.
de: Oh, bei dieser Gelegenheit hat die Landkarte|angefangen zu funktionieren.
ru: Ой, теперь карта заработала!

source: A niech to, ostrze gdzieś poleciało...
de: Teufel noch mal, die Klinge ist irgendwo hingeflogen...
ru: Проклятие, куда оно улетело?

source: Naostrzony jak sztylet.
de: So scharf wie ein Dolch.
ru: Остро!

source: Raz wystarczy.
de: Einmal reicht.
ru: Одного раза хватит.

source: Pierwsza część roboty za mną...
de: Den ersten Teil der Arbeit habe ich hinter mir...
ru: Первая часть работы за мной.

source: Błogosławieństwo dokonane...
de: Der Segen ist erfolgt...
ru: Выполнено.

source: Śmierdzi jak zaraza, nic dziwnego, że|wampiry też odstrasza.
de: Stinkt wie die Pest, kein Wunder,|daß das auch Vampire abschreckt.
ru: Воняет жутко, не удивительно, что|вампиры боятся.

source: Oręże gotowe!
de: Die Waffe ist fertig!
ru: Оружие готово!

source: Nie mam ich czym związać!
de: Ich habe nichts, um es zusammenzubinden!
ru: Ничего не имею для того, чтобы их соединить...

source: Muszę być szybszy.
de: Ich muß schneller sein.
ru: Нужно быть быстрее.

source: Są zajęci grą, ale nie aż tak, żeby|nie przyłapać mnie na szperaniu.
de: Sie sind mit dem Spiel beschäftigt, aber nicht so sehr,|daß sie mich nicht beim Herumstöbern erwischen könnten.
ru: Вы были очень заняты игрой, но не настолько, чтобы не прогнать|меня.

source: Plecak to przesada, ale zajęci grą na|pewno nie zauważą braku tej ślicznej|książeczki...
de: Den Rucksack zu nehmen, wäre|ein bißchen übertrieben, aber die|sind so mit dem Spiel beschäftigt,|daß sie das Fehlen dieses reizenden|Büchleins sicher nicht bemerken...
ru: Взять рюкзак было немного слишком,|но они были так заняты игрой,|что они вряд ли заметят такую|маленькую пропажу.

source: Ciekawe czy kiedykolwiek zauważą,|że to fałszywe kości.
de: Ich möchte wissen, ob ihnen jemals auffällt,|daß das gezinkte Würfel sind.
ru: Мне интересно, они догадываются, что эта кость|необычная?

source: To było żałosne...
de: Das war jämmerlich...
ru: Это было жалкое зрелище...

source: To nie jest dobry moment.
de: Das ist nicht der richtige Moment.
ru: Не совсем вовремя.

source: Zamknięte!
de: Geschlossen!
ru: Зааакрыыыто!

source: Gildia to interesujący pomysł, ale|lepiej wykorzystam kastet tylko dla|swoich własnych celów.
de: Die Gilde, hmm... eine interessante Idee,|aber ich benutze den Schlagring lieber|für meine eigenen Zwecke.
ru: Гильдия... Интересная идея... Но я лучше оставлю|это кольцо себе.

source: Translokacja!
de: Ortsveränderung!
ru: Перемена места!

source: Dość już tych manipulacji.
de: Genug mit diesen Manipulationen.
ru: Хватит этих манипуляций!

source: Zdobycie kufla kosztowało mnie zbyt|wiele wysiłku... Najpierw coś muszę|z nim zrobić.
de: Den Becher zu bekommen, hat mich|ziemlich viel Mühe gekostet...|Zuerst muß ich etwas damit machen.
ru: Мне стоило много труда достать этот|кубок... Теперь надо решить,|что с ним делать...

source: Jeszcze nie teraz...
de: Nicht jetzt.
ru: Еще нет.

source: Najpierw mam robotę do wykonania...
de: Zuerst habe ich noch eine Arbeit zu erledigen...
ru: Мне еще надо кое-что сделать...

source: Dobra dziewczynka.
de: Gutes Mädchen.
ru: Хорошая девушка.

source: Nawet nie wiem, czy to nie jakaś zjawa...|Wygląda tak dziwnie.
de: Ich weiß nicht mal, ob das nicht ein Phantom ist...|Sieht so merkwürdig aus.
ru: Я не уверен, что это не фантом.

source: Jeden z opisów pasuje jak ulał!|Łuska jest ...smocza!
de: Eine der Beschreibungen paßt wie die Faust aufs Auge!|Die Schuppe ist.. von einem Drachen!
ru: Одно из этих описаний более чем подходит!

source: Nikt nie odpowiada. Pewnie trwa rozruch|narzędzi tortur.
de: Niemand antwortet. Wahrscheinlich|werden die Marterinstrumente vorbereitet.
ru: Никто не отвечает. Наверное, готовят|инструмент.

source: Z małej chmury duży deszcz...
de: Aus einer so kleinen Wolke so viel Regen...
ru: Из такого маленького облачка и столько дождя...

source: Nie chcę na to patrzeć.
de: Ich will mir das gar nicht anschauen.
ru: Я не буду на это любоваться...

source: Może potem, jak już przetrawi...
de: Vielleicht später...
ru: Может, позже...

source: Wolny jak ptak.
de: Frei wie ein Vogel.
ru: Свободен как птица.

source: Pfuj!
de: Bäh!
ru: Бьэ!

source: Jest! Lustro jak złoto!
de: Hier ist er! Ein Spiegel, wie ich ihn haben wollte.
ru: Вот оно! Как раз такое зеркало, как я мечтал.
