Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: Może i wygląda jak wykuty z kamienia|ale mój tyłek ma inne zdanie.
de: Vielleicht sieht er ja wie aus Stein gehauen aus,|aber mein Hintern hat eine andere Aufgabe.
ru: Как будто из камня, но у этой вещи есть другая задача...

source: Hmmm... Chyba zostałem przejrzany...
de: Hmmm... Ich glaube man hat mich durchschaut...
ru: Хм... Похоже, меня видят насквозь...

source: Ta droga jest już spalona.
de: Dieser Weg ist verbaut.
ru: Эта дорога закрыта.

source: Brama też jest chroniona!...
de: Das Tor ist auch geschützt!...
ru: Дверь заперта!

source: Czuje zbliżające się załamanie nerwowe...
de: Ich fühle einen nahenden Nervenzusammenbruch...
ru: Я чувствую приближающийся нервный срыв...

source: Ha!
ru: Ха!

source: On chyba wyczuwa ruch, a nie obraz.
de: Er spürt wahrscheinlich die Bewegung,|obwohl er nichts sieht.
ru: Он так ощупывает дорогу, будто он ничего|не видит.

source: Schodzimy na dół.
de: Komm herunter.
ru: Подойди ближе.

source: Zmieniłem zdanie. Możesz zeskoczyć?
de: Ich habe meine Meinung geändert.|Kannst du herunterspringen?
ru: Я передумал. Ты можешь спрыгнуть?

source: Lepiej się z nimi nie zaznajamiać...
de: Ich ziehe es vor, sie nicht näher kennenzulernen...
ru: Я решил не знакомиться поближе...

source: Oto szkodliwe skutki nadmiernego|opalania.
de: Das sind die schädlichen Nebenwirkungen|eines übermäßigen Sonnenbades.
ru: Это все - тяжелые последствия сильного солнечного|удара.

source: Na wszystkich bogów...
de: Bei allen Göttern...
ru: Все боги...

source: Fiu-fiu.
de: Uiuiui.
ru: Яууу!

source: Pewnie śni o muzyce... Nie chcę|mu przeszkadzać.
de: Bestimmt träumt er von Musik...|Ich will ihn nicht stören.
ru: Точно. Мечтает о музыке. Я не буду|мешать.

source: Nie mam pojęcia co z tym trzeba zrobić.
de: Ich habe keine Ahnung, was man damit machen soll.
ru: Я не имею ни малейшего понятия, что с этим делать.

source: Nie rozumiem, dlaczego miałbym|chałturzyć właśnie dla niego.
de: Ich verstehe nicht, warum ich|ausgerechnet für ihn spielen soll.
ru: Я не понимаю, почему я должен|ему играть.

source: Co za potworny smród!
de: Was ist das für ein|fürchterlicher Gestank!
ru: Что за ужасная вонь!

source: Wszystko dookoła działo się tak wolno!
de: Alles um mich herum hat sich so langsam abgespielt!
ru: Все это вокруг меня так медленно движется...

source: Nie widzę zastosowania akurat tutaj.
de: Ich sehe hier gerade keine Anwendungsmöglichkeit.
ru: Я не вижу возможности применить это здесь.

source: Ufff... Brudna, mokra robota...
de: Uff... was für eine dreckige, nasse Arbeit...
ru: Уфф. Какая тяжелая и нудная работа.

source: Jest wyraźnie wzruszony, lepiej nie|będę mu przeszkadzał. I tak już chyba|najwyższy czas na samodzielność.
de: Er ist eindeutig gerührt, besser ich störe|ihn nicht. Es ist sowieso an der Zeit, daß ich|selbständig werde.
ru: Он явно тронут. Лучше ему не мешать. Я все|равно стану самостоятельным.

source: To była tylko iluzja...
de: Das war nur eine Illusion...
ru: Это была лишь иллюзия...

source: O-o!...
de: O-oh!...
ru: О-ох!

source: Wiedziałem.
de: Wußte ich's doch.
ru: Я уже это знаю.

source: Jest chyba zrośnięty z właścicielem.
de: Er ist wohl mit seinem Eigentümer zusammengewachsen.
ru: Он уже сросся со своими чертами характера.

source: Zacięła się!
de: Eingeklemmt!
ru: Угу!

source: Dziękuję.
de: Danke schön.
ru: Спасибо большое.

source: Magia mapy nie działa...
de: Die magische Landkarte funktioniert jetzt nicht...
ru: Карта все еще не работает.

source: Nigdy w życiu, nienawidzę pajęczyn, a tym|bardziej takich, które wyglądają na|magiczne.
de: Nie im Leben, ich hasse Spinnweben|und vor allem solche, die magisch aussehen.
ru: Никогда в жизни, я ненавижу прялки,|да еще и магически выглядящие.

source: Ciepło tu jakoś.
de: Es ist irgendwie warm hier.
ru: Тут как-то жарковато

source: Zły moment...
de: Schlechter Moment...
ru: Плохой момент...

source: I po co?
de: Und wozu?
ru: И зачем?

source: Rozumiem.
de: Ich verstehe.
ru: Я понимаю.

source: Eeee...
de: Eeeeh...
ru: Ээээх...

source: Nikt nie uwierzy, że jesteśmy martwi...
de: Niemand wird glauben, daß wir tot sind...
ru: Никто не поверит, что мы мертвы...

source: Brak jakiegoś znaku, specjalnego znaku|pochówku...
de: Es fehlt ein eindeutiges Zeichen...|Ein spezielles Zeichen für eine Grabstelle.
ru: Тут не хватает одного рисунка... Специального|рисунка для могилы...

source: Moje nowe ciało jest najwyraźniej za|szerokie w ramionach
de: Mein neuer Körper hat eindeutig|zu breite Schultern.
ru: У моего нового тела слишком широкие|плечи.

source: Ups.
de: Uups.
ru: Уупс.

source: Nie chce ryzykować kolejnego ataku.
de: Ich möchte keine weitere Attacke riskieren.
ru: Я не буду больше рисковать.

source: Otwór jest już wystarczająco szeroki.
de: Die Öffnung ist schon breit genug.
ru: Уже итак достаточно широко.

source: Nie widzę potrzeby.
de: Dafür sehe ich keine Notwendigkeit.
ru: Я не вижу необходимости.

source: Nie ma tam nic ciekawego.
de: Da ist nichts Interessantes.
ru: Это неинтересно.

source: Najpierw muszę wykorzystać sytuację|na swoją korzyść.
de: Erstmal muß ich die Situation zu meinem|eigenen Vorteil nutzen.
ru: Первый раз я воспользуюсь ситуацией.

source: Nie działa!
de: Es funktioniert nicht!
ru: Не работает!

source: Gdzie ja jestem?!...
de: Wo bin ich?!...
ru: Где я?!

source: Od tego rozmawiania już mnie ręce bolą.
de: Von diesem ganzen Gerede tun mir schon die Hände weh.
ru: У меня уже руки болят.

source: [To już jest w DIALOGACH]
de: ...blah blah blah...
ru: Ля ля ля ля ля ....

source: Wrrrrrrrr...
de: Grrrrrrrr...
ru: Грррр....

source: Po co od razu się denerwować?...
de: Warum denn gleich aufregen?...
ru: Зачем же сразу нервничать...

source: Nigdy. Nie znam małpiego.
de: Niemals. Ich spreche doch nicht die Affensprache.
ru: Никогда. Я не разговариваю по-обезьяньи.

source: Kobiety...
de: Frauen...
ru: Девушки...

source: Chyba czeka nas rozwiązanie siłowe.
de: Die Angelegenheit muß wohl mit Gewalt gelöst werden.
ru: Придется воспользоваться силой.

source: Macha nią jak lekką trzcinką...|Jest dla mnie zbyt szybki.
de: Er fuchtelt damit herum, als wäre es ein leichtes|Schilfrohr. Und er ist viel zu schnell für mich...
ru: Он слишком быстр для меня...

source: Grzeczny diabełek.
de: Braves Teufelchen.
ru: Смелый чертик...

source: Zawór już odkręcony.
de: Das Ventil ist schon aufgedreht.
ru: Вентиль открыт

source: Zawór już zakręcony.
de: Das Ventil ist schon zugedreht.
ru: Вентиль закрыт

source: Lepiej nie będę przytykać ręki|do strumienia lawy.
de: Ich werde den Lavastrom lieber nicht|mit der Hand berühren.
ru: Я лучше не буду трогать лаву руками...

source: Bum.
de: Bums.
ru: Бумс.

source: Lepiej nie pokazywać się im na te|ich kaprawe oczka.
de: Besser, sie entdecken mich nicht mit ihren Triefäuglein.
ru: Лучше чтобы мен не нашли...

source: Wystarczy...
de: Es reicht...
ru: Хватит...

source: Jakoś tak sama mi się ręka|poślizgnęła.
de: Irgendwie ist mir meine Hand|so von selbst ausgerutscht.
ru: Мне рука еще самому пригодится...

source: Nie przy strażniku...
de: Nicht bei Anwesenheit des Wächters...
ru: Ничто не вечно...

source: Ta świeca nie będzie odpowiednia.
de: Diese Kerze eignet sich nicht dafür.
ru: Это не подходит.

source: Życzymy przyjemnej podróży.
de: Wir wünschen eine angenehme Reise.
ru: Мы желаем приятного путешествия.

source: Nie chciałbym spotkać strażnika...|Pewnie nie darzy mnie już sympatią.
de: Ich möchte den Wächter lieber nicht treffen...|Wahrscheinlich bin ich ihm nicht mehr sympathisch.
ru: Лучше не встречаться с охранником... Я ему, кажется,|более не симпатичен...

source: Tę na razie lepiej zostawię.
de: Das lasse ich lieber erst einmal.
ru: Лучше я это оставлю...

source: Najpierw lepiej odwiedzę wszystkie sale.
de: Zuerst besuche ich lieber alle Säle.
ru: Сначала надо осмотреть все комнаты...

source: Od razu cieplej.
de: Es ist sofort wärmer.
ru: Теплее...

source: Czasami nadgorliwość może popsuć|najlepsze plany.
de: Manchmal kann Übereifer|die besten Pläne zerstören.
ru: Иногда случай может сорвать|и лучшие планы...

source: Nie teraz.
de: Jetzt nicht.
ru: Пока ничего...

source: Jaka szkoda...
de: Wie schade...
ru: Какая жалость...

source: Nie mam palców z żelaza!
de: Ich habe keine Finger aus Stahl!
ru: У меня не стальные пальцы!

source: Jeden węgielek wystarczy.
de: Ein Kohlenstück reicht aus.
ru: Вполне хватит и одного кусочка угля.

source: Hmmm... Węgielek zamienił się w pył...
de: Hmmm... Das Kohlenstück hat sich in Staub verwandelt...
ru: Уголь рассыпался в пыль.

source: Mogę to pożyczyć na chwilę?...
de: Kann ich das mal für eine Weile ausleihen?...
ru: Я могу это ненадолго позаимствовать?

source: Nie ma to jak dobrze się|przeciągnąć.
de: Es gibt nichts besseres,|als sich mal so richtig zu strecken.
ru: Иногда нет ничего лучше...

source: Chyba był zbyt słabo rozgrzany.
de: Wahrscheinlich zu schwach aufgeheizt...
ru: Слишком слабо нагрет...

source: Płomień jest zbyt wątły.
de: Die Flamme ist ziemlich schwach.
ru: Пламя слишком слабое.

source: Nareszcie!
de: Das wurde aber Zeit!
ru: Наконец-то!

source: Nie ma sensu zabarwiać tak małej|powłoczki.
de: Es hat keinen Sinn ein so|kleines Kostüm einzufärben.
ru: Нету смысла работать с таким|маленьким костюмом.

source: Teraz powłoka jest czarna jak...|Jak... Eeee... Hmmm...
de: Jetzt ist das Kostüm so schwarz wie...|wie... äh... hmmm...
ru: Теперь этот костюм такой же черный, как|и ... и...

source: Już bardziej czarna być nie może.
de: Schwärzer kann es gar nicht sein.
ru: Чернее некуда.

source: Jeden różek nikogo nie oszuka.
de: Ein Hörnchen wird niemanden täuschen können.
ru: Никому не будет недоставать маленького рожка...

source: Różki wieńczą dzieło.
de: Hörnchen krönen das Werk.
ru: Рожки это сделают...

source: Nie tutaj.
de: Nicht hier.
ru: Не тут.

source: Na ich oczach?...
de: Vor ihren Augen?...
ru: Перед вашими глазами?

source: Na pewno się uda.
de: Es klappt bestimmt.
ru: Подходит.

source: E tam, na pewno się nie uda.
de: Ach was, das klappt doch bestimmt nicht.
ru: Не подходит.

source: Proszę... Bardzo.... Gotowe...
de: Bitte sehr... fertig.
ru: Пожалуйста... готово.

source: Twarde sztuki.
de: Das sind harte Kerle.
ru: Крутые штуки.

source: Lepiej wrócę na znane mi tereny,|nie chcę pobłądzić.
de: Besser, ich kehre auf mir bekanntes Gelände zurück.|Ich will mich nicht verlaufen.
ru: Я возвращаюсь на исходные позиции.

source: Tam w oddali widać jakąś samotną|chałupkę. To pewnie jakaś pustelnia.
de: Dort hinten, in weiter Ferne, sieht man eine einsame Hütte.|Da wohnt sicher ein Einsiedler.
ru: Там, вдали виднеется одинокая хижинка.| Там живет отшельник.

source: O!... Widzę w oddali opuszczony, stary młyn.
de: Oh!... Ich sehe dort in der Ferne|eine alte Mühle.
ru: Ох! Я вижу вдали старую мельницу.

source: Naciśnij w odpowiednim momencie lewy przycisk myszy, by|zaatakować lub cofnąć dłonie.
de: Drücke im richtigen Moment die linke oder rechte Maustaste,|um anzugreifen oder die Hand zurückzuziehen.
ru: Нажмите вовремя правую или левую кнопку, чтобы схватить или|отдернуть руку.

source: Naciskaj szybko na przemian lewy i prawy przycisk myszki|lub klawisze 'Z' i 'X'.
de: Drücke schnell abwechselnd die linke und die|rechte Maustaste, oder die Tasten N und M.
ru: Быстро нажимайте правую и левую кнопки мышки попеременно,|или кнопки М и Н.
