Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: $1: Zandahaq!
ru: $1: Цандахак!

source: $8: Zandahad!
ru: $8: Цандахад!

source: $9: Zandahaz!
ru: $9: Цандахаз!

source: $10: Zandahaf!
ru: $10: Цандахаф!

source: $11: Zandaham!
ru: $11: Цандахам!

source: $2: Zandahav!
ru: $2: Цандахав!

source: $12: Zandahac!
ru: $12: Цандахац!

source: $13: Zandahaw!
ru: $13: Цандахах!

source: $14: Zandahah!
ru: $14: Цандахан!

source: $15: Zandahan!
ru: $15: Цандахау!

source: $3: A pocałuj się gdzieś.
de: $3: Ach, rutsch' mir doch den Buckel runter.
ru: $3: Ах, мне бы еще кружечку...

source: HERO: Gdzieś to już dzisiaj słyszałem...
de: HERO: Irgendwo habe ich das heute schon mal gehört...
ru: HERO: Что-то я уже сегодня слышал...

source: P#OTHER: Kim jesteś, śmiertelniku?
de: P#OTHER: Wer bist du, Sterblicher?
ru: P#OTHER: Это ты, мешающий?

source: $0: Jestem twoim wyznawcą, panie.
de: $0: Ich bin dein Anhänger, o Herr.
ru: $0: Я - приверженец, господин.

source: $1: To naprawdę b-a-r-d-z-o długa historia.
de: $1: Das ist wirklich eine s-e-h-r lange Geschichte.
ru: $1: Это очень долгая история.

source: $2: Całe szczęście, że jeszcze ...istniejesz.
de: $2: Ein Glück, das du noch...existierst.
ru: $2: Тебе еще повезло, что ты существуешь...

source: $3: Porozmawiajmy o interesach.
de: $3: Reden wir übers Geschäft.
ru: $3: Поговорим о деле.

source: OTHER: Wiem, przecież nie wzywałbyś mego imienia|nadaremno.
de: OTHER: Ich weiß, du würdest meinen Namen|doch nicht umsonst aussprechen?!
ru: OTHER: Я знал, что ты не так просто произнес|мое имя.

source: OTHER: Dlaczego od tak dawna nie widziałem moich|kapłanów?
de: OTHER: Warum habe ich schon so lange meine|Priester nicht mehr gesehen?
ru: OTHER: Почему я давно не видел своих жрецов?

source: OTHER: Dlaczego nie czuję słodkiego zapachu krwi|ofiarnych zwierząt?
de: OTHER: Warum spüre ich nicht den süßlichen|Geruch von Opfertieren?
ru: OTHER: Почему не поднимаются дымы жертвоприношений?

source: OTHER: Dlaczego nie słyszę pieśni sławiących|moje imię?
de: OTHER: Warum höre ich keine Lieder,|die meinen Namen preisen?
ru: OTHER: Почему никто не поет молитв с|моим именем?

source: P#OTHER: Dlaczego tu tak pusto?
de: P#OTHER: Warum ist es hier überhaupt so leer?
ru: P#OTHER: Почему тут так пусто?

source: HERO: Ludzie odwracają się od starych bogów,|eeee... panie....
de: HERO: Die Leute wenden sich von den|alten Göttern ab, Herr....
ru: HERO: Люди отказались от прежних богов,|господин...

source: HERO: Wszyscy gonią za zyskiem, uciechami|codziennego dnia. Religia przestaje|ich interesować.
de: HERO: Alle eilen dem Gewinn und den|Freuden des Alltags hinterher.|Die Religion hat aufgehört, sie zu interessieren.
ru: HERO: Религия перестала интересоваться|вами...

source: HERO: Ludzie zrobili się wygodni...
de: HERO: Die Leute sind bequem geworden...
ru: HERO: Люди привыкли...

source: HERO: Po co iść do odległej świątyni, kiedy|w tym samym czasie można zabawić się|kielichami w gronie przyjaciół?#B0
de: HERO: Wozu zu einem entlegenen Tempel gehen,|wenn man sich stattdessen in netter Runde|an Bierkrügen laben kann.#B0
ru: HERO: Зачем идти в храм, когда можно пропустить|по кружечке?#B0

source: OTHER: Nie szkodzi, teraz, kiedy okazało się, że|moi wyznawcy jeszcze żyją, mam dużo czasu.
de: OTHER: Das macht nichts, jetzt, wo es sich herausgestellt hat,|daß meine Anhänger noch leben, habe ich viel Zeit.
ru: OTHER: Это неважно, пока живы мои верующие, у меня есть время.

source: HERO: Nie wątpię, eeee... panie.... Ale ja|nie jestem wieczny, a ta historia...
de: HERO: Ganz ohne Zweifel, Herr...|Aber ich lebe nicht ewig und ...|und diese ganze Geschichte ist...
ru: HERO: Без обид, господин, но это|все не так просто... Вся эта история...

source: HERO: Cóż, trwa właściwie całe moje życie.
de: HERO: ...naja, sie dauert ziemlich lang.
ru: HERO: Да, она долго длиться....

source: HERO: Następnym razem, obiecuję.#B0
de: HERO: Beim nächsten Mal erzähl ich mehr davon,|versprochen.#B0
ru: HERO: В следующий раз я больше расскажу.#B0

source: P#OTHER: Więc wiesz, jaki los mnie czekał...
de: P#OTHER: Also weißt du, welches Schicksal mich ereilt hat...
ru: P#OTHER: Если бы ты знал мою судьбу!

source: P#HERO: Wiem. Dowiedziałem się od pewnego|wędrownego mnicha.
de: P#HERO: Ich weiß es. Ich habe es von einem|Wandermönch erfahren.
ru: P#HERO: Я знаю. Мне рассказал один путешественник.

source: P#OTHER: Mogę robić, co tylko chcę.
de: P#OTHER: Ich kann tun, was immer ich will.
ru: P#OTHER: Я могу делать все, что захочу.

source: OTHER: Jestem potężniejszy od królów, magów i kapłanów.|Jednym ruchem dłoni ujarzmiałem smoki, a gniewnym|zmarszczeniem brwi rozpędzałem armie.
de: OTHER: Ich bin mächtiger als Könige, Magiere und Priester.|Mit einer Handbewegung habe ich Drachen|vernichtet und mit einem wütenden Augenaufschlag|Armeen auseinander getrieben.
ru: OTHER: Я более могуч, чем короли, маги и священники! Я могу|мановением руки уничтожать драконов и|вызывать армии.

source: OTHER: Potrafię zmienić gwiazdę w łabędzia,|a złoto w ogień.
de: OTHER: Ich bin fähig einen Stern in einen Schwan|zu verwandeln und Gold in Feuer.
ru: OTHER: Я могу утопить звезду в море и превратить|огонь в золото.

source: OTHER: Ale moje istnienie zależy od was.
de: OTHER: Aber meine Existenz ist von euch abhängig.
ru: OTHER: Но мое существование зависит от тебя.

source: OTHER: Od najbardziej kruchej i niepewnej rzeczy na|świecie - ludzkiego życia.
de: OTHER: Von der zerbrechlichsten und unsichersten|Sache der Welt - dem menschlichen Leben.
ru: OTHER: От самой ненадежной вещи в мире - от жизни|человечишки!

source: P#OTHER: Tak to już bywa: coś za coś.#B0
de: P#OTHER: So sieht es aus. Nichts ist umsonst.#B0
ru: P#OTHER: Вот так вот. Это не зря.#B0

source: OTHER: Jak to o interesach?!
de: OTHER: Was für ein Geschäft?!
ru: OTHER: Какие дела?

source: HERO: Po kolei.
de: HERO: Der Reihe nach.
ru: HERO: По очереди.

source: HERO: Szczerze mówiąc nie jestem twoim|wyznawcą.
de: HERO: Ehrlich gesagt, ich bin keineswegs dein Anhänger.
ru: HERO: Честно говоря, я не твой верующий.

source: HERO: Ale jako bóstwo powinieneś mieć|ogromną moc.
de: HERO: Aber als Gottheit müßtest du|eine ungeheure Macht haben.
ru: HERO: Но как божество ты должен обладать|немереной силой.

source: HERO: Ufam, iż wiesz, jak zniszczyć klątwę.
de: HERO: Ich vertraue darauf, daß du weißt,|wie man einen Fluch rückgängig macht.
ru: HERO: Я подозреваю, что ты знаешь, как отменить|действие проклятия.

source: HERO: Mam tutaj cztery przedmioty, które przeklął|pewien gorącogłowy grabarz.
de: HERO: Ich habe hier vier Gegenstände,|die ein gewisser hitzköpfiger|Totengräber verflucht hat.
ru: HERO: У меня есть четыре вещи, которые|были прокляты одним мародером.

source: HERO: Jednym z przedmiotów jest eliksir|nieśmiertelności.
de: HERO: Einer dieser Gegenstände ist|ein Unsterblichkeitselixir.
ru: HERO: Одна из них - эликсир бессмертия.

source: HERO: Proponuję umowę: dam ci eliksir, a ty w zamian|za to zniweczysz działanie uroku.
de: HERO: Ich schlage dir einen Handel vor:|ich gebe dir das Elixier und du machst im Tausch|dafür die Wirkung des Fluches rückgängig.
ru: HERO: У меня предложение - я тебе даю эликсир,|а ты в ответ отменяешь действие проклятия.

source: HERO: Dzięki temu będziesz wieczny, i przestaniesz|być zależny od wiernych.
de: HERO: Durch das Elixier wirst du ewig sein und|unabhängig von Anhängern...
ru: HERO: С помощью эликсира ты станешь бессмертен|и независим от верующих.

source: HERO: Których zresztą, a przykro mi to mówić, nie ma.
de: HERO: ...die es, so leid es mir auch tut das sagen zu|müssen, ähem, nicht mehr gibt.
ru: HERO: ...которых, извини за грубость, больше и нету...

source: P#HERO: To jak? Mam nadzieję, że się dogadamy?
de: P#HERO: Na, wie sieht es aus?|Bist du einverstanden?
ru: P#HERO: Ту как тебе предложение?

source: P#P#OTHER: Ty... Ty... Ty...
de: P#P#OTHER: Du... Du... Du...
ru: P#P#OTHER: Ты.. Ты... Ты!

source: OTHER: Ty żałosny, słaby człowieczku!
de: OTHER: Du bedauernswertes, elendes Menschlein!
ru: OTHER: Ты, недостойный доверия человечишко!

source: OTHER: Ośmielasz się ze mną ...TARGOWAĆ?!
de: OTHER: Du wagst es mit mir zu...FEILSCHEN?!
ru: OTHER: Ты со мной ТОРГУЕШЬСЯ?

source: OTHER: A może twój nędzny rozum podpowiedział ci,|iż boga można SZANTAŻOWAĆ?
de: OTHER: Vielleicht hat dir dein nichtsnütziger Verstand gesagt,|daß man einen Gott ERPRESSEN kann?
ru: OTHER: Тебе что, никогда не говорили, что богов не шантажируют?!

source: OTHER: Zaraz przekonasz się, na czym polega|gniew boski!
de: OTHER: Gleich wirst du dich davon überzeugen können,|was göttlicher Zorn ist
ru: OTHER: Сейчас ты узнаешь, что такое гнев бога!

source: OTHER: PRZYGOTUJ SIĘ!!!
de: OTHER: BEREITE DICH DARAUF VOR!!!
ru: OTHER: ПРИГОТОВЬСЯ!

source: P#P#P#P#P#OTHER: Kurka, coś słaby dzisiaj jestem.
de: P#P#P#P#P#OTHER: Mist, irgendwie bin ich heute geschwächt,
ru: P#P#P#P#P#OTHER: Блин, что-то я сегодня ослаб...

source: OTHER: W porządku, umowa stoi.#X1
de: OTHER: In Ordnung, die Abmachung steht.#X1
ru: OTHER: Ладно, я согласен на такой обмен.#X1

source: HERO: Arivaldzie, ponoć w pobliżu jest jakiś|demoniczny zamek.
de: HERO: Arivald, angeblich gibt es hier|in der Nähe ein verwunschenes Schloß.
ru: HERO: Аривальд, тут поблизости есть один|замок.

source: HERO: Może tam znajdę jakiegoś osobnika z piekła|rodem, który pomoże mi dorwać tego przeklętego|demona, co wpędził mnie w takie kłopoty.
de: HERO: Vielleicht finde ich dort irgendein Wesen,|das der Hölle entstammt und mir dabei hilft,|diesen verfluchten Dämon zu erwischen,|der mich in all diese Schwierigkeiten gebracht hat.
ru: HERO: Наверное, мне удастся найти там какую-нибудь|адскую вещь, чтобы отомстить демону, поставившему|меня в такие условия.

source: OTHER: No, cóż. Może to jest jakiś pomysł.
de: OTHER: Warum nicht. Vielleicht ist das eine|gar nicht mal so schlechte Idee.
ru: OTHER: Почему нет? Вполне неплохая идея.

source: P#OTHER: Czy wiesz coś więcej o tym zamku?
de: P#OTHER: Weißt du denn etwas mehr über dieses Schloß?
ru: P#OTHER: Ты знаешь что-нибудь об этом замке?

source: HERO: Jeszcze raz powiem o tym zamku...
de: HERO: Ich will dir mehr von diesem Schloß erzählen...
ru: HERO: Я тебе расскажу...

source: HERO: Ponoć żyją w nim wampiry.
de: HERO: Angeblich leben dort Vampire.
ru: HERO: Там живут вампиры.

source: HERO: W zamku żaden człowiek nie|mieszka od lat.
de: HERO: Menschen sollen dort seit langer Zeit nicht mehr leben.
ru: HERO: Там долго не выживают люди.

source: HERO: Budynek jest dwuczęściowy.
de: HERO: Das Gebäude ist zweigeteilt.
ru: HERO: Само здание рушится.

source: HERO: W okolicy panuje mrok, tak jakby|słońce nie chciało tam świecić.
de: HERO: Es ist in Dunkelheit versunken, so als ob die|Sonne dort niemals scheinen will.
ru: HERO: Там никогда не светит солнце.

source: OTHER: Hm, gdzieś, kiedyś... Nie, nie pamiętam.
de: OTHER: Hm, da fällt mir etwas ein... Irgendwo, irgendwann...|Nein, ich kann mich nicht erinnern.
ru: OTHER: Там еще что-то есть... Иногда.. Где-то... Нет, не помню.

source: OTHER: Mój drogi, może napiłbyś się piwa|zamiast zawracać mi w kółko głowę?
de: OTHER: Mein Teurer, vielleicht hättest du die Freundlichkeit mal ein|Bier zu trinken, anstatt mir ständig auf die Nerven zu gehen?
ru: OTHER: Мой дорогой, может лучше пива выпьем, вместо того, чтобы мне на|нервы действовать?

source: OTHER: Mmmm....
ru: OTHER: Хм...

source: OTHER: Blisko, blisko...
de: OTHER: Wir kommen der Sache schon näher...
ru: OTHER: Мы подходим к сути вопроса...

source: P#OTHER: Mam to na końcu języka, ale...
de: P#OTHER: Es liegt mir auf der Zunge, aber...
ru: P#OTHER: Уто вертится на кончике языка...

source: OTHER: Nie, chłopcze, w końcu nie byłem tu już|tysiąc lat. Mam prawo zapomnieć jeden|czy drugi drobny szczegół.
de: OTHER: Nein, Junge, schließlich war ich schon|seit über tausend Jahren nicht mehr hier.|Da habe ich doch das Recht mal die eine oder|andere Kleinigkeit zu vergessen...
ru: OTHER: Нет, парень, меня не было тут уже тысячу|лет. Так что я могу и забыть что-то.

source: OTHER: Hm...
ru: OTHER: Хм...

source: P#OTHER: Hm.
ru: P#OTHER: Хм.

source: P#OTHER: Hm!
ru: P#OTHER: Хм!

source: OTHER: Słynny zamek Fjord!
de: OTHER: Das berühmte Schloß Fjord!
ru: OTHER: Это - знаменитый замок Фьорд!

source: OTHER: Ależ to Fjord!
de: OTHER: Ja, das ist es! Fjord!
ru: OTHER: Да, точно! Фьорд!

source: OTHER: Musisz pójść na południowy wschód.|To niedaleko stąd.
de: OTHER: Du mußt nach Südosten gehen.|Es ist nicht weit von hier.
ru: OTHER: Ты должен оправиться на юго-восток.|Это недалеко.

source: OTHER: Nigdy mi się nie podobało to stare zamczysko.|Nic dziwnego, że wampiry uwiły sobie w nim|urocze gniazdko.
de: OTHER: Mir hat dieses alte Schloß noch nie gefallen.|Kein Wunder, daß sich dort Vampire|eingenistet haben.
ru: OTHER: Мне всегда не нравился этот замок, неудивительно,|что там поселились вампиры.

source: OTHER: Czy opowiadałem ci jak kiedyś poskromiłem...|A zresztą masz pewnie większe zmartwienia?
de: OTHER: Habe ich dir schon erzählt, wie ich damals|Fledermäuse gezähmt habe? Naja, vermutlich|hast du jetzt andere Sorgen im Kopf.
ru: OTHER: Я тебе рассказывал, как я однажды... Впрочем,|у тебя, наверное, итак хватает забот.

source: HERO: Znalazłem pewną książkę...
de: HERO: Ich habe ein gewisses Buch gefunden...
ru: HERO: Я тут одну книгу нашел...

source: HERO: Wydaje mi się, iż jest magiczna, więc od razu|pomyślałem o tobie, drogi przyjacielu.
de: HERO: Es kommt mir so vor, als wenn es magisch wäre,|also habe ich gleich an Euch gedacht,|mein teurer Freund.
ru: HERO: Мне кажется, что она волшебная. Я сразу подумал|о тебе, дорогой друг.

source: OTHER: Cóż...hm...tak...zajmujące. Powiem|więcej: interesujące.
de: OTHER: Nun...hm...ja...faszinierend.|Besser gesagt: geradezu fesselnd!
ru: OTHER: Ну... хм.. да... Интересно. Даже|очень.

source: OTHER: Gdzie znalazłeś tego białego kruka?
de: OTHER: Wo hast du dieses Unikat gefunden?
ru: OTHER: Где ты откопал этот раритет?

source: OTHER: Czyżby zostało coś ze starej wiedzy|przesławnej Silmaniony?
de: OTHER: Sollte etwa noch etwas von dem alten|Wissen des überaus berühmten Silmanion|übriggeblieben sein?
ru: OTHER: Неужели еще что-то сохранилось от старого|Силманиона?

source: HERO: Eeee... Nie wiem, ja tam znalazłem|to przy drodze, może któryś z kupców|kiedyś ją zgubił...
de: HERO: Eeee... Weiß ich nicht,|ich habe es auf der Straße gefunden,|vielleicht hat es einer der Händler verloren...
ru: HERO: Э... Не знаю. Я нашел это|на улице, наверное, торговец оборонил.

source: OTHER: Kupców! Ha! Ci dusigrosze znają się|na magii tyle, co kura na pieprzu!
de: OTHER: Ein Händler! Ha! Diese Pfennigfuchser|haben etwa soviel Ahnung von Magie|wie ein Huhn vom Pfeffer!
ru: OTHER: Торговец! Ха! Этот грошовый барыга знает|о магии столько же, сколько и его|лошадь!

source: OTHER: Nawet jeśli była ich, to tym lepiej,|że ją stracili!
de: OTHER: Selbst wenn es ihnen gehört hat,|so ist es besser, daß sie es verloren haben!
ru: OTHER: Впрочем, для тебя лучше бы, чтобы|он это и вправду "оборонил"...

source: HERO: Rysunki w tej księdze wyglądają interesująco.
de: HERO: Die Zeichnungen in diesem Buch|sehen interessant aus.
ru: HERO: Эти рисунки очень интересные.

source: OTHER: Nie musisz dodawać ni słowa, książę!
de: OTHER: Ihr braucht keine Worte zu verlieren, Prinz!
ru: OTHER: Ничего не упускайте, принц!

source: OTHER: Zaraz biorę się za wnikliwe studia!
de: OTHER: Ich werde mich gleich an eingehende Studien machen!
ru: OTHER: Я сейчас сам это исследую.

source: OTHER: Co do zapłaty...
de: OTHER: Wenn es um die Bezahlung geht...
ru: OTHER: Когда речь идет об описании...

source: P#P#OTHER: <westchnienie>
de: P#P#OTHER: Seufz
ru: P#P#OTHER: Уф...

source: OTHER: Eliksirów miłosnych już nie mam, ale ten|zabawny czar na pewno rozrusza twoich|przyjaciół na jakiejś biesiadzie.
de: OTHER: Liebeselixiere habe ich keine mehr,|aber dieser spaßige Zauber wird bestimmt|die Aufmerksamkeit Eurer Freunde bei|einem Festmahl erregen.
ru: OTHER: У меня больше нет любовного эликсира,|но это вот колдовство вполне эффектно|будет смотреться на балу.

source: HERO: Arivaldzie...
de: HERO: Arivald...
ru: HERO: Аривальд...

source: P#OTHER: Tak?
de: P#OTHER: Ja?
ru: P#OTHER: Да?

source: HERO: Jak to powiedzieć...
de: HERO: Wie soll ich es sagen...
ru: HERO: Как бы мне это сказать...

source: HERO: Wejścia do Fjord broni taki kamienny demon,|który właściwie nie jest kamienny i...
de: HERO: Den Eingang zu Fjord bewacht so ein steinerner Dämon,|der eigentlich nicht steinern ist und...
ru: HERO: Вход в замок охраняется одним демоном...

source: OTHER: Czyżby była ci potrzebna maść na oparzenia?
de: OTHER: Solltest du etwa eine Salbe gegen Verbrennungen brauchen?
ru: OTHER: Тебе нужна защита от сожжения?

source: $0: I to na bardzo wrażliwe miejsce.
de: $0: Und zwar für eine sehr empfindliche Stelle.
ru: $0: И очень важно.

source: $1: Widzę, że znasz problem.
de: $1: Ich sehe, daß du das Problem kennst.
ru: $1: Похоже, ты знаешь, в чем трудности.

source: $2: Jak pokonać tego diabelskiego strażnika?
de: $2: Wie kann man diesen teuflischen Wächter besiegen?
ru: $2: Как победить этого охранника?

source: OTHER: Pewnie "tam, gdzie plecy tracą swą|szlachetną nazwę".
de: OTHER: Sicherlich "dort, wo der Rücken|seinen edlen Namen verliert".
ru: OTHER: Там, где теряется смысл спины его|древнего имени.

source: OTHER: Nie martw się, do wesela się zagoi.
de: OTHER: Mach dir keine Sorgen,|bis zu deiner Hochzeit ist es überstanden.|Verlaß dich drauf!
ru: OTHER: Не волнуйся, в нужное время|ты сам это поймешь.

source: HERO: Co jednak nie zmienia faktu, że|nie mogę wejść do środka zamku.
de: HERO: Was immer noch nichts an der Tatsache ändert,|daß ich nicht in das Innere des Schlosses|gelangen konnte.
ru: HERO: Что остается важным, что я так еще и не попал|в замок.

source: OTHER: Stare sztuczki zawsze działają. Lustro,|mój chłopcze, może ci pomóc. Idealnie|gładkie lustro.
de: OTHER: Alte Tricks wirken immer. Ein Spiegel,|mein Junge, wird dir helfen.|Aber nur ein absolut glatter Spiegel.
ru: OTHER: Старые трюки всегда работают. Типа зеркала.

source: OTHER: Może barman ma coś takiego na składzie.|No chociaż na twoim miejscu, oczywiście|bym na to nie liczył.#X1
de: OTHER: Vielleicht hat der Wirt so etwas in seinem Lager.|Aber ich würde nicht darauf zählen.#X1
ru: OTHER: Поищи у торговцев...#X1

source: OTHER: Sam kiedyś wymyśliłem ten system|zabezpieczeń.
de: OTHER: Ich selbst habe mir einst dieses|Sicherungssystem ausgedacht.
ru: OTHER: Я сам придумал такую систему безопасности...

source: OTHER: Widzę, że mój detektor ruchu przetrwał|całe tysiąclecie.
de: OTHER: Ich sehe, daß mein Bewegungsdetektor|ein ganzes Jahrtausend überdauert hat.
ru: OTHER: Я вижу, что мой сенсор движения пережил|эту тысячу лет.

source: HERO: Cieszę się razem z tobą, ale jak mam|pokonać tego laserowego strażnika?
de: HERO: Ich freue mich aufrichtig mit dir, aber wie soll|ich diesen Laserwächter besiegen?
ru: HERO: Я рад за тебя, но как мне обойти этого лазерного|охранника?

source: OTHER: Stary trick z lustrem byłby pomocny,|ale przeciw takiemu demonowi pomogłoby|tylko idealnie gładkie lustro.
de: OTHER: Der alte Trick mit dem Spiegel wäre|bestimmt hilfreich, aber gegen so einen Dämon|kann nur ein absolut glatter Spiegel helfen.
ru: OTHER: Старый трюк с зеркалом. Но против такой|мощи нужно очень хорошее зеркало.

source: OTHER: Zapytaj barmana.#X1
de: OTHER: Frag den Wirt.#X1
ru: OTHER: Спроси у торговцев.#X1

source: OTHER: Kiedy jesteś w jego pobliżu, pamiętaj,|mój przyjacielu: festina lente.
de: OTHER: Wenn du in seiner Nähe bist,|dann vergiß nicht: festina lente.
ru: OTHER: И не забывай, все дело в скорости.

source: OTHER: Gładziutkie lusterko. Oto rozwiązanie|twojego problemu.
de: OTHER: Ein glattes Spieglein. Das ist die|Lösung deines Problems.
ru: OTHER: Хорошее зеркало. Это решение твоей|проблемы.

source: HERO: Arivald coś wspomniał, że możesz mieć|jakieś idealnie gładkie lustro?...
de: HERO: Arivald hat etwas davon erwähnt,|daß du einen ideal glatten Spiegel hättest?
ru: HERO: Аривальд говорил, что у тебя есть|хорошее зеркало?

source: OTHER: Mistrz Arivald? Dostojny czarodziej?
de: OTHER: Meister Arivald? Der ehrwürdige Zauberer?
ru: OTHER: Мастер Аривальд? Волшебник?

source: OTHER: Mistrz Arivald? Mój nowy, wspaniały klient?
de: OTHER: Meister Arivald? Mein neuer Kunde?
ru: OTHER: Мастер Аривальд? Мой клиент?

source: OTHER: Niestety, bardzo bym chciał ci pomóc,|książę, ale nie mogę.
de: OTHER: Aber leider, ich würde Euch ja sehr gerne|helfen, Prinz, aber ich kann es nicht.
ru: OTHER: Я бы с радостью помог вам? принц? но не могу.

source: OTHER: Siedem lat temu stały się dwie|rzeczy.
de: OTHER: Vor sieben Jahren sind zwei|Dinge passiert.
ru: OTHER: За последние семь лет случилось|две вещи.

source: OTHER: Ożeniłem się, i rozbiłem jedyne|lustro.
de: OTHER: Ich habe erstens geheiratet und zweitens|den einzigen Spiegel zerschlagen.
ru: OTHER: Я женился и разбил зеркало.

source: OTHER: Już nigdy nie kupię nowego.
de: OTHER: Ich werde mir nie wieder einen neuen kaufen.
ru: OTHER: И я не покупал другого.

source: HERO: Może znalazłbyś jakiś dobrze wypolerowany|kawałek metalu?
de: HERO: Vielleicht könntest du ein sehr gut poliertes|Stück Metall finden?
ru: HERO: Может, ты можешь найти хорошо отполированный металл?

source: HERO: Cokolwiek gładkiego!
de: HERO: Irgend etwas Glattes!
ru: HERO: Что-нибудь гладкое?

source: OTHER: Niestety...
de: OTHER: Leider nein...
ru: OTHER: Увы, нет.

source: P#OTHER: Chociaż przecież...
de: P#OTHER: Aber Moment mal...
ru: P#OTHER: Но секундочку...

source: OTHER: No jasne!
de: OTHER: Na klar!
ru: OTHER: Конечно!

source: OTHER: Poproś swojego ojca, książę!
de: OTHER: Bittet Euren Vater, Prinz!
ru: OTHER: Спросите у отца, принц!

source: OTHER: On ma w skarbcu to słynne magiczne|lustro, które właściwie nie wiadomo|do czego służy.
de: OTHER: Er hat in der Schatzkammer diesen|berühmten magischen Spiegel,|von dem niemand eigentlich weiß,|wozu er gut ist.
ru: OTHER: У него есть прекрасное магическое|зеркало, которым все равно никто|не умеет пользоваться.

source: OTHER: Ponoć jest bezcenne, ale w końcu jesteś|księciem i możesz brać ze skarbca, co|chcesz.
de: OTHER: Er ist angeblich unschätzbar wertvoll,|aber letztendlich seid Ihr der Prinz und|könnt aus der Schatzkammer nehmen,|was Ihr möchtet.
ru: OTHER: Оно очень дорогое, но вы-то принц, можете|его взять.

source: P#HERO: No to mam kłopoty.
de: P#HERO: Das sagt sich so leicht dahin...
ru: P#HERO: Это проще сказать..

source: HERO: Mam tu coś, co cię zaciekawi.
de: HERO: Ich habe hier etwas, das dich|neugierig machen könnte.
ru: HERO: Я могу показать кое-что интересное...

source: OTHER: Naprawdę?
de: OTHER: Wirklich?
ru: OTHER: Правда?

source: HERO: Dostałem to od innego czarodzieja.
de: HERO: Das habe ich von einem anderen Zauberer bekommen.
ru: HERO: Я это получил от другого волшебника.

source: OTHER: Och, to znany czar. Tylko hmmm, niech|spojrzę. Dziwne efekty uboczne.
de: OTHER: Ach, das ist ein bekannter Zauber.|Nur, hmmm, laß mich mal sehen...|mit merkwürdigen Nebenwirkungen.
ru: OTHER: А, Это - известное волшебство. Хм.|Ну-ка...

source: HERO: Wiedziałem, że gdzieś tkwi jakiś|haczyk.
de: HERO: Wußte ich doch, daß da irgendwo|ein Haken dran ist.
ru: HERO: Там где-то долен быть выступ...

source: OTHER: To czar zamiany w zwierzę. Pospolita|magia.
de: OTHER: Das ist ein Zauber, der jemanden in ein Tier|verwandeln kann. Ein gewöhnlicher Zauber.
ru: OTHER: Это волшебство может превратить в животное.

source: OTHER: Problem tkwi w tym, że osoba, na którą rzucamy|to zaklęcie zamienia się w zwierzę symbolizujące|odwrotność jej charakteru.
de: OTHER: Das Problem liegt nur darin, daß die Person,|die verzaubert wird, sich in ein Tier verwandelt,|das die Umkehrung ihres eigenen Charakters symbolisiert.
ru: OTHER: Проблема в том, что при этом символизируется|смена характера...
