Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: OTHER: Mijen sip nioklanc. Okors yrte|szalot?
ru: OTHER: Мьен сип николнак. Окорс златор?

source: HERO: Jestem chory! Ponoć czosnek leczy|przeziębienia!
de: HERO: Ich bin kraaank! Angeblich ist Knoblauch|gut gegen Erkältung!
ru: HERO: Я боооолен! Мне нужен чеснок!

source: OTHER: Szemmit nemirtek. Ozthisem chodj faj|o torkot. Othotuk neked dźjodźsert.
ru: OTHER: Сцемин немирек. Отрин каправс.

source: HERO: Oddaje szal, dziękuję za pomoc.
de: HERO: Hier haben Sie Ihren Schal zurück und|vielen Dank für die Hilfe.
ru: HERO: Вот вам ваша шаль и спасибо за помощь.

source: OTHER: Marosthittem chodj les uji|nioklamcom.
ru: OTHER: Марочинр чоди вью ниокамон.

source: HERO: Pewnie nic nie rozumiesz z tego, co|mówię, ty tępy osiłku.
de: HERO: Du verstehst sicher kein Wort von dem|was ich sage, du debiler Halbstarker.
ru: HERO: Ты что, не понимаешь совсем ничего, половинчатый|идиот?

source: HERO: Co za zadziwiający świat, mają tu takie|tresowane małpy jak ty.
de: HERO: Was für eine wunderliche Welt.|Gestalten wie in der Geisterbahn.
ru: HERO: Какой странный мир. Мы попадаем|на дорогу духа.

source: HERO: Ha, ha! Mogę do ciebie gadać co chcę,|a ty i tak mi nic nie zrobisz.
de: HERO: Ätsch-bätsch! Ich kann zu dir sagen,|was ich will und du kannst mir doch|nichts antun.
ru: HERO: Ш-ш! Я скажу, что я хочу.

source: HERO: Arivaldzie! Już czas! Już czas!|Zabierz mnie stąd!
de: HERO: AAArivald! Es ist soweit! Es ist soweit!|Nimm mich weg von hier!
ru: HERO: Аааривальд! Это слишком далеко, забери меня!

source: HERO: A kim do licha jest Sheila?...
de: HERO: Wer zum Teufel ist Sheila?...
ru: HERO: Где, к дьяволу, Шейла?

source: HERO: Ślepa to mało powiedziane...
de: HERO: Blind ist gar kein Ausdruck...
ru: HERO: Это совсем не ругательство...

source: OTHER: Nareszcie chwila rozrywki!
de: OTHER: Ha-ha! Ein bißchen Spaß muß sein.
ru: OTHER: Ха-ха! Должна же быть забава.

source: OTHER: Czas się odegrać!
de: OTHER: Zeit sich zu revanchieren!
ru: OTHER: Время реванша!

source: OTHER: Łapy aż zatrzeszczą!
de: OTHER: Er reibt sich schon die Hände!
ru: OTHER: Руки прочь!

source: OTHER: Rączki do góry!
de: OTHER: Hände hoch!
ru: OTHER: Руки вверх!

source: OTHER: Nadchodzi godzina zapłaty!
de: OTHER: Die Stunde der Vergeltung wird kommen!
ru: OTHER: Час расплаты настает!

source: OTHER: To oznacza wojnę!
de: OTHER: Das bedeutet Krieg!
ru: OTHER: Это значит - война!

source: OTHER: Się robi, książę!
de: OTHER: Wird gemacht, Prinz!
ru: OTHER: Будет исполнено, принц!

source: OTHER: O nie, książę, jak tak dalej pójdzie,|to zbankrutuję.
de: OTHER: Oh nein, Prinz, wenn das so weiter geht,|dann gehe ich bankrott.
ru: OTHER: О нет, если так пойдет и дальше, я обанкрочусь!

source: OTHER: Myślę, że starczy na dzisiaj.
de: OTHER: Ich glaube, das reicht für heute.
ru: OTHER: Я думаю, на сегодня хватит.

source: OTHER: Ty atakujesz, książę.
de: OTHER: Ihr greift an, Prinz.
ru: OTHER: Он нападает, принц.

source: OTHER: Broń się, książę.
de: OTHER: Verteidigt Euch, Prinz
ru: OTHER: Защищайтесь, принц!

source: OTHER: Dobra nasza, teraz ja atakuję!
de: OTHER: Jetzt greife ich an!
ru: OTHER: Теперь я нападаю.

source: OTHER: Ha, i tak się obronię!
de: OTHER: Ha, ich werde mich sowieso verteidigen!
ru: OTHER: Ха, я итак защищаюсь!

source: OTHER: Złocisz dla ciebie, książę...
de: OTHER: Hier ein Goldstück für Euch, Prinz...
ru: OTHER: Вот вам золото, принц.

source: OTHER: Poproszę o złocisza, książę...
de: OTHER: Ich bitte um ein Goldstück, Prinz...
ru: OTHER: Я прошу у вас немного золота, принц.

source: OTHER: Nie masz złociszy?
de: OTHER: Ihr habt keine Goldstücke?
ru: OTHER: У вас нету золота?

source: OTHER: Ech, książę...
de: OTHER: Ach, Prinz...
ru: OTHER: Ах, принц...

source: OTHER: Ale przynajmniej miałem chwilę radości.
de: OTHER: Aber wenigstens hatte ich einen Moment der Freude.
ru: OTHER: Но у меня был миг радости.

source: HERO: Potrzebuję pomocy.
de: HERO: Ich brauche Hilfe.
ru: HERO: Мне нужна помощь.

source: HERO: Nie mogę sam sobie dać rady.
de: HERO: Ich komme alleine nicht weiter.
ru: HERO: Я один дальше не пойду.

source: HERO: Jako pustelnik pewnie masz różne wizje.
de: HERO: Als Einsiedler hast du bestimmt|eine Menge ... Visionen.
ru: HERO: Как у поселенца у тебя много...|видений...

source: HERO: Czy trochę złota nie rozjaśniłoby|mroków przyszłości?...
de: HERO: Könnte vielleicht etwas Gold helfen, das Dunkel|der Vergangenheit ein wenig zu lichten?
ru: HERO: А золото может помочь осветить мрак прошлого?

source: HERO: Mam tu trochę złota...
de: HERO: Ich habe hier ein wenig Gold...
ru: HERO: У меня есть немного золота...

source: OTHER: A ile, konkretnie?...
de: OTHER: Wieviel genau?...
ru: OTHER: Сколько именно?

source: HERO: Jednego, ślicznego złocisza.
de: HERO: Ein wunderschönes Goldstück.
ru: HERO: Вот прекрасный слиток.

source: OTHER: Przyprowadź jeszcze czterech kolegów|i porozmawiamy.
de: OTHER: Hol noch vier Freunde von ihm her,|dann sprechen wir weiter.
ru: OTHER: Еще четыре и мы продолжим разговор.

source: HERO: Myślałem, że pustelnikom nie zależy|na dobrach doczesnych...
de: HERO: Ich dachte, daß Einsiedler nicht an|weltlichen Gütern interessiert sind...
ru: HERO: Я думаю, что поселенцы не интересуются|материальными ценностями...

source: OTHER: Oczywiście, ale gdyby nie opłaty,|byłoby tu tylu klientów, że nie|miałbym czasu na medytację.
de: OTHER: Selbstverständlich nicht, aber wenn|es keine Gebühren gäbe, dann|würden hier alle Schlange stehen...|Wie soll ich da meditieren, hm?
ru: OTHER: Конечно нет, но как же иначе медитировать?

source: HERO: U-hm.
de: HERO: Uff...hmm.
ru: HERO: Уф... Хм,...

source: OTHER: ...bo jeśli złociszy jest mniej niż|pięć...
de: OTHER: ...denn wenn es weniger als fünf|Goldstücke sind...
ru: OTHER: ... когда менее пяти золотых слитков...

source: HERO: Tak właśnie jest, widzę, że przedni|z ciebie jasnowidz...
de: HERO: Genau so ist es! Du bist ein|echter Hellseher!
ru: HERO: Вот оно! Ты - настоящий провидец!

source: OTHER: ...to nic z tego.
de: OTHER: ... dann wird nichts draus.
ru: OTHER: ... тогда ничего не выйдет.

source: OTHER: Cena usługi nie podlega negocjacjom.
de: OTHER: Der Preis ist nicht verhandelbar.
ru: OTHER: Цена не обсуждаема.

source: OTHER: Pięć złociszy, albo nic.
de: OTHER: Fünf Goldstücke, oder Arrividerci.
ru: OTHER: Пять золотых кусков, или до свидания.

source: HERO: Ech ten wolny rynek...
de: HERO: Ach, Einsiedler sind auch nicht mehr das,|was sie einmal waren.
ru: HERO: Да, даже поселенцы больше не те, что ранее...

source: OTHER: Widzę, książę, jak...
de: OTHER: Ich sehe Prinz, wie...
ru: OTHER: Я вижу, принц, как...

source: OTHER: Coś chyba nie tak.
de: OTHER: Das kann doch nicht sein.
ru: OTHER: Этого не может быть.

source: HERO: Co? Co takiego?
de: HERO: Wieso? Was denn?
ru: HERO: Почему? А что?

source: OTHER: Widzę, jak rozmawiasz ze słojem.
de: OTHER: Ich sehe, wie du mit einem|Einmachglas sprichst.
ru: OTHER: Я вижу, как ты разговариваешь|со стаканом.

source: OTHER: I to w pobliskim miasteczku.
de: OTHER: Und das in einem nahegelegenen Städtchen.
ru: OTHER: И это в ближайшем городе.

source: HERO: Ze słojem?
de: HERO: Mit einem Einmachglas!?
ru: HERO: Со стаканом?

source: HERO: Na pewno?
de: HERO: Bist du sicher?
ru: HERO: Ты уверен?

source: OTHER: Wiem, że to niezwykłe, ale tak właśnie|jest.
de: OTHER: Ich weiß, daß das ungewöhnlich klingt,|aber so ist es.
ru: OTHER: Я понимаю, что это необычно, но это так.

source: HERO: No to chyba straciłem pięć złociszy...
de: HERO: Ich glaube, die fünf Goldstücke waren nicht gut angelegt.
ru: HERO: Мне кажется, что пять золотых слитков ушли не по делу.

source: OTHER: Widzę...
de: OTHER: Ich sehe...
ru: OTHER: Я вижу...

source: OTHER: Kamiennego demona...
de: OTHER: Einen steinernen Dämon...
ru: OTHER: Одного демона...

source: OTHER: Ciebie z lustrem w ręku...
de: OTHER: Und dich mit einem Spiegel in der Hand...
ru: OTHER: С зеркалом в руке...

source: OTHER: Ale coś jest nie tak.
de: OTHER: Aber irgend etwas ist nicht in Ordnung.
ru: OTHER: Но что-то не так.

source: OTHER: Ktoś siedzi demonowi na głowie i zasłania|mu oczy.
de: OTHER: Jemand sitzt auf dem Kopf des Dämons|und hält ihm die Augen zu.
ru: OTHER: Кто-то сидит на голове демона и закрывает|ему глаза.

source: OTHER: Ktoś tak mały, że właściwie nie widzę|dokładnie kto...
de: OTHER: Jemand, der so klein ist, daß ich eigentlich|nicht genau sehen kann, wer es ist...
ru: OTHER: Кто-то очень маленький, я не могу разглядеть.

source: HERO: Ja, lustro, demon i ktoś na jego głowie?
de: HERO: Du siehst mich mit einem Spiegel und jemanden,|der auf dem Kopf eines Dämons sitzt?
ru: HERO: Ты видишь меня с зеркалом и кого-то на моей голове?

source: HERO: Przeczuwam duże kłopoty...
de: HERO: Hört sich nach 'ner Menge Ärger an...
ru: HERO: Слушай сюда!

source: OTHER: Och... Co za anielska wizja...
de: OTHER: Oh... Was für eine göttliche Vision...
ru: OTHER: Ох.. Какое странное видение...

source: OTHER: Chmury...
de: OTHER: Wolken...
ru: OTHER: Облака...

source: OTHER: Jak w niebie...
de: OTHER: Wie im Himmel...
ru: OTHER: Как на небесах...

source: OTHER: Siedzisz, i grasz na lutni...
de: OTHER: Du sitzt, und spielst auf der Laute...
ru: OTHER: Ты сидишь и играешь на флейте...

source: OTHER: Wygląda, jak lutnia tego obiboka barda.
de: OTHER: Sieht aus, wie die Laute dieses Faulenzers, dieses Barden.
ru: OTHER: Похоже, что эта флейта того лентяя барда...

source: OTHER: Ale on przecież zawsze trzyma ją w domu.
de: OTHER: Aber er bewahrt sie doch zu Hause auf.
ru: OTHER: Но он ее хранит дома...

source: OTHER: Dziwne.
de: OTHER: Merkwürdig.
ru: OTHER: Замечательно.

source: HERO: Ale ja nie umiem grać na żadnym|instrumencie!
de: HERO: Aber ich kann doch gar kein|Instrument spielen!
ru: HERO: Но я не умею играть на инструментах!

source: OTHER: Moja wizja jest prawdziwa.
de: OTHER: Dann muß meine Vision stimmen.
ru: OTHER: Тогда значит придется поверить.

source: OTHER: A lutnia barda jest czarodziejska.
de: OTHER: Und die Laute des Barden ist magisch.
ru: OTHER: Или флейта волшебная.

source: HERO: Aaaa...
de: HERO: Aha...
ru: HERO: Ага...

source: HERO: To wszystko tłumaczy...
de: HERO: Das erklärt alles...
ru: HERO: Это все объясняет...

source: OTHER: Oto nadchodzi wizja...
de: OTHER: Hier kommt eine Vision...
ru: OTHER: Вот еще одно видение...

source: OTHER: Jesteś w zupełnie innym świecie...
de: OTHER: Du bist in einer ganz anderen Welt...
ru: OTHER: Ты совсем в другом мире...

source: OTHER: Wręczasz jakiejś kobiecie dziwny amulet...
de: OTHER: Du überreichst irgendeiner merkwürdigen Frau|ein merkwürdiges Amulett...
ru: OTHER: Ты передаешь красивой женщине красивый амулет...

source: OTHER: A potem zabierasz go z powrotem...
de: OTHER: Und danach nimmst du es ihr wieder weg...
ru: OTHER: А затем снова забираешь...

source: HERO: Daję i odbieram? Po co?
de: HERO: Ich gebe es und nehme es wieder weg?|Aber wozu?
ru: HERO: Я даю и забираю? Но зачем?

source: OTHER: Tego nie wiem. Widzę tylko obrazy, nie|rozumiem ich znaczeń.
de: OTHER: Das weiß ich nicht. Ich sehe nur Bilder,|aber ich verstehe nicht ihre Bedeutung.
ru: OTHER: Я этого не знаю. Я вижу только картинки,|но не знаю значения.

source: HERO: Dzięki za nic.
de: HERO: Danke, du warst mir eine große Hilfe.
ru: HERO: Спасибо, ты мне очень помог.

source: OTHER: Mam! Mam!
de: OTHER: Ich hab es! Ich hab es!
ru: OTHER: Есть! есть!

source: OTHER: Widzę!
de: OTHER: Ich sehe!
ru: OTHER: Я вижу!

source: OTHER: Widzę jak...
de: OTHER: Ich sehe wie du...
ru: OTHER: Я вижу, как ты...

source: OTHER: ...w jakiejś grocie...
de: OTHER: ...in einer Grotte rumstehst...
ru: OTHER: ...стоишь в гроте...

source: OTHER: ...podpalasz chmurę perfum...
de: OTHER: ...und an einer Parfumwolke herumzündelst...
ru: OTHER: ... в облаке духов...

source: OTHER: ...skrzeszoną iskrą....
de: OTHER: ...mit einem entfachten Funken...
ru: OTHER: ... со странным действием...

source: OTHER: BUM!
de: OTHER: ...und dann... BUM!
ru: OTHER: ... и затем... БУМ!

source: HERO: O-ho.
ru: HERO: О-хо!

source: HERO: Wiedziałem, że bez fajerwerków się|nie obejdzie.
de: HERO: Wußte ich es doch, daß es nicht|ohne Feuerwerk abgeht.
ru: HERO: Я знал, что без фейерверка не обойдется.

source: OTHER: Auć!
de: OTHER: Oh, entsetzlich!
ru: OTHER: Ох, наконец!

source: OTHER: To brutalna wizja!...
de: OTHER: Das ist eine sehr abstoßende Vision!...
ru: OTHER: Очень четкое видение!

source: OTHER: Widzę, jak bez żenady wpychasz jakieś|śliczne dziewczę w ciasny otwór|piwniczny...
de: OTHER: Ich sehe, wie du ein wunderschönes|Mädchen schamlos in eine sehr enge|Öffnung stößt.
ru: OTHER: Я вижу, как ты совершенно не стесняясь,|ставишь прекрасную девушку в|странное положение.

source: OTHER: Co za brak taktu...
de: OTHER: Einfach schamlos...
ru: OTHER: Совсем не стесняясь.

source: HERO: Khm, na pewno coś ci się pomyliło.
de: HERO: Hm, sicher bringst du da etwas durcheinander.
ru: HERO: Странно, что-то там не так...

source: HERO: Wcale nie jestem taki.
de: HERO: Das ist so gar nicht meine Art.
ru: HERO: Это - не мой стиль.

source: OTHER: Zobaczymy, ale moje wizje zawsze się|sprawdzają...
de: OTHER: Das werden wir ja sehen.|Meine Visionen treten immer ein...
ru: OTHER: Это мы посмотрим... Видения|продолжаются...

source: OTHER: Oooo!...
ru: OTHER: Ооо!!

source: OTHER: To najdziwniejsza wizją, jaką kiedykolwiek|miałem!
de: OTHER: Das ist die seltsamste Vision,|die ich jemals hatte!
ru: OTHER: Это самое странное, что я видел!

source: HERO: Co? Co takiego widzisz?
de: HERO: Was siehst du denn?
ru: HERO: Что ты видишь?

source: OTHER: Widzę, jak uderzasz udźcem baranim diabła,|potem odcinasz mu rogi, z których jednym|blokujesz dopływ lawy do...
de: OTHER: Ich sehe, wie du mit einer Widderkeule|auf einen Teufel einschlägst und ihm dann|die Hörner abschneidest. Mit einem der Hörner|versuchst du einen Lavafluß aufzuhalten...
ru: OTHER: Я вижу, как ты набрасываешься на черта|и отпиливаешь у него рога... С одним из|рогов ты пытаешься остановить поток лавы...

source: OTHER: Nie, to niemożliwe, ta wizja jest zbyt|nierzeczywista.
de: OTHER: Ach, das gibt's doch gar nicht, diese Vision|ist ... nun ja... ziemlich unwahrscheinlich.
ru: OTHER: ...Ах, что-то это видение какое-то неправдоподобное...

source: OTHER: No bo co byś robił...
de: OTHER: Denn was hättest du wohl...
ru: OTHER: А что ты хотел...

source: OTHER: ...w Piekle?!?
de: OTHER: ...in der Hölle zu schaffen?!?
ru: OTHER: делать в аду?

source: HERO: Ha-ha!
ru: HERO: Ха-ха!

source: HERO: Więc jednak mi się uda!
de: HERO: Also werde ich doch in die Hölle kommen!
ru: HERO: Так мне еще и в ад!

source: P#OTHER: A myślałem, że to ja jestem szalony...
de: P#OTHER: Und ich dachte immer, daß ich nicht ganz gebacken bin...
ru: P#OTHER: А я думал, что я не настолько испорчен...

source: $0: Gest: pokrapianie się
de: $0: Geste: Selbstbesprengen
ru: $0: Жесты: Сам прыгни

source: $1: Gest: tyci-tyci
de: $1: Geste: So klein
ru: $1: Жесты: Так мало

source: $2: Gest: kształt butelki
de: $2: Geste: Flaschengestalt
ru: $2: Жесты: Совсем пьяный

source: $3: Gest: złożone ręce
de: $3: Geste: Hände falten zum Gebet
ru: $3: Жесты: Руки для молитвы

source: OTHER: Zostaw mnie, ty wstrętna maszkaro!
de: OTHER: Laß mich in Frieden, du Scheusal!
ru: OTHER: Пусти меня, грубиян!

source: OTHER: Aaaaaaa!...
ru: OTHER: Ааааааа!..

source: OTHER: Pomogłem ci już trzy razy. Teraz|muszę udać się w swoją stronę.
de: OTHER: Ich habe dir schon dreimal geholfen. Nun|muß ich meinen eigenen Weg gehen.
ru: OTHER: Я уже помогал тебе трижды, теперь мне пора.

source: OTHER: Spadam, pa!
de: OTHER: Ich mach' die Fliege. Tschüs!
ru: OTHER: Я люблю летать. Пока.

source: HERO: Niektórzy biorą pewne sprawy zbyt|dosłownie.
de: HERO: Manche nehmen alles|zu wörtlich.
ru: HERO: Некоторые так дословно|все воспринимают...

source: OTHER: <mamrotanie>
de: OTHER: ...murmel...murmel
ru: OTHER: ... жужужу... жужу

source: OTHER: <szept>
de: OTHER: Murmel...
ru: OTHER: Жужужу.

source: HERO: Pani mąż coś zgubił...
de: HERO: Ihr Mann hat da etwas verloren...
ru: HERO: Твой муж что-то потерял...

source: HERO: Rozmową go chyba nie przestraszę...
de: HERO: Mit bloßem Gerede jage ich ihm wohl|keinen Schrecken ein...
ru: HERO: Я его еще поймаю...

source: $0: Giń!
de: $0: Stirb!
ru: $0: Умри!

source: $1: Zaraz umrzesz!
de: $1: Du wirst gleich sterben!
ru: $1: Ты сейчас умрешь!

source: $2: Spróbuj tego!
de: $2: Versuch es!
ru: $2: Попробуй!

source: HERO: Yukkakoppamakki!
ru: HERO: Юккакоппамаки!

source: $3: Yukkakoppamakki!
ru: $3: Юккакоппамаки!

source: OTHER: To ja przepraszam.
de: OTHER: Aua.
ru: OTHER: Ауа!

source: HERO: Do-dobra, to było bardzo śmieszne,|a teraz wracaj.
de: HERO: Na gut, das war sehr witzig,|aber nun komm zurück.
ru: HERO: Это было смешно, но теперь вернись.

source: OTHER: Jestem silna i sprawna, ale jakoś jeszcze|nie potrafię skakać dwa metry w górę.
de: OTHER: Na klar. So sportlich wie ich bin, da kann ich|schon mal zwei Meter in die Höhe springen.
ru: OTHER: Я сильная и прыткая, но всё-же как-то не могу прыгать на два метра.

source: OTHER: Przecież to oczywiste, że musisz mi|pomóc.
de: OTHER: Es würde sich eigentlich von selbst verstehen,|daß du mir hilfst.
ru: OTHER: Само собой разумеется, ты должен мне|помочь.

source: OTHER: Wpakowałeś mnie tu, to teraz mnie|wyciągnij.
de: OTHER: Du hast mich hineingeritten, nun hilf mir|heraus.
ru: OTHER: Ты меня сюда завлек, теперь помоги мне выбраться.

source: OTHER: W porządku.
de: OTHER: In Ordnung.
ru: OTHER: В порядке.

source: OTHER: Chyba o to ci chodziło.
de: OTHER: Darum ging es dir doch.
ru: OTHER: Вот почему.

source: OTHER: Pomyśl o tym jeszcze chwilę, a wygryzę|ci oczy i wkopie ci je w...
de: OTHER: Mach nur weiter so dann wirst du sehen|wozu ich in der Lage bin...
ru: OTHER: Давай, продолжай, ты увидишь, на что я|способен...

source: HERO: Dobrze, dobrze, tak tylko żartowałem!
de: HERO: Schon gut, ich habe nur gescherzt!
ru: HERO: Хорошо, я всего лишь шутил!

source: OTHER: Przygody...
de: OTHER: Abenteuer!
ru: OTHER: Приключения!

source: OTHER: Najlepsi rachmistrze z Silmaniony|nie zliczyliby ile miałem ich w życiu.
de: OTHER: Der beste Rechenmeister aus Silmanion|könnte nicht errechnen, wie viele Abenteuer|ich im Leben schon hatte.
ru: OTHER: Самый лучший математик Сильманиона не|мог подсчитать сколько у меня было приключений!

source: OTHER: Ta, o której pragnę wam opowiedzieć jest|jednak hmmm ...szczególna.
de: OTHER: Doch das Abenteuer, von dem ich euch heute|berichten möchte, ist ... hmm... etwas ganz Besonderes.
ru: OTHER: А приключение, о котором я сегодня расскажу....

source: P#OTHER: Zdarzyła się bowiem, kiedy byłem już martwy.
de: P#OTHER: Es hat sich nämlich zugetragen, als ich|längst tot war. Ja, ihr habt richtig gehört!
ru: P#OTHER: Усе началось, когда я давным-давно умер.|Да, вы правильно услышали!

source: OTHER: Martwy od tysiąca lat!
de: OTHER: Tot seit tausenden von Jahren!
ru: OTHER: Тысячу лет я был мертв!

source: OTHER: Z tym tysiącem może jednak przesadzam, ale w każdym|razie wierzcie mi: martwy wystarczająco długo,|aby każdemu mogło się to znudzić.
de: OTHER: Nun, das war vielleicht etwas übertrieben,|aber Eines müßt Ihr mir glauben:|Ich war lange genug tot. So lange, daß es jedem von|Euch langweilig geworden wäre...
ru: OTHER: Это, может, я и преувеличил, но смысл остается|- я долго был мертв. Слишком|долго.

source: OTHER: Leżałem sobie w mojej wygodnej,|wyściełanej aksamitem trumnie...
de: OTHER: Ich lag also in meinem bequemen,|mit Samt ausgeschlagenen Sarg...
ru: OTHER: Я лежал в своей уютной усыпальнице,...

source: OTHER: ...prezent od wdzięcznego cechu|browarników...
de: OTHER: ...übrigens ein Geschenk der dankbaren Brauergilde...
ru: OTHER: ... подарок от благодарных пивоваров...

source: OTHER: ...kiedy to ghoul...
de: OTHER: ...als dieser Ghoul...
ru: OTHER: ... когда этот гуль...

source: OTHER: Ale...
de: OTHER: Aber...
ru: OTHER: Но......

source: OTHER: ...nie będę uprzedzał faktów.
de: OTHER: ...ich möchte keine Fakten vorwegnehmen.
ru: OTHER: ... я не собираюсь рассказывать подробности.

source: OTHER: Dość powiedzieć, iż we wszystko zamieszany był|pewien młody człowiek.
de: OTHER: Es genügt, wenn ich verrate, daß in alles|ein bestimmter junger Mensch verwickelt war.
ru: OTHER: Достаточно сказать, что во всем был замешан|один молодой человек.

source: P#OTHER: Mieszkał w krainie pełnej odważnych rycerzy,|potężnych czarów, ognistych smoków, pięknych|księżniczek i pazernych kupców, ale...
de: P#OTHER: Er lebte in einem Land der mutigen Ritter,|der mächtigen Zauberer, feuerspeiender Drachen,|wunderschöner Prinzessinnen und geldgierigen|Kaufleuten, aber...
ru: P#OTHER: Он жил в стране великих рыцарей, могучих волшебников,|...

source: P#OTHER: ...zamiast szukać przygód wolał przesiadywać po|karczmach i słuchać opowieści bardów.
de: P#OTHER: ...anstatt das Abenteuer zu suchen, saß er lieber|in den Wirtshäusern herum und lauschte den Liedern|der Barden!
ru: P#OTHER: ... Вместо того, чтобы гоняться за приключениями, он|просиживал целыми днями в пивнушке и слушал бардов!..

source: OTHER: Taki to był młodzieniec.
de: OTHER: Solch ein Jüngling war das!
ru: OTHER: Какой недоросток!

source: OTHER: Z głową napakowaną bzdurami i bez|żadnego pożytecznego fachu w ręku.
de: OTHER: Den Kopf voller Flausen und ohne|jede solide Ausbildung.... Ach, ja!
ru: OTHER: С головой полной облаков и совсем|без образования... Ах, да!

source: OTHER: A przecież zawsze mógł zostać zręcznym|szulerem czy cenionym biboszem.
de: OTHER: Dabei hätte er wohl ein geschickter Hochstapler|oder ein geachteter Möchtegern werden können.
ru: OTHER: Он хотел стать крутым.

source: OTHER: Aha...
de: OTHER: Und ja,...
ru: OTHER: И вот...

source: P#OTHER: ...zapomniałem wam powiedzieć jak ten|nicpoń miał na imię.
de: P#OTHER: ...fast hätte ich vergessen Euch zu sagen wie|dieser Taugenichts mit Namen genannt wurde.
ru: P#OTHER: ... я почти забыл рассказать, как звали этого человека.

source: OTHER: Swoją drogą było to plebejskie imię|i nie warto go pamiętać.
de: OTHER: Sein richtiger Name war nebenbei gesagt ein|ziemlich plebejischer Name...
ru: OTHER: ... Его настоящее имя весьма плебейское.

source: P#OTHER: Lepiej zapamiętać pod jakim imieniem|przeszedł do legend.
de: P#OTHER: Besser ist es Ihr merkt Euch unter welchem Namen er|in die Legende eingegangen ist...
ru: P#OTHER: Лучше, пусть я расскажу вам о его легендарном имени.

source: P#OTHER: Podobna historia jak ze mną. Nazywajmy|go tak jak chciał być nazywany.
de: P#OTHER: ... Fast so wie bei mir, wenn ich es genau|überlege...
ru: P#OTHER: ... Прямо как я, если подумать...

source: OTHER: Galador!
ru: OTHER: Галадор!

source: OTHER: He he he he!
ru: OTHER: Хе, хе, хе!

source: OTHER: Pasowało to imię do niego jak pięść do nosa.|Ważniejsze jest jednak, iż ten przemiły|młodzieniec miał pecha...
de: OTHER: Dieser Name paßt zu ihm, wie die Faust aufs Auge.|Tja ... und dieser unwahrscheinlich sympathische|Jüngling hatte das ungeheure Pech...
ru: OTHER: Это имя ему не очень-то подходит... И вот этот молодой|человек был столь дерзок...

source: P#OTHER: ...mieszkając w pobliżu pewnego nie mniej|miłego nekromanty, który zasłynął|z umiejętnego wywoływania demonów.
de: P#OTHER: ...in der Nähe eines gewissen, nicht minder netten|Nekromanten zu wohnen, der wiederum durch das|geschickte Beschwören von Dämonen Berühmtheit|erlangt hatte.
ru: P#OTHER: ... жить неподалеку от одного знаменитого, не слишком|несимпатичного, некроманта, якшавшегося с демонами.

source: OTHER: W zamian za władzę nad tymi istotami obiecał im|swoją duszę, ale udało mu się z tego wymknąć.
de: OTHER: Im Austausch für ... die Macht ... hat dieser|seine Seele dem Teufel verschrieben, ja, ja...|aber letztendlich konnte er doch entwischen...
ru: OTHER: В качестве платы за ... силу ... он продал свою|душу дьяволу, да, да, ... но он решил убежать...
