Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: OTHER: To było przepiękne.
de: OTHER: Das war wunderschön.
ru: OTHER: Это было прекрасно.

source: OTHER: Przepiękne...
de: OTHER: Wunderschön...
ru: OTHER: Прекрасно...

source: OTHER: Dawno nie słyszałem muzyki, i zapomniałem,|jak może być cudowna...
de: OTHER: Ich habe lange keine Musik mehr gehört und fast vergessen,|wie herrlich sie sein kann...
ru: OTHER: Я давно не слышал музыки и уже забыл как это бывает.

source: P#OTHER: Co to było, czego chciałeś, młodzieńcze?
de: P#OTHER: Was war das wieder, was du wolltest, mein Junge?
ru: P#OTHER: Что ты там еще хотел, парень?

source: HERO: Chodzi o zamek Fjord, który...
de: HERO: Es geht um das Schloß Fjord, der ...
ru: HERO: Мы говорили о замке Фьорд...

source: OTHER: Ach tak, zalane mrokiem siedlisko zła.
de: OTHER: Ach ja, der mit Dunkelheit umhüllte Sitz des Bösen.
ru: OTHER: А да, о тьме вечной...

source: OTHER: Zrobię, co trzeba, nie martw się.
de: OTHER: Ich erledige alles Nötige, mach dir keine Sorgen.
ru: OTHER: Я все сделаю, не беспокойся.

source: OTHER: Ale teraz naprawdę zostaw mnie już|samego, chcę sycić się wspomnieniami|dźwięków.
de: OTHER: Aber jetzt laß mich wieder allein, ich will|die Erinnerung an die Klänge zurückrufen.
ru: OTHER: Но теперь оставь меня, я буду вспоминать...

source: OTHER: Powodzenia, chłopcze. A jak byś zobaczył|czarodzieja Arybałta, to pozdrów go ode|mnie.
de: OTHER: Viel Glück, mein Junge. Und wenn du|einmal den Zauberer Arivald triffst, grüß ihn|von mir.
ru: OTHER: Удачи, парень. И увидишь Аривальда,|передай привет.

source: OTHER: Niech tu wpadnie kiedyś. Porozmawiamy o|dawnych, dobrych czasach.
de: OTHER: Er soll einmal vorbeikommen, damit wir über die|guten alten Zeiten reden können...
ru: OTHER: Пусть заходит поболтать...

source: OTHER: Halo?
de: OTHER: Hallo?
ru: OTHER: Але?

source: OTHER: Jest tam kto?
de: OTHER: Ist dort jemand?
ru: OTHER: Кто-нибудь есть тут?

source: OTHER: Wyraźnie kogoś słyszę!...
de: OTHER: Ich höre jemanden ganz deutlich!...
ru: OTHER: Я слышу кого-то!

source: OTHER: Halo?...
de: OTHER: Hallo?
ru: OTHER: Але?

source: HERO: Hej, jestem tu, ale kto mówi?!
de: HERO: Hey, ich bin hier, aber wer spricht da?!
ru: HERO: Я тут, а кто говорит?

source: OTHER: Nareszcie jakiś człowiek!
de: OTHER: Endlich, ein Mensch!
ru: OTHER: Наконец! Человек!

source: OTHER: W końcu!
de: OTHER: Das wurde aber auch Zeit!
ru: OTHER: Сколько прошло времени!

source: OTHER: Wydostań mnie stąd!
de: OTHER: Bitte rette mich!
ru: OTHER: Помогите!

source: $0: Chętnie, ale jak?
de: $0: Zu gerne, aber wie?
ru: $0: С удовольствием, но как?

source: $1: Dobrze, ale kim jesteś?
de: $1: In Ordnung. Aber wer bist du?
ru: $1: В порядке. Но кто ты?

source: $2: Jak się tu znalazłaś?
de: $2: Wie bist du hierher gekommen?
ru: $2: Как ты сюда попал?

source: $3: Wrócę później.
de: $3: Ich komme später zurück.
ru: $3: Я вернусь.

source: OTHER: Jestem więziona za magiczną ścianą stworzoną|siłą woli Księcia Wampirów.
de: OTHER: Ich werde hinter dieser magischen Wand|gefangengehalten. Die Wand besteht nur durch die|Willenskraft des Fürsten der Vampire.
ru: OTHER: Меня заточили за этой магической стеной.|Эта стена подчиняется только вампирам.

source: OTHER: Musisz go odnaleźć i zabić.
de: OTHER: Du mußt ihn finden und töten.
ru: OTHER: Ты должен его найти и убить.

source: OTHER: Gdy on zginie, zginie i ściana.
de: OTHER: Wenn er vernichtet ist,|wird auch die Wand verschwinden.
ru: OTHER: Когда он погибнет, исчезнет|и стена.

source: OTHER: Banalne.
de: OTHER: Total banal.
ru: OTHER: Просто.

source: HERO: BANALNE?
de: HERO: BANAL?
ru: HERO: ПРОСТО?

source: HERO: Zabić Księcia Wampirów?!
de: HERO: Den Fürsten der Vampire zu ... töten?
ru: HERO: Убить главного вампира?

source: OTHER: Zabić.
de: OTHER: Töten.
ru: OTHER: Убить.

source: OTHER: Zaszlachtować.
de: OTHER: Abschlachten.
ru: OTHER: Уничтожить.

source: OTHER: Zamordować.
de: OTHER: Ermorden.
ru: OTHER: Прикончить.

source: OTHER: Ukatru...
de: OTHER: Was du willst...
ru: OTHER: Как хочешь...

source: HERO: To rozumiem, ale samego Księcia!...
de: HERO: Ja, schon gut, aber den|Fürsten der Vampire höchstpersönlich!?
ru: HERO: Да, понятно, прямо самого|главного вампира?

source: OTHER: Najpierw musisz go znaleźć.
de: OTHER: Zuerst mußt du ihn finden.
ru: OTHER: Сначала его надо найти.

source: HERO: Chyba leży tutaj i śpi.
de: HERO: Nun, er liegt ja hier und schläft.
ru: HERO: Вон он лежит и спит.

source: HERO: Pan Słońce zaświecił nad Fjord,|więc pewnie postanowił przeczekać|dzień.
de: HERO: Da der Sonnenfürst jetzt über Fjord scheint,|fand er es wohl besser, einen Tag abzuwarten.
ru: HERO: Поскольку опять сияет солнце, ему пришлось переждать|день.

source: OTHER: No to najtrudniejsze za tobą.
de: OTHER: Dann hast du das Schwierigste hinter dich gebracht.
ru: OTHER: Потом, самое тяжелое позади.

source: OTHER: Teraz tylko wbij mu kołek w pierś|i po krzyku.#B0
de: OTHER: Nun mußt du ihm einen Pfahl|in die Brust rammen und das ist|alles.#B0
ru: OTHER: Теперь надо всего лишь забить|в него кол.#B0

source: OTHER: Och to nieważne!...
de: OTHER: Ach, das ist jetzt völlig nebensächlich!...
ru: OTHER: Ах! Это совсем просто.

source: OTHER: Pospiesz się tylko z ratowaniem, bo|nudzę się tu już od ponad roku.
de: OTHER: Beeil dich lieber mit der Rettungsaktion, denn|ich langweile mich schon seit über einem Jahr.
ru: OTHER: Поспеши, а то я тут уже очень давно томлюсь.

source: HERO: Roku?!
de: HERO: Seit einem Jahr?!
ru: HERO: Давно?

source: HERO: To szmat czasu!
de: HERO: Das ist ja 'ne Menge Zeit!
ru: HERO: Это тяжело...

source: OTHER: Nie żartuj?
de: OTHER: Bist du so'n Labertyp oder was?
ru: OTHER: А кто ты?

source: P#OTHER: Jesteś tu jeszcze czy już poszedłeś|mnie ratować?#B0
de: P#OTHER: Bist du noch da oder bist du schon unterwegs,|um mich endlich zu retten?#B0
ru: P#OTHER: Ты будешь меня спасать? или как?#B0

source: OTHER: Słuchaj, później będziemy mieli|mnóstwo czasu na pogawędki.
de: OTHER: Hör mal, für einen Plausch werden wir|nachher viel Zeit haben.
ru: OTHER: Слушай, у нас еще будет время поболтать...

source: OTHER: Ale teraz proszę, pospiesz się,|bo już tutaj nie wytrzymam!
de: OTHER: Aber nun bitte ich dich, beeile dich, sonst|halte ich es hier nicht mehr aus!
ru: OTHER: Поспеши, я тут больше не вынесу и минуты!

source: HERO: Dobrze, już dobrze.#B0
de: HERO: OK, ist ja schon gut.#B0
ru: HERO: Ладно, хорошо.#B0

source: OTHER: Bajki nigdy nie mówiły, że bohaterowie|ratujący damy, tak się guzdrzą.
de: OTHER: In den Märchen hört sich das immer ganz anders an.|Ich erinnere mich an keines, wo die Helden so herumtrödeln.
ru: OTHER: В сказках это все по-другому. Я не помню, чтобы герои| так торопились...

source: OTHER: Ależ to wszystko trwa.
de: OTHER: Das dauert!
ru: OTHER: Это затянулось!

source: OTHER: Tysiąc sto jeden, tysiąc sto dwa, tysiąc sto trzy...
de: OTHER: Eintausendhunderteins,|eintausendhundertzwei,|eintausendhundertdrei...
ru: OTHER: Тысяча сто один, тысяча|сто два....

source: OTHER: Jesteś tam jeszcze, czy już uciekłeś?
de: OTHER: Bist du noch da, oder bist du schon weg?
ru: OTHER: Ты еще тут, или ты уже ушел?

source: OTHER: Chyba się nie boisz?
de: OTHER: Du hast wohl keine Angst?
ru: OTHER: Ты не боишься?

source: OTHER: Zaraz zwariuję z nudów.
de: OTHER: Ich werde gleich verrückt vor Langeweile.
ru: OTHER: Я сойду с ума!

source: HERO: Arivaldzie, czy znasz jakiś skuteczny|środek przeciwko wampirom?
de: HERO: Arivald, kennst du ein wirksames|Mittel gegen Vampire?
ru: HERO: Аривальд, ты знаешь средство от вампиров?

source: OTHER: Szybkie nogi?
de: OTHER: Schnelle Beine?
ru: OTHER: Быстро бегать?

source: HERO: Hm, uściślijmy. Chodzi o pokonanie wampira,|a nie uciekanie przed wampirem.
de: HERO: Hm, konkretisieren wir das. Es geht darum,|den Vampir zu besiegen, und nicht darum,|vor dem Vampir zu flüchten.
ru: HERO: Хм, а поконкретнее... Надо убить вампира.

source: OTHER: Oczywiście osikowy kołek.
de: OTHER: Ja, allerdings. Ein Espenpflock.
ru: OTHER: Да, конечно, осиновый кол.

source: OTHER: Wbity w wampirzą pierś działa|ze stuprocentową skutecznością.
de: OTHER: Ein Espenpflock, in die Brust|des Vampirs gestochen, wirkt mit|hundertprozentiger Sicherheit.
ru: OTHER: Надо забить в грудь вампира осиновый|кол. Стопроцентное средство.

source: P#HERO: A gdyby ktoś musiał pokonać|samego Księcia Wampirów?
de: P#HERO: Und wenn jemand den Fürsten der|Vampire in Person besiegen wollte?
ru: P#HERO: А если надо победить главного вампира?

source: OTHER: Ho ho ho ho ho!
ru: OTHER: Хо хо хо !

source: OTHER: Tego jeszcze nikt nie próbował,|ale zakładam, że osikowy kołek|musiałby zostać wzmocniony.
de: OTHER: Das hat noch niemand gewagt, doch|ich nehme an, daß der Espenpflock|verstärkt werden müßte.
ru: OTHER: Этого еще никто не пробовал. Но я|думаю, что кол вполне подойдет. Только|надо его усилить.

source: HERO: W jaki sposób?
de: HERO: Auf welche Weise?
ru: HERO: Как?

source: OTHER: Pobłogosławiony?
de: OTHER: Er müßte gesegnet werden.
ru: OTHER: Надо его заточить.

source: OTHER: Trochę czosnku też by nie zaszkodziło.|W moich czasach był to podstawowy|straszak na wampiry.
de: OTHER: Ein bißchen Knoblauch würde auch nicht|schaden. Zu meinen Zeiten war Knoblauch|das grundlegende Mittel gegen Vampire.
ru: OTHER: И немного чеснока не помешает.

source: OTHER: Odstraszał też, co prawda, piękne|kobiety, ale to tylko skutek uboczny.
de: OTHER: Er schreckte zwar auch die schönen Frauen ab,|doch das war lediglich eine Nebenwirkung.
ru: OTHER: Он, также отпугивает и красивых девушек, но|это так, побочный эффект.

source: HERO: Ale ten ...czosnek...
de: HERO: Aber dieser... Knoblauch...
ru: HERO: Но этот... чеснок...

source: OTHER: Wiem, wiem, teraz się nie uprawia. Dziwne.
de: OTHER: Ich weiß schon, er wird nicht mehr|angebaut. Versteh' ich nicht.
ru: OTHER: Я знаю, его больше не продают. Не понимаю.

source: OTHER: Chciałem zamówić wieprzowinę duszoną|z czosnkiem, ale barman tylko|bezradnie rozłożył ręce.
de: OTHER: Ich wollte gedämpftes Schweinefleisch|mit Knoblauch bestellen, doch der Wirt|breitete nur ratlos die Hände aus.
ru: OTHER: Я хотел заказать мясо с чесноком, а его|не оказалось.

source: OTHER: Myślałem jednak o pewnym rozwiązaniu...
de: OTHER: Aber ich glaube, ich habe da eine Idee...
ru: OTHER: Да, но у меня есть идея...

source: HERO: Założę się, że zaraz znowu zostanę|zaczarowany...
de: HERO: Ich wette, daß ich gleich wieder|verzaubert werde...
ru: HERO: Кажется, можно поколдовать...

source: OTHER: Nie mylisz się, chłopcze!
de: OTHER: Du irrst dich keineswegs, mein Junge!
ru: OTHER: Ты не ошибаешься, мой друг!

source: OTHER: Przywołam cię za kilkanaście minut, a ty|tymczasem przyjrzyj się innemu światu!
de: OTHER: Ich rufe dich in einigen Minuten zurück|und du kannst dir inzwischen|eine andere Welt anschauen!
ru: OTHER: Я скоро тебя позову, а ты пока можешь осмотреться...

source: HERO: Dlaczego trwało to tak długo?!...
de: HERO: Warum hat das so lange gedauert?!...
ru: HERO: Почему так долго?

source: HERO: Mało nie przypłaciłem życiem twojej|opieszałości!
de: HERO: Ich hätte beinahe wegen deiner Trödelei|das Leben verloren!
ru: HERO: Я чуть не расстался с жизнью!

source: OTHER: Przy kuflu czas szybko mija...
de: OTHER: Beim Bier verläuft die Zeit eben schnell...
ru: OTHER: За пивом так незаметно летит время...

source: OTHER: Lepiej powiedz, jak było?
de: OTHER: Erzähl lieber, wie war's?
ru: OTHER: Расскажи, как, получилось?

source: HERO: Jak tylko to sobie poukładam w głowie.
de: HERO: Wenn ich mir das so durch den Kopf|gehen lasse...
ru: HERO: Как только я забыл...

source: HERO: Widziałem tak dziwne rzeczy, że|wszystko wydaje mi się bardziej|snem niż jawą.
de: HERO: ... dann habe ich so eigenartige Sachen|gesehen, daß mir nun alles wie ein Traum|erscheint.
ru: HERO: ... я такое видел... что только во сне приснится!

source: OTHER: No to może kufelek?
de: OTHER: Dann vielleicht einen Krug Bier?
ru: OTHER: Кружку пива?

source: HERO: Nie mogę, muszę ratować nieznajomą.
de: HERO: Ich kann nicht, ich muß eine Unbekannte|retten.
ru: HERO: Не могу, мне надо одного человека спасти.

source: P#HERO: Ha! Ratuję kogoś!
de: P#HERO: Ha! Ich rette jemanden!
ru: P#HERO: Ха! Я кого угодно спасу!

source: HERO: Właśnie to sobie uświadomiłem!
de: HERO: Das ist mir gerade klar geworden!
ru: HERO: Это мне понятно!

source: HERO: Zostanę bohaterem!
de: HERO: Ich werde zum Helden!
ru: HERO: Я буду героем!

source: HERO: Będą o mnie śpiewać pieśni i układać poematy.
de: HERO: Lieder werden über mich gesungen werden|und Gedichte geschrieben.
ru: HERO: Обо мне будут петь песни и рассказывать|сказки.

source: HERO: A tłum będzie sypał płatki róż pod moje stopy!
de: HERO: Und das Volk wird mir Rosenblätter|vor die Füße werfen!
ru: HERO: И люди будут бросать мне розы под ноги...

source: HERO: Yes!
de: HERO: Jawohl!
ru: HERO: Конечно!

source: OTHER: O-ho!
ru: OTHER: О-хо!

source: OTHER: Znowu mamy problem.
de: OTHER: Wir haben wieder ein Problem.
ru: OTHER: У нас проблемы.

source: OTHER: Chętnie posłucham, tylko mów|szybko i krótko.
de: OTHER: Ich höre dir wie immer gerne zu,|aber fasse dich kurz.
ru: OTHER: Я слушаю, только короче.

source: HERO: Smok.
de: HERO: Den Drachen.
ru: HERO: Дракон.

source: HERO: Pokonać.
de: HERO: Besiegen.
ru: HERO: Победить.

source: HERO: Pomoc.
de: HERO: Hilfe.
ru: HERO: Помощь.

source: HERO: Teraz.
de: HERO: Sofort.
ru: HERO: Сейчас.

source: P#HERO: Koniec.
de: P#HERO: Ende.
ru: P#HERO: Конец.

source: P#OTHER: No dobra.
de: P#OTHER: Na gut.
ru: P#OTHER: Ладно.

source: OTHER: Koniec lenistwa.
de: OTHER: Genug gefaulenzt.
ru: OTHER: Хватит лениться.

source: OTHER: Czas ruszać w drogę!
de: OTHER: Es ist an der Zeit, aufzubrechen!
ru: OTHER: Время разойтись!

source: HERO: Naprawdę?
de: HERO: Echt?
ru: HERO: Правда?

source: HERO: Zabijesz za mnie smoka?
de: HERO: Wirst du anstatt meiner den Drachen töten?
ru: HERO: Ты убьешь дракона вместо меня?

source: HERO: To cudo...
de: HERO: Ein Wunder...
ru: HERO: Чудо.

source: OTHER: Spokojnie, spokojnie.
de: OTHER: Immer mit der Ruhe...
ru: OTHER: Всегда надо быть спокойным.

source: OTHER: Zaraz znajdziemy się w najcudowniejszym|miejscu na świecie.
de: OTHER: Zunächst wollen wir einen der schönsten|Orte dieser Welt besuchen.
ru: OTHER: Скоро мы увидим самое красивое зрелище этого|мира.

source: OTHER: W przewspaniałej, przeogromnej Silmanionie!
de: OTHER: Das herrliche Silmanion!
ru: OTHER: Прекрасный Сильманион!

source: HERO: Co właściwie jest w Silmanionie?
de: HERO: Was gibt es eigentlich in Silmanion?
ru: HERO: Что в нем такого?

source: OTHER: Kolebka wiedzy. Miejsce studiów największych|magów. Największa biblioteka świata.
de: OTHER: Dort ist die Wiege der Wissenschaft. Es ist|der Studienort der bedeutendsten Zauberer|und hat die bedeutendste Bibliothek der Welt.
ru: OTHER: В нем - сущность знания. Он - место обучения|всех волшебников. Там - самая большая библиотека|в мире.

source: OTHER: No cóż.
de: OTHER: Na ja.
ru: OTHER: Ну да.

source: OTHER: Latka lecą.
de: OTHER: Die Jahre vergehen.
ru: OTHER: Годы проходят.

source: OTHER: Na szczycie jednej ze ścian jest chyba księga,|której potrzebujemy.
de: OTHER: Aber dort oben, auf dieser Mauer,|das ist wohl das Buch,|das wir brauchen.
ru: OTHER: Но там наверху, за этими стенами,|та книга, что нам нужна.

source: OTHER: Musi zawierać potężne czary, skoro nie skruszył|jej ząb czasu.
de: OTHER: Es muß riesige Zauberkräfte|besitzen, da der Zahn der Zeit|nicht daran gerüttelt hat.
ru: OTHER: В ней должно бытъ сильное колдунство, ибо время|не имеет власти над ней.

source: OTHER: Znalazłem coś całkiem użytecznego.
de: OTHER: Ich glaube hier haben wir etwas|ganz Nützliches.
ru: OTHER: О, вот что-то полезное.

source: OTHER: Czar nazywa się "Moc Trolla", to ci powinno|pomóc.
de: OTHER: Der Zauber heißt "Trollenkraft" und das sollte|dir wohl helfen können.
ru: OTHER: Волшебство "Сила тролля" и оно тебе поможет.

source: OTHER: Jak tylko wypowiesz "Yukkakoppamakki",|staniesz się na sekundę silny jak troll!
de: OTHER: Sobald du "Yukkakoppamakki" sagst,|wirst du so stark wie ein Troll!
ru: OTHER: Как только ты произнесешь "Юкакомпамаки",|ты станешь сильным как тролль!

source: OTHER: O właśnie.
de: OTHER: Genau.
ru: OTHER: Правильно.

source: OTHER: Chyba domyślasz się, co wtedy trzeba|zrobić...
de: OTHER: Du weißt jetzt, was du zu tun|hast?
ru: OTHER: Понял, что надо делать?

source: HERO: Yukkakopp?...
ru: HERO: Юкакопф?

source: OTHER: Sza! Nie marnuj czaru na byle okazję!
de: OTHER: Pscht!! Verschwende den Zauber|nicht ohne Grund!
ru: OTHER: ШШ! Не беспокой магию без надобности!

source: HERO: Jest tak zafascynowany lekturą,|że żal przerywać.
de: HERO: Es wäre schade, ihn zu stören,|er ist so sehr von der Lektüre entzückt.
ru: HERO: Нельзя зря отвлекать, он так поглощен|лекцией...

source: HERO: Było nie było, nie miał książki|w ręku od tysiąca lat.
de: HERO: Tja, seit tausend Jahren hat er kein Buch|mehr in der Hand gehabt.
ru: HERO: Ха. У него не было других книг уже тысячу|лет!

source: HERO: Widziałeś to śmierdzące bajoro niedaleko?
de: HERO: Hast du den stinkenden Sumpf in der|Nähe bemerkt?
ru: HERO: Ты заметил что-то воняет неподалеку?

source: OTHER: Zapaszek dolatuje aż tutaj.
de: OTHER: Der Gestank dringt sogar bis hierher.
ru: OTHER: Даже сюда доходит.

source: OTHER: Być może ktoś tu przeprowadzał eksperymenty|z magicznymi środkami chemiczno-bojowymi.
de: OTHER: Vermutlich hat man hier Experimente|mit magischen Kampfgasen durchgeführt.
ru: OTHER: Кажется, кто-то экспериментировал с|магическими боевыми газами.

source: OTHER: Nieudane eksperymenty, dodajmy.
de: OTHER: Doch wie es scheint, sind die Experimente|schiefgegangen.
ru: OTHER: Но, похоже, эксперименты не удались.

source: OTHER: Chyba że ktoś umyślnie chciał zniszczyć|Silmanionę...
de: OTHER: Es sei denn, daß jemand Silmanion absichtlich|zerstören wollte...
ru: OTHER: Кто-то, кажется, хотел уничтожить Силманион. ..

source: OTHER: Po opowiedzeniu całej historii...
de: OTHER: Nachdem die ganze Geschichte erzählt worden war...
ru: OTHER: Когда вся история была рассказана...

source: OTHER: No, no...
de: OTHER: Na, na...
ru: OTHER: На, на...

source: OTHER: Zdaje się, że pomóc ci może tylko|jeden czło... Hm, demon.
de: OTHER: Ich glaube, da kann dir nur|ein Men... Hm, Dämon helfen.
ru: OTHER: Мне кажется, только один человек...|точнее демон, может тебе помочь.

source: OTHER: A nawet demon nad demonami.
de: OTHER: Ja, nur der Dämon der Dämonen!
ru: OTHER: Да, только демон из демонов!

source: OTHER: W skrócie: szef Piekła.
de: OTHER: Kurz gefaßt: der Chef der Hölle.
ru: OTHER: Короче говоря: владыка ада.

source: OTHER: Lucyfer.
de: OTHER: Luzifer persönlich.
ru: OTHER: Лично Люцифер.

source: P#OTHER: No, no...
de: P#OTHER: Ja, ja.
ru: P#OTHER: Оа, да.

source: OTHER: Dostać się do Piekła to nie taka|prosta sprawa.
de: OTHER: In die Hölle zu gelangen,|ist gar keine so einfache Sache.
ru: OTHER: Но не так то просто попасть|в ад.

source: OTHER: Ja tam, na przykład, nigdy nie|byłem.
de: OTHER: Ich zum Beispiel, war noch nie da.
ru: OTHER: Я, например, там еще не был.

source: OTHER: A byłem w naprawdę wielu|miejscach.
de: OTHER: Und ich war wirklich schon|an vielen Orten.
ru: OTHER: А я бывал в разных местах.

source: HERO: Do Piekła?!
de: HERO: In die Hölle?!
ru: HERO: В ад?

source: HERO: Chyba gorzej już nie mogło być...
de: HERO: Oh weh, schlimmer könnte es glaube ich|gar nicht mehr kommen...
ru: HERO: О, больно...Хуже уже быть не может...

source: OTHER: Wierz mi: mogło.
de: OTHER: Glaube mir: es könnte.
ru: OTHER: Поверь: может!

source: HERO: Sam sobie nie poradzę!
de: HERO: Ich weiß mir selbst nicht|mehr zu helfen!
ru: HERO: Я сам не знаю, как можно помочь!

source: HERO: Pomo...
de: HERO: Hilf du mir...
ru: HERO: Помоги...

source: OTHER: Powtarzasz się. Bądź mężczyzną|i weź się w garść.
de: OTHER: Du wiederholst dich. Sei ein Mann und nimm dich zusammen.
ru: OTHER: Ты повторяешься. Соберись, будь мужчиной!

source: OTHER: Jak nie będziesz skomlał tylko działał,|to na pewno sobie poradzisz.
de: OTHER: Wenn du hier nicht rumnörgeln sondern|lieber handeln würdest, dann wüßtest du|dir schon zu helfen.
ru: OTHER: Если ты не будешь паниковать, ты сам поймешь,|что делать.

source: OTHER: Słuchaj, siedzi przed tobą ktoś,|kto przez tysiąc lat był martwy!
de: OTHER: Hör mal zu, vor dir sitzt jemand,|der tausend Jahre lang tot war!
ru: OTHER: Слушай, перед тобой сидит тот, кто|был мертв тысячу лет!

source: OTHER: Więc cuda się zdarzają, to może|i tobie się uda ukończyć grę|bez zerkania do rozwiązania.
de: OTHER: Wunder geschehen, also gelingt es vielleicht|auch dir ohne Umschweife dieses Spiel|zu beenden.
ru: OTHER: Чудеса бывают, так что не паникуй, все еще может|обойтись.

source: OTHER: Mój drogi, porozmawiamy później.
de: OTHER: Mein Teuerster, wir sprechen uns später noch.
ru: OTHER: Ладно, поговорим позже.

source: OTHER: Kiedy mam wybierać pomiędzy delektowaniem|się zimnym piwem, a uroczą konwersacją|z tobą, to zapewne wiesz, co wybieram?
de: OTHER: Wenn ich die Wahl hätte zwischen einem kühlen|Bier und einer Unterhaltung mit dir, mein Freund,|was meinst du wohl, für was ich mich entscheiden|würde? Na?
ru: OTHER: Как ты думаешь, мой друг, если бы мне пришлось|выбирать между холодным пивом и разговором с тобой,|что бы я выбрал? а?

source: OTHER: Zgoda?
de: OTHER: Hab' ich mich klar genug ausgedrückt?
ru: OTHER: Я четко выражаюсь?

source: P#HERO: <westchnienie>
de: P#HERO: Ehhhm.
ru: P#HERO: Ухмм...

source: HERO: Zgoda.
de: HERO: Ja, schon gut.
ru: HERO: Ладно, пока...

source: HERO: Ale jak będę miał coś naprawdę ważnego...
de: HERO: Aber wenn ich etwas wirklich|Interessantes für dich hätte?
ru: HERO: Но если у меня есть кое-что для|тебя интересное?

source: OTHER: To wal jak w dym.
de: OTHER: Dann leg los.
ru: OTHER: Тогда выкладывай.

source: HERO: Mam nadzieję, że teraz porozmawiamy|sobie dłużej.
de: HERO: Hoffentlich können wir jetzt länger|miteinander sprechen.
ru: HERO: Теперь мы можем поговорить подробнее.

source: HERO: To tak się traktuje wybawcę i bohatera!?
de: HERO: Wird so ein Held und Retter behandelt?
ru: HERO: Разве герои и рыцари так себя ведут?

source: HERO: Nie ma sprawiedliwości, miłości i pokoju|na tym okrutnym, okrutnym świecie.
de: HERO: Es gibt keine Liebe und keine Gerechtigkeit|in dieser undankbaren Welt.
ru: HERO: Не бывает любви и справедливости в этом грустном|мире.

source: HERO: Przypatrz się dobrze...
de: HERO: Hier, schau sie dir gut an...
ru: HERO: Вот, посмотри сам...

source: HERO: Jako wizjoner powinieneś wiedzieć, gdzie obecnie|znajduje się istota o takiej właśnie łusce.
de: HERO: Als Seher solltest du wissen, wo sich im Moment|ein Wesen mit solchen Schuppen aufhält.
ru: HERO: Как наблюдатель ты должен знать, что надо делать...

source: OTHER: O nie...
de: OTHER: Oh nein...
ru: OTHER: О нет...

source: OTHER: To nie tak...
de: OTHER: So funktioniert das nicht...
ru: OTHER: Так не пойдет...

source: OTHER: Potrafię odnajdywać rzeczy, ale muszę|wiedzieć, jak wyglądają.
de: OTHER: Ich kann wohl Dinge auffinden, doch ich|muß zuvor wissen, wonach ich suche.
ru: OTHER: Я могу многое найти, но мне надо знать чего|искать.

source: OTHER: Owszem, do uzyskania wizji potrzebna jest|jakaś rzecz...
de: OTHER: Freilich, um eine Vision zu erlangen,|ist schon ein Gegenstand notwendig...
ru: OTHER: Чтобы получить видение, необходимо одно|условие...

source: OTHER: ...rzecz...
de: OTHER: ...des Gegenstandes...
ru: OTHER: ...условие...

source: OTHER: ...eee...
de: OTHER: ...eh...
ru: OTHER: ... э...

source: HERO: Obiektu?
de: HERO: Des gesuchten Objektes?
ru: HERO: Искомый предмет?

source: OTHER: ...obiektu, ale tylko jako pomoc.
de: OTHER: ...Genau, ein Gegenstand des Objektes.|Aber dieser ist nur eine Hilfe.
ru: OTHER: ... Точно, состояние объекта. Но это только|для помощи.
