Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: wejście - Rzeźba przy wejściu mówi mi wszystko.
de: Eingang - Die Skulptur am Eingang|sagt alles.
ru: Вход - Скульптура у входа говорит сама| за себя.

source: brama zamkowa - Nadal sporo tu cienia.
de: Schloßtor - Es gibt hier immer noch|sehr viel Schatten.
ru: Ворота - Тут еще много чего есть...

source: kościotrup - W słońcu wygląda równie przerażająco, co w mroku.
de: Skelett - In der Sonne sieht es genauso|erschreckend aus wie in der|Dunkelheit.
ru: Скелет - На свету он не менее страшен,| чем в темноте.

source: wejście - Wejście do komnaty nekromanty.
de: Eingang - Eingang in die Kammer|des Nekromanten.
ru: Вход - Вход в комнату некроманта.

source: klucz - Wszyscy w okolicy mają jakąś obsesję na punkcie|olbrzymich kluczy.+Jakaś rekompensata czy co?
de: Schlüssel - Hier in der Gegend|scheinen alle auf riesige Schlüssel|versessen zu sein.+Ist das irgendeine Art von|Ersatzbefriedigung, oder was?
ru: Ключ - Похоже, что здесь вся округа под| замком.

source: szafa - Mnóstwo pomocy naukowych nekromanty.+Zupełnie jak u alchemika, tylko trochę|bardziej podniszczone.
de: Schrank - Eine Menge wissenschaftlicher|Hilfsmittel des Nekromanten.+Genauso wie beim Alchimisten,|nur sind sie stärker abgenutzt.
ru: Шкаф - Тут все маньяки запираться...

source: kielich - Nie dość, że wino czerwone jak krew, to|jeszcze kielich zgnieciony potężną siłą.+Co tu się działo?!
de: Kelch - Nicht nur, daß der Wein rot wie|Blut ist ... auch wurde der Kelch von|einer riesigen Kraft zerdrückt...+Was ist hier nur geschehen?!
ru: Сосуд. - Не то что бы очень уж это вино| напоминало кровь, но как-то| подозрительно оно выглядит...

source: pergamin - To chyba jakieś motto...+"Jeśli zbyt długo patrzysz w otchłań,|otchłań zaczyna patrzeć w ciebie".
de: Pergament - Das ist wohl irgendein Spruch...+"Wenn du zu lange in den Abgrund schaust,|beginnt der Abgrund dich anzuschauen."
ru: Пергамент. - Он полон записей...

source: kartka - To pewnie jakaś ważna czarnoksięska uwaga,|albo zapis bluźnierczego czaru...+Nie, zaraz...+To jakaś lista...+"Kupić mleko... Posprzątać po Zraleimchu....|Pomodlić się do potężnego Kecaja Arakeipa|jeszcze przed śniadaniem...."+"Załatwić dostawę bułeczek..."+Och...
de: Zettel - Das ist sicher eine wichtige|Notiz des Schwarzmagiers|oder ein lästerlicher Zauber...+Nein, Moment mal...+Es ist eine Liste...+"Milch kaufen, Gelierzucker,|noch vor dem Frühstück zum|mächtigen Kecaj Arakeip beten..."+"Brötchen abliefern..."+Tja...
ru: Листок - Это, наверное, важная запись черного| мага.

source: kartka - Kahem, nic ważnego.
de: Zettel - Ähem, nichts Wichtiges.
ru: Листок - Ничего особенного.

source: papiery - Pamiętnik nekromanty...*+Wynika z niego, że to właśnie on pomagał Księciu|Wampirów zabezpieczyć jakąś część zamku przed|wzrokiem śmiertelników...+Czyżby chodziło o wieczną noc na dziedzińcu?|Nie... O tym jest w innym miejscu pamiętnika:+"...będzie tu panować noc tak ciemna, jak ciemne|są myśli tego, co potęgę swą znalazł w czeluściach|najgłębszych otchłani".+Hmm, co za styl!+"Nigdy parzące promienie słońca nie oświetlą tego|zamku, tak jak nigdy dusza mroczna nie zazna|świetlistej tortury, wolna od jasności, która by..."+Ufff!+"Pan Słońce (niech będzie przeklęte jego imię, niech|jego ciało spotka wieczna tortura wśród lodowych|pustkowi wiecznej nocy!) nie zagości nad zamkiem Fjord..."+"...który pozostanie wolny od plugawego dotyku światła|na wieki wieków i po wsze czasy. A oprócz tego..."*+Hmmm... Niestety, brakuje ostatniej, najnowszej|strony.
de: Papiere - Tagebuch des Nekromanten...*+Daraus ist zu entnehmen, daß er dem Fürsten|der Vampire hilft, einen Teil des Schlosses|vor den Blicken der Sterblichen zu verbergen...+Geht es etwa um die ewige Nacht|auf dem Schloßhof? Nein... Davon ist|an einer anderen Stelle im Tagebuch die Rede:+"...hier wird eine so finstere Nacht herrschen,|so finster wie die Gedanken desjenigen, der seine|Stärke in den Schlünden der tiefsten Abgründe fand."+Hmm, was für ein Stil!+"Nie werden die sengenden Strahlen der Sonne|dieses Schloß erleuchten, nie wird die dunkle|Seele die hellen Foltern erleben können,|frei in der Helligkeit, welche..."+Ufff!+"Der Sonnenfürst (möge sein Name verflucht sein,|möge sein Körper unter den ewigen Foltern der|eisigen Einöde leiden) wird nimmer mehr über Fjord|aufgehen..."+"...der für ewige Zeiten bar sein wird jeder|schändlichen Berührung der äußeren Welt.|Und außerdem..."*+Hmmm... Leider fehlt die letzte Seite.
ru: Бумаги - Дневник некроманта

source: papiery - Pamiętnik nekromanty...+Nic nowego się już z niego nie dowiem.
de: Papiere - Tagebuch des Nekromanten...+Ich werde daraus nichts Neues|mehr erfahren.
ru: Бумаги - Дневник некроманта

source: peleryna - Czerwona pelerynka...+Płachta na rogate demony?
de: Umhang - Roter Umhang...+Das rote Tuch für gehörnte Dämonen?
ru: Плащ - Красплащ. .

source: stołek - Najwyraźniej przewrócony w trakcie jakiejś|brutalnej walki.
de: Stuhl - Höchstwahrscheinlich wurde er|bei einem brutalen Kampf umgeworfen.
ru: Стул - Кажется, он опрокинут в страшной| борьбе...

source: świecznik - Cały czarny. Ani chybi atrybut nekromanty.
de: Kerzenleuchter - Er ist völlig schwarz. Sicher gehört|er zum Zubehör des Nekromanten.
ru: Подсвечник - Он черный и явно принадлежит некроманту.

source: ślady pazurów - Za żadne skarby świata nie chciałbym stanąć oko|w oko z istotą posiadającą takie szpony.
de: Krallen-Spuren - Um keinen Preis der Welt möchte ich|dem Wesen Auge in Auge gegenüberstehen,|das solche Krallen hat.
ru: Когти. - Я бы никогда не хотел встретиться| с обладателем этого....

source: pentagram - Przerażający znak. Wygląda na|niedokończony albo zatarty.
de: Pentagramm - Erschreckendes Zeichen.|Es sieht unfertig oder verwischt aus.
ru: Пентаграмма. - страшный символ.

source: drzwi - To chyba ślady włamania. Chyba że komuś|się bardzo spieszyło...
de: Tür - Das sind wohl die Spuren eines Einbruches.|Es sei denn, daß jemand in Eile war...
ru: Дверь. - На ней следы взлома.

source: ślady krwi - Mam dziwną pewność, że nie są to ślady|po rozlanym, czerwonym winie.
de: Blutspuren - Ich bin irgendwie sicher, daß diese|Spuren nicht von verschüttetem|Rotwein herstammen.
ru: Следы крови - Я уверен, что они тут не случайно...

source: kreda - Ta sama, którą wyrysowano pentagram.
de: Kreide - Dieselbe, mit der das Pentagramm|gezeichnet wurde.
ru: Мел - Тот, чем рисовали пентаграмму.

source: wyjście - Drzwi stoją szeroko otworem.+Bardzo szeroko.
de: Ausgang - Die Tür ist weit geöffnet.+Sehr weit.
ru: Выход. - Дверь распахнута

source: kominek - W środku są tylko zwęglone resztki.
de: Kamin - Darin sind bloß verkohlte Reste.
ru: Камин - Там какие-то остатки.

source: pogrzebacz - Tu chyba nie potrzeba pogrzebacza, ale|pogrzebu...
de: Schürhaken - Sieht aus wie ein Schürhaken.
ru: кочерга - Тут не кочерга нужна, а|лопата...

source: skrzynia - Stara lina, wyszczerbiony miecz, skrzynka|z dziurą...+Trofea?...
de: Kiste - Ein altes Seil, ein schartiges Schwert,|eine Kiste mit einem Loch...+Vielleicht Trophäen?...
ru: Сундук.. - Старая верёвка, выщербленный меч, шкатулка|с дыркой...+Трофеи?...

source: księga - "Księga Szarej Magii"
de: Buch - "Buch der Grauen Magie."
ru: Книга - "Книга серой магии"

source: talizman - To chyba talizman nekromanty. Mam wrażenie, że|nie przyniósł mu szczęścia...
de: Amulett - Das ist wohl das Amulett des Nekromanten.|Ich habe den Eindruck, daß es ihm kein|Glück gebracht hat...
ru: Амулет - Это - амулет некроманта. Я уверен,| что счастья он не приносит.

source: wyjście - Powrót do głównej części zamku.
de: Ausgang - Rückkehr zum Hauptteil des Schlosses.
ru: Выход. - Назад в главную часть замка

source: Książę Wampirów - W jego pobliżu boję się nawet mrugnąć, żeby|mnie nie usłyszał.
de: Fürst der Vampire - In seiner Nähe habe ich sogar Angst|mit den Augen zu zwinkern, damit|er mich nicht hört.
ru: Лорд вампиров - Рядом с ним я даже моргать боюсь,| чтобы он меня не услышал.

source: trumna - Atłasowe wnętrze, okuta srebrem,|gustowna trupia czaszka...+Trumna de luxe.+Lepiej się nie zbliżać.
de: Sarg - Mit Samt ausgeschlagen,|ein mit Silber beschlagener|geschmackvoller Totenkopf...+Sarg de luxe.+Lieber nicht näherkommen.
ru: Саркофаг - Очень дорогая и красиво украшенная| вещь.

source: trumna - Zaraz, coś tu w środku leży...|Jakaś kartka...
de: Sarg - Moment mal, da liegt etwas...|Ein Zettel...
ru: Саркофаг - Стоп, там что-то лежит... Какой-то| листок...

source: trumna - Teraz przynajmniej spełnia właściwą rolę.
de: Sarg - Nun wird er entsprechend|seiner Funktion verwendet.
ru: Саркофаг - Наконец-то его используют по назначению.

source: kamienna płyta - Wielka, kamienna płyta z jakimiś|dziwnymi wypustkami.
de: Steinplatte - Riesige Steinplatte|mit seltsamen Rändern.
ru: Каменная пластинка - Огромная плита со странным узором.

source: przepaść - Wydaje mi się, że nie dałbym rady spaść|żywy. W locie umarłbym z głodu.
de: Abgrund - Ich glaube, ich sterbe während|des Fluges. Auf dem Weg nach|unten würde ich verhungern.
ru: Пропасть - Я думаю, что, упав туда, я помру| с голоду раньше, чем упаду| на дно...

source: Pan Słońce - Wygląda na znudzonego nawet jak śpi.
de: Sonnenfürst - Er sieht gelangweilt aus,|selbst wenn er schläft.
ru: Солнечник - Он выглядит очень мирно. Особенно| когда спит.

source: nałożnica - Eeech, ładna.
de: Haremsdame - Sehr hübsch.
ru: Наложница - Очень симпатично.

source: nałożnica - Ech, jak już się to wszystko uspokoi...
de: Konkubine - Hmm, wenn sich alles|beruhigt hat...
ru: Конкубина - Гм... Когда все успокоится...

source: wodospad - Panu Słońce pewnie się dobrze zasypia|przy jego delikatnym szumie.
de: Wasserfall - Der Sonnenfürst schläft|sanft ein, beim leisen Rauschen|des Wasserfalls .
ru: Водопад - Солнечник спит в шуме водопада.

source: rzeczka - Ciekawe, dokąd uchodzi woda|z takiej wysokości...
de: Kleiner Fluß - Interessant, wo das Wasser|ankommt, das von so einer Höhe|herunterfällt...
ru: Маленькая речка - Интересно, откуда тут вообще вода?

source: kosz z owocami - Kosz pełen słodkich, soczystych owoców.
de: Korb mit Obst - Ein Korb voll mit süßem,|saftigem Obst.
ru: Корзина с фруктами - Корзина, наполненная сладкими| фруктами.

source: instrukcja obsługi - Jakieś hieroglify.
de: Anweisung - Irgendwelche Hieroglyphen.
ru: Табличка - Какие-то иероглифы.

source: wyjście - Powrót na ziemię.
de: Ausgang - Rückkehr auf die Erde.
ru: Выход. - Путь на землю.

source: ścieżka - Piękna okolica...
de: Pfad - Wunderschöne Umgebung...
ru: Деревья - Прекрасная обстановка...

source: bajoro - Dziwna, zielonkawa maź.
de: Sumpf - Seltsamer, grünlicher Matsch.
ru: Болото - Одинокое, зеленое болотце...

source: uschłe drzewo - Zdaje się, że substancja w bajorze nie służy|tutejszej roślinności.
de: Abgestorbener Baum - Wahrscheinlich wirkt sich|der widerliche Matsch nicht gut|auf die hiesige Pflanzenwelt aus.
ru: Полумертвое дерево - Похоже, что болото не очень благотворно| влияет на растения.

source: ptak - Jedyny świadek rozkładu dawnego|centrum intelektualnego.+A może ...strażnik?
de: Vogel - Der einzige Zeuge des Verfalls|eines ehemaligen intellektuellen|Zentrums.+Oder vielleicht ...ein Wächter?
ru: Птица - Единственный след от некогда образованных| людей

source: księga - Wygląda na zupełnie nieruszoną zębem czasu|ni dziobem tego ptaszyska.
de: Buch - Es sieht so aus, als hätte weder|der Raubvogel mit seinem Schnabel|noch die Zeit daran genagt.
ru: Книга - Это так выглядит, будто тут поработал| дятел.

source: ścieżka - W oddali widać kilka uschniętych drzew.
de: Pfad - In der Ferne sieht man|einige ausgetrocknete Bäume.|Hmm. Waldsterben?
ru: Деревья - Вдали можно увидеть сухие деревья...| Странно, что за эпидемия?

source: pożółkły pergamin - Czas i deszcz zrobiły swoje.+Widzę tylko pojedyncze znaki i nie mogę|zrozumieć treści.
de: Vergilbtes Pergament - Zeit und Regen haben ihre|Spuren hinterlassen.+Ich sehe nur einzelne Zeichen|aber kann den Inhalt nicht verstehen.
ru: Старый пергамент - Дождь и солнце совсем иссушили| его...

source: strona z książki - Widzę tytuł jakiegoś rozdziału...+"Ciepła posadka, czyli palenie czarownic".*+Hm, ciekawe czy mieli tu też słynne dzieło:|"Jak rzucić palenie czarownic w tydzień".
de: Buchseite - Hmm, nur eine Kapitelüberschrift...+"Gegenfinanzierung leicht gemacht"*+Hmm, das war sicher ein sehr weises|Buch und zum Wohle der Menschheit.
ru: Страница из книги - Гм... Только заголовок...

source: resztki bramy - Mam nieodparte wrażenie, że przestała spełniać|swoją pierwotną rolę.+W przypadku tego gruzowiska pojęcie wyjścia|jest naprawdę szerokie.
de: Torreste - Ich habe den Eindruck, daß das|Tor seine grundsätzliche Funktion|verloren hat.+Ein Zeichen der Vergänglichkeit...|Sehr romantischer Flecken...
ru: Остатки ворот - Мне кажется, что эти ворота сейчас| потеряли свое значение.

source: stos kamieni - Kupa drobnych kamyczków. Dowód zwycięstwa|materii nad duchem.
de: Steinhaufen - Ein Haufen kleiner Steinchen.|Ein Beweis für den Sieg der|Materie über den Geist.
ru: Куча камней - Демонстрация победы материи над| духом.

source: księga - "O skutecznym zdejmowaniu klątw".+Och...+Lepiej wcale niż późno.
de: Buch - "Wie flirtet Mann richtig?".+Hmm...+Merkwürdige Schreibweise...
ru: Книга - "Как правильно флиртовать?"

source: księga - "Czwarty wymiar".+Hmmm... Pewnie polityczna.
de: Buch - "Die Höhere Gewalt" von|Jorgus Trittinus.+Hmmm... Sicher was Politisches.
ru: Книга - "Высшая сила Йоргуса Триттина"

source: księga - Wygląda zachęcająco.
de: Buch - Sehr ermutigend.
ru: Книга - Очень подозрительно

source: Arivald - Mój chyba nieoceniony wybawca. On pewnie|nie ma co do tego wątpliwości.
de: Arivald - Das ist mein unschätzbarer|Retter. Daran kann es gar keinen|Zweifel geben.
ru: Аривальд - Это - мой спаситель. Не может| быть сомнения.

source: wejście - Ciemno jak w hebanowej rzyci.
de: Eingang - Dunkel wie eine Spalte|aus Ebenholz.
ru: Вход - Темно как у негра в ушах.

source: łagodny stok - Widać drogę do miasteczka.
de: Sanfter Abhang - Man sieht den Weg|zum Städtchen.
ru: Пологий склон - Видна дорога.

source: kastet - Git.
de: Schlagring - Sehr nützlich.
ru: Кольцо - Очень полезно.

source: dźwignia - Założę się, że to jakaś forma pułapki.
de: Hebel - Ich wette, daß das|eine Falle ist.
ru: Рычаг - Наверное, это - ловушка.

source: dźwignia - Odblokowana.+Niezła ze mnie złota rączka.+I to dosłownie.
de: Hebel - Entblockiert.+Ich habe ein gutes Händchen.+Ich bin unschlagbar...
ru: Рычаг - Разблокировано.

source: wyjście - Umpff...+Dlaczego nic w życiu, oprócz zdobywania|kobiet, nie przychodzi bez trudu?...
de: Ausgang - <Umpff...>+Warum fällt alles schwer,|bis auf die Liebe?...
ru: Выход. - <Умпф....>

source: wyjście - Wolny! Nareszcie!
de: Ausgang - Das wurde aber auch Zeit!
ru: Выход. - Сколько прошло времени!

source: olbrzymi szkielet - O rany! Kiedy ten wojownik żył, to pewnie|przyjacielskim klapsem potrafił zabić trolla.+Ten miecz waży chyba więcej niż cały ja.
de: Riesiges Skelett - Oh Gott! Als der Ritter noch lebte,|konnte er sicher mit einem einzigen|freundlichen Klaps einen Troll töten.+Das Schwert wiegt sicher mehr als ich.
ru: Большой скелет - О боже! Наверное, пока он был| еще жив, он мог тролля повалить| одним ударом!

source: tarcza - Dziwny herb: trójgłowy smok...+Chyba że to hydra mająca symbolizować|trwałość rodu.
de: Schild - Merkwürdiges Wappen:|Ein dreiköpfiger Drachen...+Oder eine Hydra, die den|Fortbestand der Sippe|symbolisieren soll.
ru: Щит. - Интересный герб - трехголовый| дракон.

source: wyjście - Cudowne, świeże powietrze bez siarki i dymu.
de: Ausgang - Wundervolle, frische Luft|ohne Rauch und Schwefel.
ru: Выход. - Наконец-то! Свежий воздух без| дыма.

source: zbroja - Opakowanie po jedzeniu powinno się wyrzucać|do śmieci, a nie na ziemię!
de: Rüstung - Die Verpackung sollte man|nach dem Essen in die Mülltonne|werfen und nicht auf den Boden!
ru: Обмундирование - Надо выбрасывать обертки в урну,| а не на пол!

source: czaszka - Dla kogoś taki czerep to było kiedyś|być albo nie być...
de: Totenkopf - So ein Kopf bedeutete früher für|manche Leute "Sein oder nicht Sein..."
ru: Мертвая голова - Раньше некоторые такие головы| наводили на размышления "быть,| или не быть?..."

source: żelazne obręcze - Niejedną parę przegubów już gościły.
de: Eisenketten - So mancher Ärmster war|hier schon gefangen.
ru: Железные прутья - Кто-то тут был заперт.

source: smok - Stwierdzam bez przekąsu, że widziałem|dziewice brzydsze od niego.
de: Drachen - Ich muß feststellen, daß ich|schon häßlichere Jungfrauen|gesehen habe.
ru: Дракон - Я должен заявить, что я видели| более симпатичных девушек...

source: dziewczyna - Łoł!...+Co my tu mamy...+Mocne, żelazne kajdany...+Piękna dziewczyna, całkowicie bezwolna.+Może by tak...
de: Mädchen - Wow!...+Was haben wir denn hier..+Stabile eiserne Handschellen...+Ein völlig wehrloses schönes|Mädchen...+...weckt nur die edelsten|Regungen in mir...
ru: Девушка - Вау!...

source: dziewczyna - Smaczny kąsek!
de: Mädchen - Verdammt süß!
ru: Девушка - Проклятье!Паутинтина+Заколдованные

source: pajęczyna - Obrzydliwa, zaczarowana pajęczyna.
de: Spinnengewebe - Scheußliches verzaubertes|Spinnengewebe.
ru: паутина - Отвратительная, заколдованная паутина.

source: skała - Wystający kawałek skały.
de: Fels - Hervorstehendes Felsstück.
ru: Скала - Высокая скала

source: droga - Szeroka i dobrze ubita, choć nierówna.
de: Weg - Breiter und gut festgetretener,|jedoch holpriger Weg.
ru: Дорога - Широкая и хорошая дорога.

source: pomost - Stąd pewnie wypływały barki z mąką.
de: Anlegebrücke - Eine Anlegestelle...|für alle möglichen Boote...
ru: Причал - Причал... для самых разных судов

source: podnośnik - Niestety, już nieczynny, a lina ucięta.+Mam nadzieję, że nie ma to nic wspólnego|ze zbankrutowanym młynarzem.
de: Hebekran - Leider ist er außer Betrieb|und das Seil hat jemand|abgeschnitten.+Hoffentlich hat das nichts mit|dem bankrotten Müller zu tun.
ru: Судно - Увы, оно развалилось и кто-то| спер парус.

source: beczka - Pusta jak kufel Arivalda po półtorej|sekundy.
de: Faß - So leer wie Arivalds Bierkrug|nach anderthalb Minuten.
ru: Бочка - Пуста как кружка Аривальда через| пол-минуты.

source: wejście - Czy to jakaś moda, czy w tej okolicy| wszyscy po prostu mocno pukają?
de: Eingang - Ist das eine neue Mode, oder klopfen|hier alle so stark an die Tür?
ru: Вход - Это такая мода, или тут все так| стучат в дверь?

source: młyńskie koło - Jeżeli będę się w nie wystarczająco mocno|i długo wpatrywał, na pewno ruszy.
de: Mühlrad - Wenn ich nur lange und intensiv genug|hinsehe, bringe ich es vielleicht in Bewegung.
ru: Жернов - Если я тут долго повожусь, может,| я его и сдвину.

source: wyjście - Polna dróżka.
de: Ausgang - Feldweg.
ru: Выход. - Тропинка

source: droga - Szeroko i dobrze ubita, choć nierówna.
de: Weg - Breit und festgetreten, aber uneben.
ru: Дорога - Широкая и мощеная, не неровная.

source: wejście - Pomyśleć, że z drugiej strony to już|jest coś dokładnie odwrotnego.
de: Eingang - Wenn man bedenkt, daß es von|der anderen Seite schon etwas|genau Umgekehrtes gibt.
ru: Вход - Когда человек предполагает, что| внутри, он всегда ошибается.

source: worki - Dziwne, młyn opuszczony, ale worki pełne|są mąki.
de: Säcke - Komisch, die Mühle ist verlassen,|obwohl die Säcke voller Mehl sind.
ru: Мешки - Интересно, мельница покинута,| а мешки полные.

source: szczelina - Interesujący otwór, ale trzeba uważać,|żeby nie wpaść.
de: Spalte - Ein interessantes Loch, aber|man muß aufpassen, daß man|nicht hineinfällt.
ru: Дыра - Очень красиво, но главное, в нее| не упасть.

source: mąka - Pełno w niej robactwa.+Kto chce placuszka?
de: Mehl - Es ist voller Maden.+Will jemand ein Stück Fladen?
ru: Мука - Очень мелкая

source: żarna - Nieco nadgryzione zębem czasu.
de: Handmühle - Der Zahn der Zeit hat|ein bißchen daran genagt.
ru: Ручная мельница - Время поработало над ней...

source: super tajny piksel - Brawo! Znalazłeś super tajny piksel!+Co prawda nic to zmienia w dalszym biegu|wydarzeń, ale wyrażamy nasz podziw dla|Twojej kontroli nad myszką.+Bo chyba nie zaciąłeś się w grze i nie|szukasz desperacko piksel po pikselu|jakiegoś obiektu, który może ominąłeś?...
de: Streng geheimer Pixel - Bravo! Du hast einen streng|geheimen Pixel gefunden!+Zugegeben ändert dies nichts am weiteren|Verlauf der Ereignisse!+Hey, Du bist doch wohl nicht darauf aus,|jeden kleinsten Pixel zu untersuchen?|
ru: Очень спрятанный пиксель - Браво! Ты нашел очень замаскированный| пиксель экрана!

source: dziewczyna - Lubię patrzeć, jak tak kręci|i potrząsa.
de: Mädchen - Ich schaue gerne zu, wenn sie so|mit dem Hintern wackelt...
ru: Девушка - Я с удовольствием посмотрю, если| ты постоишь на шухере...

source: linka - Aż sama zaprasza...
de: Seil - Es lädt förmlich dazu ein...
ru: Канат - Оно хорошо сюда подходит...

source: szczur - Szczur. Ratus maior czy może ratus minor?+Obojętne. I tak jest tylko małym owrzodzonym|paskudztwem roznoszącym zarazki dżumy.
de: Ratte - Ratte. Ratus major oder vielleicht|ratus minor?+Egal. Sie ist sowieso nur ein kleines,|widerliches Vieh voller Geschwüre und,|Pestbazillen.
ru: Крыска - Крыса. Ратус мажор, или ратус| минор?

source: wyjście - Z kolan na nogi.
de: Ausgang - Auf gehts!
ru: Выход. - Идет!

source: butelki - Puste jak głowa Sheili.
de: Flaschen - So leer wie der Kopf von Sheila.
ru: Бутылки - пусто, как в голове у Шейлы.

source: pajęczyna - Pajączek, pajączek bez nóżek i bez rączek.
de: Spinnennetz - Spinnelein, Spinnelein,|ohne Hände, ohne Bein.
ru: паутина - паучок, паучок без ручек и без ножек.

source: elegancka dama - Nigdy nie widziałem wcześniej tak wystrojonej|kobiety.+Pewnie to jakaś ważna osobistość, ciesząca się|wielkim szacunkiem.
de: Elegante Dame - Ich habe vorher noch nie eine|so herausgeputzte Frau gesehen.+Sicherlich ist sie eine wichtige|Persönlichkeit, die sich größter|Hochachtung erfreut.
ru: Элегантная дама - Я еще не видел такой накрашенной| женщины.

source: kupiec - Wygląda na bardzo miłego człowieka.
de: Händler - Er sieht wie ein sehr freundlicher|Mensch aus.
ru: Торговец - Он выглядит очень дружелюбно

source: drzwi - Te drzwi prowadzą do jakiegoś rodzaju świątyni.+Mam nadzieję, że nie składa się tu ofiar|z ludzi.
de: Tür - Diese Tür führt zu irgendeiner|Art von Tempel.+Hoffentlich bringt man hier keine|Menschenopfer dar.
ru: Дверь. - Эта дверь ведет во что-то типа| храма

source: stalowa maszkara - Wygląda tak, jakby była sterowana przez kogoś|od wewnątrz.+Ciekawe przez kogo? Może krasnoludy, bo człowiek|na pewno się w środku nie zmieści.
de: Stahlmonster - Sieht aus, als würde es von jemandem|von innen heraus dirigiert.+Aber von wem? Vielleicht von Zwergen,|denn Menschen haben darin sicherlich|nicht genug Platz.
ru: Стальной монстр - Похож на управляемую модель.

source: drzwi - To drzwi do jakiegoś publicznie dostępnego|budynku.
de: Tür - Das ist eine Tür zu einem öffentlich|zugänglichen Gebäude.
ru: Дверь. - Это просто дверь

source: skrzynka - Znak złotej trąbki niedwuznacznie wskazuje, że|nie mam pojęcia, do czego ta skrzynka może|służyć.
de: Kasten - Das Zeichen mit der goldenen Trompete|weist unzweideutig darauf hin, daß ich|keine Ahnung habe, wozu dieser Kasten|dienen könnte.
ru: Ящики - Судя по золотой окантовке, я не| сомневаюсь, для чего они могут| служить.

source: drzwi - Tutaj pewnie tubylcy składają ofiary|ze zwierząt.
de: Tür - Hier bringen die Einheimischen|sicherlich Tieropfer dar.
ru: Дверь. - Тут явно приносят в жертву животных.

source: drzwi - Widać znak węża owiniętego dookoła słupa.+To pewnie miejsce pracy jakiegoś tutejszego|czarnoksiężnika.
de: Tür - Man sieht das Zeichen einer Schlange,|die sich um einen Pfosten schlängelt.+Das ist bestimmt der Arbeitsplatz eines|hiesigen Schwarzmagiers.
ru: Дверь. - Это - рисунок змеи
