Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: OTHER: Daj znać, kiedy wreszcie zdecydujesz się|kupić coś innego niż miłosny wywar.#E4#X0
de: OTHER: Wenn Ihr euch entscheidet, etwas anderes|zu kaufen als einen Liebestrank, so laßt es|mich wissen.#E4#X0
ru: OTHER: Если вы решите купить что-либо кроме любовного|напитка, скажите.#E4#X0

source: OTHER: Ta księga, książę, jest starsza niż|to królestwo.
de: OTHER: Dieses Buch, Prinz,|ist älter als dieses Königreich.
ru: OTHER: Эта книга старше нашего|королевства.

source: OTHER: Jej strony są z wyprawionej ludzkiej skóry,|szpon demona służył autorowi za pióro,|a krew za inkaust.
de: OTHER: Seine Seiten sind aus gegerbter Schlangenhaut,|die Kralle eines Dämons diente dem Autor|als Feder und Blut diente ihm als Tinte.
ru: OTHER: Эти страницы сделаны из кожи, клык дракона служил|пером, а кровь - чернилами!

source: OTHER: Gdyby człowiek ośmielił się dotknąć jej|palcami spaliłaby mu rękę, a sama|rozsypała się w popiół.#B0
de: OTHER: Wenn ein Mensch es wagen würde,|das Buch mit den Fingern zu berühren,|dann würde seine Hand verbrennen|und es selbst zu Staub zerfallen.#B0
ru: OTHER: Если дотронуться до страниц, то|руга вспыхнет пламенем!#B0

source: HERO: Nie jest przypadkiem wbrew prawu czy coś?
de: HERO: Ist das nicht zufällig gegen geltendes Recht?
ru: HERO: Это разве не противозаконно?

source: OTHER: Ten "śmieszny człowieczek", mój chłopcze,|to homunkulus, potężna istota magiczna.
de: OTHER: Dieses "Menschlein", mein Junge,|ist ein Homunkulus, ein mächtiges|magisches Wesen.
ru: OTHER: Этот "человечек" - настоящий магический|гомункул!

source: OTHER: Kiedy wiesza się człowieka, u jego stóp|wyrasta korzeń mandragory. Z niego|pochodzi homunkulus.
de: OTHER: Wenn man einen Menschen aufhängt,|dann wächst an seinen Füßen die Wurzel|des Mandragorabaumes. Aus ihr stammt|der Homunkulus.
ru: OTHER: Когда вешают человека, у него в ногах|вырастает корень мандрагоры, из которого|делают гомункул.

source: OTHER: Trzymam go do swoich własnych celów.
de: OTHER: Ich halte ihn mir für meine persönlichen Zwecke.
ru: OTHER: Я его для своих целей держу.

source: HERO: Dlaczego on po prostu nie wyskoczy|ze słoja?
de: HERO: Warum springt er nicht einfach|aus dem Glas heraus?
ru: HERO: Почему он не выбирается из банки?

source: OTHER: Hii-hii...
de: OTHER: Hihihihi...
ru: OTHER: Хи-хи-хи.

source: OTHER: Cóż, nie grzeszy mądrością.
de: OTHER: Also mit Klugheit bist du|nicht gerade geschlagen.
ru: OTHER: Да, ума тебе не хватает.

source: OTHER: Słój jest pokryty od zewnątrz kurzem, ale|on myśli, że brud jest od wewnątrz.
de: OTHER: Das Glas ist von außen mit Staub bedeckt,|aber er denkt, daß der Schmutz innen ist.
ru: OTHER: Этот сосуд покрыт пылью снаружи, но он то|думает, что пыль внутри.

source: OTHER: No i próbuje przetrzeć sobie widok|od środka.
de: OTHER: Tja, und nun probiert er sich von innen|die Sicht freizuwischen.
ru: OTHER: И он все еще пытается протереть от нее глаза!

source: OTHER: Ma zajęcie na całe dnie, ha!
de: OTHER: Da hat er für einige Tage was zu tun, ha!
ru: OTHER: Это он уже много дней пробует!

source: OTHER: Kiedyś dałem mu kartkę pergaminu, na której|po jednej i po drugiej stronie był napis|ODWRÓĆ MNIE.
de: OTHER: Eines Tages habe ich ihm eine Pergamentrolle|gegeben, mit der beidseitigen Aufschrift:|DREH MICH UM.
ru: OTHER: Я ему тут на днях подсунул пергамент с надписью|на обеих сторонах "Переверни меня"

source: OTHER: Nie masz pojęcia ile dni bawił się|z nieustającym zapałem.#F1#E5#B0
de: OTHER: Ihr macht Euch keine Vorstellung, wieviel Tage er mit|mit unermüdlichem Eifer damit gespielt hat.#F1#E5#B0
ru: OTHER: Так вы себе не представляете, сколько дней он его вертел!#F1#E5#B0

source: OTHER: Tylko niczego nie dotykaj.#E3
de: OTHER: Rühr bloß nichts an.#E3
ru: OTHER: Не трогай его.#E3

source: OTHER: Znowu?... O nie...
de: OTHER: Nicht schon wieder...
ru: OTHER: До скорого...

source: OTHER: Powtarzałem ci tysiące razy, książę, że|żadna dziewczyna w tym królestwie i tak|ci nie odmówi.
de: OTHER: Ich habe Euch schon tausend Mal gesagt, Prinz,|daß kein Mädchen in diesem Königreich|Euch etwas abschlagen wird.
ru: OTHER: Я уже сто раз повторял, что ни одна девушка вам,|ни в чем не откажет!

source: OTHER: W końcu jesteś księciem, i to całkiem|niebrzydkim, jak na kogoś z tak fatalną|fryzurą.#B1
de: OTHER: Schließlich seid Ihr ein Prinz und|dazu ziemlich gutaussehend, für jemanden|mit einer so fatalen Frisur.#B1
ru: OTHER: Вы все-таки принц и неплохо выглядите,|даже, несмотря на прическу.#B1

source: OTHER: Nie chcę być niegrzeczny, ale to moja|sprawa.
de: OTHER: Ich will nicht unhöflich sein,|aber das ist meine Angelegenheit.
ru: OTHER: Я не хочу быть нескромным, но это|- мое.

source: OTHER: Sam go stworzyłem, to i zrobię z nim,|co tylko będę chciał.
de: OTHER: Ich habe ihn selbst erschaffen,|da kann ich auch mit ihm machen,|was immer ich will.
ru: OTHER: Я сам его создал, могу делать что|хочу.

source: OTHER: Ale nie przejmuj się, to istota stworzona|sztucznie, więc bogowie mi to wybaczą.
de: OTHER: Aber macht Euch nichts draus,|es ist ein künstlich erschaffenes Wesen,|also werden mir die Götter vergeben.
ru: OTHER: Не думайте, это - магическая штучка,|он мне еще пригодится!

source: HERO: Może i sztucznie, ale wygląda jak|prawdziwy.
de: HERO: Mag sein, daß er künstlich ist,|aber sieht aus wie echt .
ru: HERO: Может он и искусственный, но похож|на настоящего!

source: OTHER: Bo jest prawdziwy, tyle że jest wynikiem|eksperymentów z korzeniem.
de: OTHER: Er ist ja auch echt, nur daß er das Ergebnis|eines Experiments mit dieser Wurzel ist.
ru: OTHER: Он и есть настоящий - результат эксперимента|с этим корнем.

source: HERO: Hm...
ru: HERO: Хм...

source: HERO: Znam wielu takich "czarodziejów"...#B0
de: HERO: Ich kenne viele solcher "Zauberer"...#B0
ru: HERO: Я знаю много такого "волшебства"#B0

source: OTHER: Dość tego.
de: OTHER: Es ist jetzt genug.
ru: OTHER: Этого достаточно.

source: OTHER: Mam naprawdę dużo pracy, a ty znowu|grasz w te swoje dziwne gry.
de: OTHER: Ich habe wirklich viel Arbeit|und Ihr spielt nur wieder Eure|komischen Spielchen.
ru: OTHER: У меня еще много работы, а вы|все играете в смешные игры.

source: OTHER: I tak wszyscy wiedzą, że chyba tylko|jeszcze kotka barda ci się nie oparła.
de: OTHER: Es wissen sowieso alle, daß nur die Katze|des Barden Euch widerstanden hat.
ru: OTHER: Все знают, что только кошки бардов вас понимают.

source: OTHER: Starczy już tych podbojów, książę.#B0
de: OTHER: Es reicht mit diesen Eroberungen, Prinz.#B0
ru: OTHER: Хватит с этим, принц.#B0

source: OTHER: Jak to?...
de: OTHER: Das verstehe ich nicht...?
ru: OTHER: Я не понимаю?...

source: HERO: Er, znaczy się, wypijam wywar i już|mi się każda podoba.
de: HERO: Äh, Nun äh, ich trinke also diesen Trank|und schon gefällt mir jede.
ru: HERO: Э.. Ну я пью это, и мне все начинают нравиться...

source: OTHER: To rozumiem, ale po co?!...
de: OTHER: Das verstehe ich ja, aber wozu?!...
ru: OTHER: Я понимаю, но почему?

source: P#HERO: Dobre pytanie.
de: P#HERO: Gute Frage.
ru: P#HERO: Хороший вопрос!

source: P#HERO: Coś mi tak chyba w duszy gra.
de: P#HERO: Irgendwas geht da, äh, glaube ich,|in meiner Seele vor.
ru: P#HERO: Каждый раз что-то в душе переворачивается...

source: HERO: A może mam miękkie serce i nie|potrafię odmówić nawet brzydulom?
de: HERO: Vielleicht habe ich ja ein weiches Herz|und kann mich nicht mal|häßlichen Weibern verweigern.
ru: HERO: Наверное, у меня слишком мягкое сердце...

source: OTHER: Ech, ta dzisiejsza szlachetna|młodzież...#B0
de: OTHER: Argh, diese adlige Jugend von heute...#B0
ru: OTHER: Ах, эта современная молодежь...#B0

source: OTHER: Nawet gdybym chciał, a nie chcę, to|niestety i tak bym nie mógł.
de: OTHER: Selbst wenn ich wollte, was ich nicht der Fall ist,|könnte ich leider sowieso nicht.
ru: OTHER: Когда я захочу, я все равно не смог бы...

source: OTHER: Ale wiń tylko siebie, bo od kiedy|wypaplałeś swojemu giermkowi, że|główny składnik to lubczyk...
de: OTHER: Aber Ihr seid selbst schuld daran,|denn als Ihr eurem Hofnarr verraten habt,|daß die wichtigste Zutat Liebstöckel ist,...
ru: OTHER: Вы сами виноваты, что вас предал Хофнар...

source: OTHER: ...to okoliczni chłopi zdewastowali|w jego poszukiwaniu pół lasu.
de: OTHER: ...haben die örtlichen Bauern auf der Suche|nach diesem Gewächs den halben Wald verwüstet.
ru: OTHER: ... Местные крестьяне пол леса перепахали в|поисках этого корня.

source: OTHER: W skrócie: nie mam półfabrykatów.
de: OTHER: Kurz gesagt: ich habe keine mehr.
ru: OTHER: Короче говоря, у меня больше нету.

source: OTHER: I nie chcę mieć.
de: OTHER: Und will auch keine mehr haben.
ru: OTHER: И не будет.

source: OTHER: Czas już dorośleć, mój książę.#B0
de: OTHER: Höchste Zeit, mein Prinz, erwachsen zu werden.#B0
ru: OTHER: Самое время, принц, вырасти.#B0

source: HERO: Czy mogę ci jakoś pomóc?...
de: HERO: Kann ich dir irgendwie helfen?...
ru: HERO: Я могу вам помочь?

source: HERO: Wygląda na to, że mam nowego przyjaciela!
de: HERO: Sieht aus, als hätte ich einen neuen Freund!
ru: HERO: Похоже, у меня новый друг.

source: $0: Dużo jesz...
de: $0: Du ißt aber viel...
ru: $0: Но ты много ешь, однако.

source: $4: Skromny mnich i posiłek w drogiej tawernie?
de: $4: Ein bescheidener Mönch ißt in einer teuren Taverne?
ru: $4: Такой человек ест в дорогой таверне?

source: $1: Co to za bojowy krasnolud obok?
de: $1: Was ist das für ein kämpferischer Zwerg da drüben?
ru: $1: Что это еще за гном?

source: $2: Nie widziałem w miasteczku świątyni.
de: $2: Ich habe in dem Städtchen gar keinen Tempel bemerkt?
ru: $2: Я не заметил храма в городе...

source: $3: Smacznego.
de: $3: Guten Appetit.
ru: $3: Приятного аппетита!

source: OTHER: Za trzy dni wyruszam do jednej z południowych|krain, jako misjonarz.
de: OTHER: In drei Tagen breche ich als Missionar|in eines der südlichen Länder auf.
ru: OTHER: Через пару дней я собираюсь на юг миссионером.

source: OTHER: Słyszałem, że ludzie tam jedzą tak dużo,|że każdy chudzielec wydaje im się|podejrzany.
de: OTHER: Ich habe gehört, daß die Leute dort so viel essen,|daß jeder, der mager ist, ihnen dort verdächtig erscheint.
ru: OTHER: Я слышал, что там так много едят, что каждый худой|там выглядит подозрительно.

source: OTHER: I nie chcą z nim rozmawiać.
de: OTHER: Und sie dann nicht nicht mit ihm sprechen wollen.
ru: OTHER: И с ним не разговаривают.

source: OTHER: Więc wybrałem najprostszy sposób zdobycia|ich zaufania.
de: OTHER: Also habe ich den einfachsten Weg gewählt,|um ihr Vertrauen zu gewinnen.
ru: OTHER: Поэтому я выбрал наилегчайший путь им понравиться.

source: OTHER: Jem.
de: OTHER: Ich esse.
ru: OTHER: Я ем.

source: HERO: Ach... Rozumiem...
de: HERO: Aha... Ich verstehe...
ru: HERO: Ага, понимаю...

source: P#HERO: Ale co by się stało, gdybyś podróżował|do krainy, gdzie ludzie są dwa razy|niżsi?
de: P#HERO: Aber was würde geschehen,|wenn du in ein Land reisen würdest,|in dem die Menschen nur halb so groß sind?
ru: P#HERO: А что если тебе придется отправиться|в страну, где люди невысокие?

source: OTHER: Zamocowałbym kółka w kolanach.
de: OTHER: Dann würde ich mir Rädchen an die Knie montieren.
ru: OTHER: Тогда прилажу колесики к коленям.

source: P#HERO: A dwa razy wyżsi?
de: P#HERO: Und wenn sie doppelt so groß sind?
ru: P#HERO: А если высокие?

source: OTHER: Chodziłbym na szczudłach.
de: OTHER: Dann würde ich auf Stelzen laufen.
ru: OTHER: Тогда на ходули встану.

source: P#HERO: A dwa razy głupsi?
de: P#HERO: Und wenn sie doppelt so dumm sind?
ru: P#HERO: А если они в два раза тупее?

source: OTHER: Posłano by ciebie zamiast mnie.
de: OTHER: Dann würde ich dich|anstatt meiner schicken.
ru: OTHER: Тогда я тебя пошлю вместо|себя.

source: P#HERO: Tak tylko pytałem.
de: P#HERO: Ich habe ja nur so gefragt.
ru: P#HERO: Я так просто интересуюсь...

source: OTHER: Nie ma problemu.#E4#B0
de: OTHER: Kein Problem.#E4#B0
ru: OTHER: Без проблем.#E4#B0

source: OTHER: Ech, w sumie niegroźny.
de: OTHER: Ach, im Grunde genommen ist er ungefährlich.
ru: OTHER: Ах, это в общем-то безопасно.

source: OTHER: Biedne stworzenie, jest niezłym|wojownikiem, ale nie ma gdzie|sprawdzać swoich sił.
de: OTHER: Ein armes Geschöpf, er ist eigentlich ein|sehr guter Krieger, aber er kann|nirgendwo seine Kräfte messen.
ru: OTHER: Он хороший боец но совсем не умеет соразмерять|силу.

source: OTHER: Więc uznał prowokację za sposób|na życie.
de: OTHER: Also hat er die Provokation als|Lebensphilosophie angenommen.
ru: OTHER: Поэтому он выбрал провокацию философией|своей жизни.

source: OTHER: Ale w głębi duszy jest tylko|dużym dzieckiem.
de: OTHER: Aber im Inneren seiner Seele|ist er nur ein großes Kind.
ru: OTHER: Но в душе он неплохой человек.

source: OTHER: Cieszy go byle błyskotka, jak to|krasnoluda.#B0
de: OTHER: Er freut sich über jeden Glitzerkram,|wie Zwerge halt so sind.#B0
ru: OTHER: Он легко радуется.#B0

source: OTHER: Jestem już w drodze, zatrzymałem się tu|tylko na kilka miesięcy.
de: OTHER: Ich bin nur auf der Durchreise, habe hier|nur für ein paar Monate Halt gemacht.
ru: OTHER: Я тут всего лишь проездом на пару месяцев.

source: OTHER: Niedaleko jest świątynia. Ponoć dawno temu|oddawano tam hołdy jakiemuś tajemniczemu|i dziś zapomnianemu bóstwu.
de: OTHER: Aber nicht weit von hier entfernt liegt ein Tempel.|Angeblich hat man dort vor langer Zeit einer|geheimnisvollen und heute vergessenen|Gottheit gehuldigt.
ru: OTHER: Недалеко отсюда есть один храм. Там, говорят, до сих|пор служат мессы какому-то тайному и запрещенному|божеству.

source: OTHER: Świątynia od lat stoi pusta. Ten bóg nie|tylko, że utracił wyznawców, ale zginęła|nawet pamięć o nich.
de: OTHER: Der Tempel steht schon seit Jahren leer.|Dieser Gott hat nicht nur seine Anhänger verloren,|sondern auch die Erinnerung an ihn ist völlig|verloren gegangen.
ru: OTHER: Храм многие годы пустой. Это божество растеряло|и поклонников и даже память о себе.

source: OTHER: O ile świątynia w ogóle jeszcze stoi...
de: OTHER: Falls der Tempel überhaupt noch steht...
ru: OTHER: Если вообще еще сам храм не развалился...

source: HERO: Dlaczego? Był jakiś kataklizm?
de: HERO: Warum? Du meinst vielleicht hat ein Erdbeben ihn zerstört?
ru: HERO: Почему? Его могли разрушить?

source: OTHER: Każde bóstwo żyje tak długo, jak pamięta|o nim jego ostatni wyznawca. Tak|przynajmniej mówią.
de: OTHER: Ich meine, daß jede Gottheit nur so lange|lebt, wie der letzte Gläubige sich an sie|erinnert.
ru: OTHER: Я думаю, что бог жив пока есть хоть один верующий|в него.

source: OTHER: Potem bóstwo zaczyna słabnąć, tracić boską|moc, aż w końcu umiera.
de: OTHER: Später fängt die Gottheit an schwächer zu werden,|verliert ihre göttliche Kraft, bis sie am Ende stirbt.
ru: OTHER: Потом он начинает терять силу и умирает.

source: OTHER: Podejrzewam, iż w świątyni nie znajdziesz|nic prócz pustych ścian.#F1#B0
de: OTHER: Ich vermute, daß du in dem Tempel nichts|außer leeren Räumen finden wirst.#F1#B0
ru: OTHER: Я боюсь, что храм совершенно пуст сегодня.#F1#B0

source: OTHER: Jeszcze jak.#E3
de: OTHER: Den hab' ich.#E3
ru: OTHER: Тогда я пошел.#E3

source: OTHER: Spokojnie chłopcze, ślubowałem ubóstwo,|a nie głodowanie.
de: OTHER: Ruhig Blut, Junge, ich habe Armut gelobt|und nicht Hunger.
ru: OTHER: Спокойно, парень, не нервничай.

source: OTHER: Jem tutaj w zamian za pomoc przy|drobnych pracach.
de: OTHER: Ich esse hier im Tausch gegen kleine Arbeiten.
ru: OTHER: Я тут ем вместо того, чтобы заниматься кучей мелких дел.

source: OTHER: Co prawda pojawia się pewien problem...
de: OTHER: Um ehrlich zu sein, kommt hier ein Problem auf.
ru: OTHER: Вообще-то из-за этого у меня проблемы.

source: HERO: Tak?
de: HERO: Ja?
ru: HERO: Да?

source: OTHER: Żeby utyć, muszę dużo jeść. Żeby dostać|dużo jedzenia, muszę dużo pracować.
de: OTHER: Um zuzunehmen, muß ich viel essen.|Um viel zu essen zu bekommen,|muß ich viel arbeiten.
ru: OTHER: Я должен много есть. Чтобы много есть,|надо много работать...

source: OTHER: Im więcej pracuję, tym bardziej chudnę...
de: OTHER: Je mehr ich arbeite, desto mehr nehme ich ab...
ru: OTHER: Чем больше я работаю, тем больше мне надо есть...

source: OTHER: Kwadratura koła.#B0
de: OTHER: Die Quadratur des Kreises.#B0
ru: OTHER: Квадратура круга.#B0

source: OTHER: Jazda stąd!
de: OTHER: Verschwinde hier!
ru: OTHER: Исчезни!

source: HERO: Co takiego?
de: HERO: Wie bitte?
ru: HERO: Что?

source: OTHER: Ale już bo poprzetrącam kości!
de: OTHER: Aber sofort, sonst brech' ich dir alle Knochen!
ru: OTHER: Быстро, а то я тебе кости переломаю!

source: OTHER: I kto tu jest skarlałą rasą...
de: OTHER: Wer ist hier ein Zwerg...
ru: OTHER: Кто тут еще гном?!

source: HERO: Dobra, już znikam...
de: HERO: Gut, ich gehe ja schon...
ru: HERO: Хорошо? я пошел.

source: P#HERO: Ale I'll be back.
de: P#HERO: Aber, ich komme wieder.
ru: P#HERO: Но я вернусь.

source: OTHER: Głuchy czy głupi?
de: OTHER: Bist du taub oder nur blöd?
ru: OTHER: Ты глухой или тупой?

source: HERO: Właściwie jak śmiesz tak się odzywać do|księcia tej krainy?
de: HERO: Was erlaubst du dir eigentlich so mit dem|Prinzen dieses Landes zu sprechen?
ru: HERO: Как ты смеешь так разговаривать с принцем?!

source: OTHER: Książę? Jesteś księciem? Nie uwierzę, póki|nie dasz mi podarunku godnego księcia!
de: OTHER: Prinz? Du bist ein Prinz? Das glaube ich erst,|wenn du mir ein Geschenk überreichst, das eines|Prinzen würdig ist.
ru: OTHER: Принц? Ты принц? Я поверю в это только если ты|сделаешь мне королевский подарок.

source: P#HERO: Chwytam.
de: P#HERO: Schon verstanden.
ru: P#HERO: Понял.

source: OTHER: Wrrr...
ru: OTHER: Вррр ...

source: HERO: Brrr...
ru: HERO: Бррр...

source: HERO: To wspaniale znowu cię spotkać!
de: HERO: Es ist wundervoll dich wieder zu treffen!
ru: HERO: Приятно снова тебя встретить!

source: OTHER: Mam niejasne wrażenie, że nie po raz|ostatni... Chociaż nie wiem czy powinienem|się z tego powodu cieszyć.
de: OTHER: Ich habe die vage Vermutung,|daß das nicht das letzte Mal war... Nur weiß ich nicht, ob ich mich|darüber freuen soll.
ru: OTHER: Я подозреваю, что не в последний|раз... Только я не уверен, что меня это|радует.

source: OTHER: Opowiadaj.
de: OTHER: Dann erzähl schon...
ru: OTHER: Тогда рассказывай.

source: HERO: Chyba nie mam ochoty rozmawiać z tym|brutalnym, zawszonym i ordynarnym|osiłkiem.
de: HERO: Eigentlich habe ich gar keine Lust|mit einem brutalen und verlausten|ordinären Halbstarken zu sprechen.
ru: HERO: Я не хочу разговаривать с хулиганом|и дебоширом.

source: P#HERO: Czy nie powiedziałem tego za głośno?
de: P#HERO: Habe ich das nicht laut genug gesagt?
ru: P#HERO: Я что, недостаточно громко сказал?

source: HERO: Witam!
de: HERO: Sei gegrüßt!
ru: HERO: Пока!

source: OTHER: Miło cię widzieć, książę!
de: OTHER: Nett Euch zu sehen, Prinz!
ru: OTHER: Приятно встретиться, принц!

source: $0: Duży ruch dzisiaj...
de: $0: Viel Betrieb heute...
ru: $0: Успехов.

source: $1: Podsłuchałeś może jakieś plotki?
de: $1: Hast du irgendwelche neuen Gerüchte gehört?
ru: $1: Ты слышал новые сплетни?

source: $2: Nie nudno tak bez dziewek do pomocy?
de: $2: Ist es nicht langweilig hier so ganz ohne Mädels?
ru: $2: Разве тут не скучно?

source: $6: Partyjka klip-klapa?
de: $6: Eine Partie Klip-Klap?
ru: $6: Партию в Клип-Клап?

source: $3: Do zobaczenia później.
de: $3: Bis später.
ru: $3: Пока.

source: $4: Oczywiście.
de: $4: Selbstverständlich.
ru: $4: Конечно.

source: $5: Może później.
de: $5: Vielleicht später.
ru: $5: Может позже.

source: OTHER: O tak, od kiedy wszedł tu ten krasnolud|to nikogo ani nie przybywa, ani nie ubywa.
de: OTHER: Ja, ja, bis zu dem Moment,|als der Zwerg hereingekommen ist,|jetzt kommt hier niemand mehr rein oder raus.
ru: OTHER: Да, да, с того момента, как|пришел этот гном, никто не выходит|и не приходит.

source: OTHER: Widziałem, że i ty z nim rozmawiałeś?
de: OTHER: Habe ich nicht gesehen, daß auch Ihr|mit ihm gesprochen habt?
ru: OTHER: Я не видел, вы тоже с ним разговаривали?

source: HERO: To taki drobny, sfrustrowany szantażysta.
de: HERO: Das ist so ein kleiner, frustrierter Erpresser.
ru: HERO: Такой маленький, вредный тип.

source: HERO: Ale jakbym był takim dużym krasnoludem|jak on, pewnie też miałbym żal do świata.
de: HERO: Aber wenn ich so ein kleiner Zwerg wäre wie er,|dann würde ich auch der ganzen Welt grollen.
ru: HERO: Впрочем, если бы я был таким же мелким гномиком,|я бы тоже был вредным.

source: OTHER: Fakt, nieco wyrośnięty.
de: OTHER: Stimmt, er ist nicht ganz ausgewachsen.
ru: OTHER: Да, он совсем не вырос.

source: OTHER: Różne dziwa się zdarzają, widziałem tu|nawet kiedyś dwóch takich małych|z piętami obrośniętymi włosiem.
de: OTHER: Es gibt schon merkwürdige Sachen,|ich hab hier mal einen gesehen, der hatte ganz|behaarte Fußsohlen.
ru: OTHER: Тут разное встречается. Я видел парня|с волосатыми ступнями.

source: OTHER: Bogata jest Matka Natura, nie ma co.#B0
de: OTHER: Keine Frage, Mutter Natur ist|reich an Vielfalt.#B0
ru: OTHER: Конечно, мать природа богата на|выдумки.#B0

source: OTHER: Jedyna godna powtórzenia to chyba ta, że|ponoć księżniczka Sheila jest już tak|ślepa, że...
de: OTHER: Hmm, nichts Interessantes...|höchstens vielleicht, daß Prinzessin Sheila|schon so blind ist, daß...
ru: OTHER: Ничего особенного... Наверное,|принцесса Шила настолько слепа, что...

source: OTHER: Och, przepraszam, książę...
de: OTHER: Ach, entschuldigt Prinz...
ru: OTHER: Ах, простите, принц!

source: OTHER: Nie miałem na myśli...
de: OTHER: Ich hatte nicht im Sinn...
ru: OTHER: Я не имел ввиду...

source: OTHER: To jest...
de: OTHER: Es ist nur...
ru: OTHER: Это просто...

source: HERO: No dobrze.
de: HERO: Schon gut.
ru: HERO: Хорошо.

source: HERO: Zapomnijmy o tym.#X1
de: HERO: Schwamm drüber.#X1
ru: HERO: Исчезни.#X1

source: OTHER: Przyznam, książę, że kiedy twój ojciec|je wygnał, płakałem rzewnymi łzami.
de: OTHER: Ach ja. Ihr müßt wissen, daß ich, als Euer|Vater Euch vertrieben hat, daß ich da|richtige ... Tränen geweint habe.
ru: OTHER: Ах да, мы слышали, ваш отец вас прогнал...

source: OTHER: Zresztą, razem płakaliśmy, o ile|pamiętam...
de: OTHER: Außerdem haben wir doch gemeinsam geweint,|erinnert Ihr Euch noch?
ru: OTHER: Вы меня вообще помните?

source: OTHER: Ech, dobrze, że wymyśliłeś klip-klap...
de: OTHER: Ach, nur gut, daß Ihr Euch Klip-Klap ausgedacht habt...
ru: OTHER: Хорошо, что вы придумали про Клип-Клап.

source: HERO: Klip-klap?!...
ru: HERO: Клип-Клап??

source: OTHER: No właśnie, może zagramy rundkę?#E6#B1
de: OTHER: Ja genau, wollen wir eine Partie spielen?#E6#B1
ru: OTHER: Да, именно, хотите сыграть?#E6#B1

source: OTHER: Do zobaczenia, książę.#E3
de: OTHER: Auf Wiedersehen, Prinz.#E3
ru: OTHER: Прощайте, принц.#E3

source: OTHER: W końcu się odegram!#X2
de: OTHER: Am Ende revanchiere ich mich!#X2
ru: OTHER: Наконец я взял реванш!#X2

source: OTHER: <piski kurczęcia>#B0
de: OTHER: <So macht man sich hierzulande lustig über Drückeberger>#B0
ru: OTHER: "Вот так вот тут все реагируют на горняков"#B0

source: HERO: Nie wiem czy wypada przerywać artyście,|kiedy ma natchnienie.
de: HERO: Ich weiß nicht, ob es sich geziemt,|einen Künstler zu unterbrechen,|wenn er eine Eingebung hat.
ru: HERO: Я не уверен, что стоит так отвлекать|от работы художника...

source: OTHER: Zandaha...
ru: OTHER: Цандаха...

source: P#OTHER: To nie jest cały wyraz, ale gdybym|go przeczytał w całości, przywołałbym|bóstwo.
de: P#OTHER: Das ist nicht das vollständige Wort,|aber wenn ich es ganz vorlesen würde,|dann würde ich eine Gottheit herbeirufen.
ru: P#OTHER: Это не совсем полное слово. Вот когда|его прочитают полностью, я смогу призвать|божество.

source: HERO: Mam nadzieję, że brakuje tylko|jednej litery.
de: HERO: Hoffentlich fehlt nur ein Buchstabe.
ru: HERO: Не хватает одной буквы.

source: $0: Zandahar!
ru: $0: Цандахар!

source: $4: Zandahat!
ru: $4: Цандахат!

source: $5: Zandahas!
ru: $5: Цандахас!

source: $6: Zandahag!
ru: $6: Цандахаг!

source: $7: Zandahal!
ru: $7: Цандахал!
