Repository: scummvm/scummvm
Catalog: devtools/create_prince/*.po
Languages: de, ru

source: OTHER: W porządku, a teraz mnie uwolnij.
de: OTHER: Das wurde aber auch Zeit. Nun befreie mich.
ru: OTHER: Но это потребует времени. А теперь освободи меня.

source: HERO: O nie, droga panno, tym razem nie|tak szybko.
de: HERO: Oh nein, liebes Fräulein, diesmal nicht|so schnell.
ru: HERO: О нет, не так быстро!

source: HERO: Błąd można popełnić tylko raz.
de: HERO: Den Fehler mache ich nur einmal.
ru: HERO: Я только один раз совершаю ошибки.

source: HERO: Najpierw chwilę porozmawiamy.
de: HERO: Zuerst werden wir miteinander sprechen.
ru: HERO: Сначала нам надо поговорить.

source: $0: Co robiłaś u Księcia Wampirów?
de: $0: Was hast du beim Fürsten der Vampire gemacht?
ru: $0: Что ты сделал с лордом вампиров?

source: $1: Słyszałem, że smoki porywają tylko dziewice?
de: $1: Man sagt, daß Drachen nur Jungfrauen entführen.
ru: $1: Говорят, что драконы питаются только молодыми девушками.

source: $2: Ta maska chroni ciebie czy estetycznie wrażliwych?
de: $2: Schützt die Maske ästhetisch empfindende Menschen?
ru: $2: Эта маска - для защиты нервных людей?

source: $3: Czy myśmy się już kiedyś nie spotkali?...
de: $3: Haben wir uns schon einmal getroffen?
ru: $3: Мы уже встречались?

source: OTHER: Długa historia.
de: OTHER: Das ist eine lange Geschichte.
ru: OTHER: Это длинная история.

source: HERO: Ależ mamy mnóstwo czasu, nigdzie się|nam przecież nie spieszy...
de: HERO: Oh, wir haben viel Zeit, wir haben es|nicht eilig...
ru: HERO: Ох, у нас много времени, мы не торопимся.

source: P#OTHER: Prawie dwa lata temu zostałam porwana|przez pewnego demona.
de: P#OTHER: Vor fast zwei Jahren wurde ich|von einem Dämon entführt.
ru: P#OTHER: Два года назад на меня напал демон.

source: OTHER: W Piekle okazało się, że to pomyłka.
de: OTHER: In der Hölle stellte sich heraus, daß alles ein Irrtum war.
ru: OTHER: В аду выяснилось, что это была ошибка.

source: OTHER: Ale ten cholerny sługus Lucyfera zamiast|odstawić mnie na miejsce, podarował mnie|wampirzemu królowi.
de: OTHER: Aber der verdammte Kriecher von Luzifer hat|mich dem Fürsten der Vampire geschenkt, statt|mich wieder zurückzubringen.
ru: OTHER: Но проклятый советник Люцифера подарил меня|лорду вампиров, вместо того, чтобы меня воскресить.

source: OTHER: Był mu winien jakąś przysługę.
de: OTHER: Er war ihm etwas schuldig.
ru: OTHER: Он ему был должен.

source: HERO: Spędziłaś w zamku dwa lata?!
de: HERO: Du hast zwei Jahre im Schloß verbracht?
ru: HERO: Ты провел в замке два года?

source: OTHER: Prawie.
de: OTHER: Beinahe.
ru: OTHER: Почти.

source: P#HERO: No to by wyjaśniało twój|nienajlepszy humor...
de: P#HERO: Das wäre eine Erklärung für deine|schlechte Laune...
ru: P#HERO: Вот объяснение твоему плохому настроению...

source: OTHER: Kiedy tylko dorwę w swoje ręce tego|demona, tortury Lucyfera wydadzą mu|się siódmym niebem.
de: OTHER: Wenn ich diesen Dämon zwischen die Finger kriege,|werden ihm Luzifers Foltern wie der siebente Himmel|erscheinen.
ru: OTHER: Когда этот демон попадется мне в руки, ему ад покажется|седьмым небом рая.

source: HERO: Chcesz dostać się do Piekła?
de: HERO: Du möchtest in die Hölle?
ru: HERO: Ты хочешь попасть в ад?

source: OTHER: Och wiem, wiem, to niemożliwe...
de: OTHER: Oh ja, ich weiß, ich weiß, das ist unmöglich...
ru: OTHER: О да, я знаю, знаю, что это невозможно.

source: OTHER: Ale ja...
de: OTHER: Aber ich...
ru: OTHER: Но я...

source: HERO: Nie, nie, źle mnie zrozumiałaś! Ja|też chcę się tam dostać!
de: HERO: Nein, nein. Du hast mich falsch verstanden!|Ich will auch dahin!
ru: HERO: Нет, нет, ты меня не совсем правильно понял,|я тоже собираюсь туда.

source: HERO: Moja dusza...
de: HERO: Meine Seele...
ru: HERO: Моя душа...

source: OTHER: Nie obchodzi mnie to, uwolnij mnie,|w ramach rewanżu pomogę ci, i na tym|koniec.
de: OTHER: Das interessiert mich nicht. Befreie mich endlich|und ich werde dir als Gegenleistung helfen und|damit basta.
ru: OTHER: Это меня не интересует. Освободи меня, я тебе за это|помогу и баста.

source: OTHER: Choć oczywiście i tak dałabym sobie|sama radę.
de: OTHER: Offensichtlich käme ich alleine sowieso nicht|zurecht.
ru: OTHER: Честно говоря, все равно у меня не получится ничего|в одиночку.

source: HERO: Oczywiście.#B0
de: HERO: Allerdings.#B0
ru: HERO: Конечно.#B0

source: OTHER: Nietrudno zachować dziewictwo, kiedy wokoło|spotyka się tylko mięczaków, tchórzy|i pantoflarzy.
de: OTHER: Es fällt nicht schwer, die Jungfräulichkeit zu bewahren,|wenn man immer wieder auf Schwächlinge, Feiglinge|und Pantoffelhelden stößt.
ru: OTHER: Не так сложно быть бравым, когда приходится иметь дело с|одними слабаками, тряпками и лжегероями.

source: OTHER: Prawdziwi mężczyźni trafiają się tylko|w bajkach, niestety.
de: OTHER: Die wahren Männer gibt es leider nur|im Märchen.
ru: OTHER: Честные люди бывают только в сказках.

source: HERO: Phm, chyba nie wyglądam na mięczaka?
de: HERO: Pfff, ich sehe doch wohl nicht aus wie|ein Schwächling?
ru: HERO: Пффф! Я что похож на слабака?

source: OTHER: Z taką fryzurą w ogóle nie wyglądasz|na mężczyznę.
de: OTHER: Mit deiner Frisur siehst du überhaupt nicht|wie ein Mann aus.
ru: OTHER: С такой прической ты вообще на мужика не похож.

source: HERO: Mprfff...#B0
de: HERO: grrpfff...#B0
ru: HERO: грпф!#B0

source: P#P#P#HERO: Rozumiem, porozmawiamy o tym|później.#B0
de: P#P#P#HERO: Ich verstehe. Wir sprechen nachher darüber.#B0
ru: P#P#P#HERO: Я понимаю, мы еще поговорим об этом.#B0

source: OTHER: Nie bywałam w karczmach ani zamtuzach.
de: OTHER: Ich pflegte nicht so oft in Wirtshäusern zu verweilen.
ru: OTHER: Я не так часто захожу в таверны.

source: HERO: Zaraz, zaraz...
de: HERO: Moment mal...
ru: HERO: Погоди...

source: HERO: To nie tani chwyt, ja naprawdę|cię już chyba gdzieś widziałem...
de: HERO: Das ist kein Trick, ich habe dich tatsächlich|schon mal gesehen...
ru: HERO: Это не фокус, я тебя уже где-то видел...

source: OTHER: Nie sądzę, zresztą nie mam teraz ochoty|zastanawiać się nad tym, co pamiętasz,|a czego nie.
de: OTHER: Sicher nicht. Außerdem habe ich jetzt keine Lust,|mir den Kopf zu zerbrechen, woran du dich erinnerst|und woran nicht.
ru: OTHER: Конечно нет. Потом, мне сейчас не до догадок, видел|ты меня или нет.

source: OTHER: Lepiej zdejmij w końcu ze mnie te łańcuchy.#B0
de: OTHER: Es wäre besser, wenn du mich endlich|von diesen Ketten befreist.#B0
ru: OTHER: Ты меня освободишь от оков, или нет?#B0

source: OTHER: Ufff...
ru: OTHER: Уффф....

source: OTHER: No to do roboty.
de: OTHER: Mach dich an die Arbeit!
ru: OTHER: За работу!

source: OTHER: Inicjatywa należy do ciebie.
de: OTHER: Die Initiative liegt bei dir.
ru: OTHER: Инициатива за тобой.

source: OTHER: Bohaterze.
de: OTHER: Mein Held.
ru: OTHER: Мой герой.

source: HERO: Eeee...
ru: HERO: Э-э...

source: HERO: Właściwie to w jaki sposób dostaniemy|się do Piekła?
de: HERO: Wie kommen wir eigentlich|zur Hölle?
ru: HERO: Как мы попадем в ад?

source: OTHER: Tylko czekałam na ten moment.
de: OTHER: Ich habe nur auf den Moment gewartet.
ru: OTHER: Я только ждал подходящего момента.

source: OTHER: Wiedziałam, że na ciebie nie można|liczyć.
de: OTHER: Ich wußte, daß man sich auf dich|verlassen kann.
ru: OTHER: Я знал, что на тебя можно положиться.

source: P#OTHER: Podsłuchałam co nieco będąc w niewoli.
de: P#OTHER: Ich habe einiges in der Gefangenschaft mitbekommen.
ru: P#OTHER: Ш кое-что приобрел в заключении.

source: OTHER: Po pierwsze, musimy udawać zmarłych.
de: OTHER: Zuerst müssen wir uns tot stellen.
ru: OTHER: Сначала нам надо умереть.

source: OTHER: I to dobrze udawać, bo Przewoźnik Umarłych|wyczuwa żywych na kilometr.
de: OTHER: Und das sehr überzeugend. Denn der Fährmann der Toten|riecht einen Lebenden auf einen Kilometer.
ru: OTHER: И это обязательно. Паромщик душ чувствует живой дух за|километр.

source: OTHER: Musimy mieć także pod językiem obola,|pieniążek, który rodzina wkłada w usta|zmarłego, aby opłacić Przewoźnika.
de: OTHER: Wir müssen auch einen Obolus, eine Münze unter der Zunge|haben. Du weißt sicher, daß die Familien sie unter die Zunge|der Toten legt als Gebühr für den Fährmann.
ru: OTHER: Кроме того, нам надо иметь монетку в зубах, обол, как дар|семьи умершего паромщику.

source: OTHER: To powinno wystarczyć.
de: OTHER: Das sollte reichen.
ru: OTHER: Этого должно быть достаточно.

source: HERO: No to wiem już wszystko.
de: HERO: Alles klar.
ru: HERO: Все понятно.

source: HERO: Arivald mi pozwolił...
de: HERO: Arivald hatte es mir erlaubt...
ru: HERO: Аривальд мне это уже объяснял.

source: OTHER: Zgiń, przepadnij, żałosna ludzka|hieno!
de: OTHER: Geh weg! Verschwinde, du bedauerliche|menschliche Friedhofshyäne!
ru: OTHER: Уходи, исчезни, человеческое отродье!

source: HERO: Wiem, że nie rozstaliśmy się w przyjaźni, ale|wierz mi, że chodzi o bardzo poważną sprawę.
de: HERO: Ich weiß, daß wir uns nicht friedlich getrennt haben,|aber glaube mir, es geht um eine sehr wichtige Sache.
ru: HERO: Я знал, что мы не сможем расстаться с миром. Но поверь,|речь идет об очень важной вещи.

source: HERO: Jako ekspert pewnie wiesz coś pewnie|o obolach?...
de: HERO: Als Experte weißt du sicher etwas|von Obolussen?...
ru: HERO: Как эксперт, ты знаешь что-либо об|Оболах?

source: OTHER: Jeszcze raz się do mnie odezwiesz, a|znajdziesz jednego pod swoim językiem.
de: OTHER: Noch ein Wort und du findest einen|unter deiner Zunge.
ru: OTHER: Еще одно слово и у тебя будет один|в зубах!

source: OTHER: Sio!
de: OTHER: Und jetzt raus hier!
ru: OTHER: Убирайся!

source: OTHER: Przepraszam, czy ma pan może jakieś|zbędne obole?
de: OTHER: Verzeihung, hätten Sie vielleicht|überschüssige Obolusse?
ru: OTHER: Спокойствие, а у вас есть ненужные|оболы?

source: OTHER: Choćby dwa?
de: OTHER: Wenigstens zwei?
ru: OTHER: Как минимум два...

source: OTHER2: Może i mam, panienko, ale z nikim|się nimi nie będę dzielił.
de: OTHER2: Vielleicht habe ich die, aber ich werde|sie mit niemandem teilen.
ru: OTHER2: У меня есть, но я не дам.

source: OTHER2: A już na pewno nie z towarzyszką tego|cmentarnego rabusia!
de: OTHER2: Und auf gar keinen Fall mit der Freundin dieses|Friedhofsräubers!
ru: OTHER2: И никогда друзьям этого мародера!

source: OTHER: Okradałeś groby?!
de: OTHER: Du hast Gräber geplündert?!
ru: OTHER: Ты грабил могилы?!

source: HERO: Skądże znowu! W końcu jestem księciem!
de: HERO: Aber nein! Schließlich bin ich ein Prinz!
ru: HERO: Нет, я же принц!

source: OTHER: I jeszcze kłamca!
de: OTHER: Auch noch lügen!
ru: OTHER: Опять ложь!

source: OTHER: Jesteś paskudny, jesteś cmentarną hieną|i jesteś oszustem. Wybrałaś sobie|świetnego towarzysza, panienko.
de: OTHER: Einfach widerlich. Du Friedhofshyäne und|nichtsnutziger Betrüger. Da haben Sie sich ja|einen tollen Kameraden ausgewählt, junge Frau.
ru: OTHER: Вот все просто, мародер и мошенник. Хорошая|у вас компания, дама.

source: OTHER: Won z mojego cmentarza!
de: OTHER: Raus aus meinem Friedhof!
ru: OTHER: Вон с моего кладбища!

source: HERO: Sprawy się komplikują.
de: HERO: Die Sache kompliziert sich.
ru: HERO: Все стало сложнее.

source: HERO: Spróbuj wejść tam, do środka.
de: HERO: Versuch, dort hineinzukommen.
ru: HERO: Попробуй войти.

source: OTHER: A to niby po co?
de: OTHER: Wozu denn?
ru: OTHER: Зачем?

source: HERO: Hm, nie wiem, ale zawsze można znaleźć|coś ciekawego w takich miejscach.
de: HERO: Hm, ich weiß nicht, aber man kann immer|etwas Interessantes an solchen Orten finden.
ru: HERO: Не знаю, но в таких местах всегда найдется|что-нибудь интересное.

source: HERO: Uwierz mojej intuicji.
de: HERO: Vertraue meiner Intuition.
ru: HERO: Поверь моей интуиции.

source: OTHER: Pędzę, lecę.
de: OTHER: Ich fliege, ich eile.
ru: OTHER: Ага, бегу и спотыкаюсь.

source: OTHER: Mam ci przynieść karalucha czy pająka?
de: OTHER: Soll ich dir eine Schabe oder lieber|eine Spinne holen?
ru: OTHER: Мне помыть тебе пол или потереть спину?

source: OTHER: Co jeszcze mogę dla ciebie zrobić?|Nie rozbawiłoby cię, gdybym|wskoczyła w ogień?
de: OTHER: Was kann ich sonst noch für dich tun?|Würde es dich vielleicht amüsieren, wenn ich|ein bißchen für dich ins Feuer spränge?
ru: OTHER: Что ты еще от меня хочешь? Может в огонь|прыгнуть?

source: HERO: Musisz spróbować tam się wcisnąć.|Widziałem szczura.
de: HERO: Du mußt versuchen, dich dort hineinzuzwängen.|Ich habe eine Ratte gesehen.
ru: HERO: Ты должен себя заставить. Я видел крысу.

source: HERO: Grabarz na pewno da nam za niego|kilka oboli.
de: HERO: Der Totengräber wird uns sicher dafür|einige Obolusse geben.
ru: HERO: Копальщик могил должен дать нам обол.

source: OTHER: Spróbuj sam.
de: OTHER: Versuchs doch selbst.
ru: OTHER: Попробуй сам.

source: HERO: Jestem zbyt potężnie zbudowany.
de: HERO: Ich bin allzu kräftig gebaut.
ru: HERO: Я слишком крупно сложён.

source: HERO: Ty jesteś szczupła i szybka, przed tobą|żaden szczur nie zdoła się schować.
de: HERO: Du bist schlank und flink, dir wird|keine Ratte entwischen.
ru: HERO: Ты стройная и быстрая, ни одна крыса|не сможет от тебя скрыться.

source: P#OTHER: Potraktuję to jako komplement.
de: P#OTHER: Ich fasse es als Kompliment auf.
ru: P#OTHER: Я приму это за комплимент.

source: HERO: Jeszcze jedna próba, to naprawdę|ważne.
de: HERO: Noch ein Versuch, es ist wirklich|wichtig.
ru: HERO: Еще раз попробуй, это важно.

source: OTHER: No dobrze.
de: OTHER: Na gut.
ru: OTHER: Ладно.

source: OTHER: Nie ma mowy!
de: OTHER: Ausgeschlossen!
ru: OTHER: Не может быть и речи!

source: OTHER: Porwę sobie ubranie!
de: OTHER: Ich zerreiße mir meine Kleider!
ru: OTHER: Я порву платье!

source: OTHER: A poza tym nie mam już za plecami|zdrajcy, który mnie brutalnie|popchnie.
de: OTHER: Außerdem habe ich keine widerlichen Vampire|mehr im Rücken, die mich gefangen halten.
ru: OTHER: Кроме того, меня больше никто не пленит.

source: OTHER: Jednym słowem nie dostaniesz szczura,|zanim nie poszerzysz tego otworu!
de: OTHER: Jedenfalls kriegst du keine Ratte,|bevor du dieses Loch nicht größer machst!
ru: OTHER: Проще говоря, ты не получишь крысу,|пока не расширишь эту дыру!

source: OTHER: A jednak słabeusz...
de: OTHER: Was für ein Schwächling...
ru: OTHER: Какой слабак...

source: OTHER: Mizerne chuchro...
de: OTHER: Armseliger Schwächling...
ru: OTHER: Дохлый слабак...

source: OTHER: Widziałam silniejsze niemowlaki...
de: OTHER: Ich habe schon stärkere Säuglinge gesehen...
ru: OTHER: Я встречала более сильных младенцев...

source: OTHER: Chuderlaczek...
de: OTHER: Du Hemd...
ru: OTHER: Ты...

source: OTHER: Mój ty siłaczu...
de: OTHER: Du bist mein Kraftprotz...
ru: OTHER: Ты, мое воплощение силы...

source: OTHER: Udało się, ale jeśli wytniesz mi jeszcze raz|taki numer, to zaśpiewasz zupełnie innym|głosem.
de: OTHER: Es hat geklappt, aber wenn du sowas|nochmal versuchst, dann wirst du|gleich die Tonlage ändern.
ru: OTHER: Получилось. Но если ты еще раз такое|выкинешь, ты у меня запоёшь по-другому.

source: OTHER: Dużo cieńszym, zapewniam cię...
de: OTHER: Und zwar nach oben, wenn du weißt,|was ich meine...
ru: OTHER: Очень тоненьким голосом, я тебя уверяю.

source: HERO: Zanim mnie zabijesz...
de: HERO: Bevor du mich tötest...
ru: HERO: Прежде чем ты меня прибьёшь...

source: OTHER: Sześć... Pięć...
de: OTHER: Sechs... Fünf...
ru: OTHER: Шесть, пять...

source: HERO: Mam dobrą wiadomość!
de: HERO: Ich habe eine gute Nachricht!
ru: HERO: У меня хорошая новость!

source: OTHER: Cztery... Trzy...
de: OTHER: Vier...drei...
ru: OTHER: Четыре, три...

source: HERO: Poczekaj, bo to ważne dla ciebie...
de: HERO: Warte doch, es ist wichtig für dich ...
ru: HERO: Подожди, это важно...

source: OTHER: Dwa... Jeden...
de: OTHER: Zwei... eins...
ru: OTHER: Два, один...

source: HERO: Znalazłem ci przyjaciela!
de: HERO: Ich habe dir einen Freund gefunden!
ru: HERO: Я нашел тебе друга!

source: HERO: Prawdziwego, tłustego, obrzydliwego|szczura!
de: HERO: Eine echt fiese Ratte!|
ru: HERO: Настоящую, толстую, мерзкую крысу!

source: OTHER: Zero... Minus jeden...
de: OTHER: Null... Minus eins...
ru: OTHER: Ноль, минус один...

source: P#OTHER: Naprawdę?
de: P#OTHER: Wirklich?
ru: P#OTHER: Правда?

source: HERO: Słowo pogromcy smoków!
de: HERO: Großes Drachentöterehrenwort!
ru: HERO: Честное слово убийцы драконов!

source: HERO: Chętnie oddam go za dwa obole.
de: HERO: Ich nehme gerne zwei Obolusse dafür.
ru: HERO: Я за это возьму два обола.

source: OTHER: Nie ma sprawy. To uczciwa cena.
de: OTHER: In Ordnung. Das ist ein fairer Preis.
ru: OTHER: Хорошо. Это достойная цена.

source: OTHER: Wyczuwam wiedźmiński amulet...
de: OTHER: Ich spüre das Amulett des Hexers ...
ru: OTHER: Я возьму амулет колдуна...

source: OTHER: Więc są jeszcze jacyś...
de: OTHER: Es gibt also noch...
ru: OTHER: Еще есть...

source: OTHER: Nie rozpoznałeś naszego Znaku!
de: OTHER: Du hast unser Zeichen nicht erkannt!
ru: OTHER: Ты не узнал наших знаков!

source: OTHER: Komu ukradłeś ten amulet?
de: OTHER: Wem hast du dieses Amulett geklaut?
ru: OTHER: Для кого ты украл этот амулет?

source: OTHER: Skąd go masz?!
de: OTHER: Wo hast du es her?
ru: OTHER: Откуда он у тебя?

source: OTHER: Gadaj natychmiast!
de: OTHER: Ich warte...!
ru: OTHER: Я жду!

source: HERO: Właściwie to go nie potrzebuję.
de: HERO: Eigentlich brauche ich es nicht.
ru: HERO: Мне он больше не нужен.

source: HERO: Po prostu go znalazłem, ale nie wiem|nawet, co to takiego.
de: HERO: Ich habe es einfach gefunden, aber ich weiß|nicht einmal, was es ist.
ru: HERO: Я его просто нашел, но я не знаю, что это.

source: HERO: Jeśli on ma dla ciebie jakieś znaczenie,|to weź go sobie.
de: HERO: Falls es für dich eine Bedeutung hat,|behalte es.
ru: HERO: Если он значит что-то для тебе,|то оставь его себе.

source: OTHER: Hm.
ru: OTHER: Хм.

source: OTHER: Może zareagowałem zbyt gwałtownie.
de: OTHER: Ich habe wohl allzu heftig reagiert.
ru: OTHER: Может я отреагировал слишком напористо.

source: OTHER: Od czasów Blaviken jakoś szybko się|denerwuję.
de: OTHER: Seit den Blaviken-Zeiten ärgere ich mich|irgendwie schneller.
ru: OTHER: Я как-то стал раздражительнее...

source: OTHER: Jako nagrodę dla znalazcy dam|ci jeden z moich eliksirów.
de: OTHER: Als Finderlohn gebe ich dir eines|meiner Elixiere.
ru: OTHER: Я подарю тебе один из своих эликсиров.

source: OTHER: Może ci się przyda.
de: OTHER: Vielleicht wird es dir einmal nützen.
ru: OTHER: Он тебе пригодится.

source: OTHER: Proszę, zostawcie nas samych, mamy|ważne sprawy do omówienia.
de: OTHER: Laßt uns bitte allein, wir haben|etwas Wichtiges zu besprechen.
ru: OTHER: Оставь нас, нам надо обсудить кое-что|важное.

source: OTHER: No więc ten jest na pryszcze.
de: OTHER: Das hier ist gegen Pickel.
ru: OTHER: Это против прыщей.

source: OTHER2: Coś takiego! I działa?
de: OTHER2: Unglaublich! Wirkt das tatsächlich?
ru: OTHER2: Правда, и что, работает?

source: OTHER2: A jaka skuteczność?
de: OTHER2: Und wie stark ist die Wirkung?
ru: OTHER2: И как сильно?

source: OTHER: Robiłem wczoraj maseczkę, i dzisiaj|mam skórę jak aksamit.
de: OTHER: Ich machte mir gestern eine Maske und heute|ist meine Haut glatt wie Seide.
ru: OTHER: Вчера сделала себе масочку,|а сегодня моя кожа как бархат.

source: OTHER2: Och, to wspaniale.
de: OTHER2: Oh, das ist wunderbar.
ru: OTHER2: О, это здорово.

source: HERO: Czeka pani na kogoś?
de: HERO: Warten Sie auf jemanden?
ru: HERO: Мадам кого-то ждёт?

source: OTHER: Nie twoja sprawa.
de: OTHER: Das geht Euch nichts an.
ru: OTHER: Не твоё дело.

source: OTHER: Chyba, że to ty przyniosłeś truciz...
de: OTHER: Es sei denn, daß Ihr das Gift gebracht hättet...
ru: OTHER: Разве только если ты принес яд...

source: OTHER: Tfu, nic nie mówiłam.
de: OTHER: Mist, ich habe nichts gesagt.
ru: OTHER: Ой, я ничего не говорила.

source: HERO: Truciznę?
de: HERO: Welches Gift?
ru: HERO: Какой яд?

source: OTHER: Och, nie najlepszy ze mnie|spiskowiec, książę.
de: OTHER: Oh weh, ich bin wohl keine gute|Verschworene, Prinz.
ru: OTHER: Ой, из меня плохой конспиратор, принц.

source: OTHER: Książę?!
de: OTHER: Prinz?!
ru: OTHER: Принц?!

source: OTHER: Na wszystkich bogów!
de: OTHER: Bei allen Göttern!
ru: OTHER: Все боги!

source: OTHER: Wyglądasz jakoś inaczej...
de: OTHER: Du siehst irgendwie verändert aus...
ru: OTHER: Ты сильно изменился...

source: HERO: To my się znamy?...
de: HERO: Kennen wir uns?
ru: HERO: Мы знакомы?

source: HERO: Zresztą, kahem, nieważne, co|z tą trucizną?
de: HERO: Naja, egal. Ähem was ist|mit dem Gift?
ru: HERO: Да без разницы. Так что там|с ядом?

source: OTHER: Och...
de: OTHER: Ach...
ru: OTHER: Ах...

source: OTHER: To tylko na szczury.
de: OTHER: ...das ist nur gegen Ratten.
ru: OTHER: Это против крыс.

source: OTHER: Nic poważnego.
de: OTHER: Nichts wichtiges.
ru: OTHER: Ничего особенного.

source: OTHER: Żadnych złych zamiarów.
de: OTHER: Keine schlechten Absichten.
ru: OTHER: Ничего я не замышлял.

source: OTHER: Zwykła dezynsekcja.
de: OTHER: Eine gewöhnliche Rattenbekämpfung.
ru: OTHER: Просто боремся с крысами.

source: HERO: A kto miał ją dostarczyć?
de: HERO: Und wer wird das Gift liefern?
ru: HERO: И кто поставляет яд?

source: OTHER: Wybacz, książę, ale to tajemnica.
de: OTHER: Verzeihen Sie mir, Prinz,|aber das ist ein Geheimnis.
ru: OTHER: Извините принц, но это - тайна.

source: HERO: A jeśli ja dam ci taką truciznę?
de: HERO: Und wenn ich Ihnen ein solches Gift gebe?
ru: HERO: А если я вам дам этот яд?

source: OTHER: Ależ nie kłopocz się książę.
de: OTHER: Aber Prinz, macht Euch keine Sorgen.
ru: OTHER: Принц, не волнуйтесь.

source: OTHER: Naprawdę nie ma potrzeby.
de: OTHER: Das ist wirklich nicht nötig.
ru: OTHER: Это совсем не важно.

source: OTHER: Posiedzę tu sobie.
de: OTHER: Ich bleibe hier nur eine Weile sitzen.
ru: OTHER: Я тут лишь чуть посижу...

source: P#OTHER: Do zobaczenia.
de: P#OTHER: Auf Wiedersehen.
ru: P#OTHER: До свидания.

source: HERO: Hmm... Do zobaczenia...
de: HERO: Hmm... Auf Wiedersehen...
ru: HERO: Хм... До свидания...

source: HERO: Słuchaj, ta trucizna może nam się|przydać.
de: HERO: Höre mal, dieses Gift kann uns noch einmal|nützlich sein.
ru: HERO: Послушай, этот яд нам может пригодиться.

source: HERO: Może damy tej kobiecie coś zastępczego,|a sami poczekamy na tego tajemniczego|dostawcę?
de: HERO: Vielleicht geben wir der Frau einen|Ersatz dafür und warten selbst auf den|geheimnisvollen Lieferanten?
ru: HERO: Может, нам самим подкараулить этих поставщиков?

source: OTHER: Hmmm... Coś w tym jest...
de: OTHER: Hmmm... Gar nicht mal so blöd...
ru: OTHER: Гм... Не глупо...

source: HERO: Na razie go nie potrzebuję.
de: HERO: Vorerst brauche ich ihn nicht.
ru: HERO: Но он нам не нужен.

source: OTHER: Nie mam zamiaru z nim walczyć.
de: OTHER: Ich habe nicht vor, mit ihm zu kämpfen.
ru: OTHER: Я не собираюсь с ним бороться.

source: OTHER: Wymyśl coś innego.
de: OTHER: Denk dir etwas anderes aus.
ru: OTHER: Придумай что-нибудь еще.

source: HERO: Na pewno nie odda go dobrowolnie.
de: HERO: Er wird ihn sicher nicht freiwillig hergeben wollen.
ru: HERO: Он вам не выдаст этого просто так.

source: HERO: Muszę wymyślić jakiś podstęp.
de: HERO: Ich muß eine List ersinnen.
ru: HERO: Мне нужно вспомнить список.

source: HERO: Wiecie czym się różni krasnolud od padłego|lisa? Zapach lisa można wytrzymać.
de: HERO: Wißt ihr, wodurch sich ein Zwerg|von einem toten Fuchs unterscheidet?|Den Fuchsgestank kann man gerade|noch aushalten.
ru: HERO: Знаете, чем отличается гном от мертвой|лисы? У лисы хоть шкурку содрать|можно...

source: HERO: Opowiem wam dowcip: do karczmy przychodzi|umyty krasnolud...
de: HERO: Ich erzähle euch einen Witz:|Ein frisch gewaschener Zwerg kommt|ins Wirtshaus...
ru: HERO: Я расскажу вам анекдот: Один|молодой гном пришел в кабак...

source: HERO: Co się tu dzieje? Trzepiecie dywany|czy to tylko mlaskanie krasnoluda?
de: HERO: Was ist denn hier los? Klopft hier jemand|einen Teppich aus oder ist das nur ein|schmatzender Zwerg?
ru: HERO: Что тут произошло? Кто-то выбивает коврик,|оказавшийся гномом?
