Repository: scummvm/scummvm
Catalog: po/residualvm/*.po
Languages: nl_nl

source: Quit ResidualVM
nl_nl: Hiermee verlaat u ResidualVM

source: About ResidualVM
nl_nl: Geeft informatie over ResidualVM

source: Change global ResidualVM options
nl_nl: Algemene ResidualVM opties

source: ResidualVM couldn't open the specified directory!
nl_nl: ResidualVM kon de opgegeven map niet openen!

source: ResidualVM could not find any game in the specified directory!
nl_nl: ResidualVM kon geen enkel spel vinden in de opgegeven map!

source: ResidualVM could not find any engine capable of running the selected game!
nl_nl: ResidualVM heeft geen engine gevonden die in staat was het geselecteerde spel te spelen!

source: Preserve aspect ratio
nl_nl: Behoud de schermverhouding

source: Preserve the aspect ratio in fullscreen mode
nl_nl: Behoud de schermverhouding bij volledig scherm

source: Enable software rendering
nl_nl: Gebruik software rendering

source: Language of ResidualVM GUI
nl_nl: Taal van de ResidualVM GUI

source: You have to restart ResidualVM before your changes will take effect.
nl_nl: U dient ResidualVM opnieuw op te starten om de wijzigingen te activeren.

source: Please, report the following data to the ResidualVM team along with name
nl_nl: Raporteer a.u.b. de volgende gegevens aan het ResidualVM team samen met de naam

source: WARNING: The game you are about to start is not yet fully supported by ResidualVM. As such, it is likely to be unstable, and any saves you make might not work in future versions of ResidualVM.
nl_nl: WAARSCHUWING: Het spel dat u wilt gaan spelen is nog niet volledig ondersteund door ResidualVM. Om die reden is het waarschijnlijk dat het spel instabiel is, en opgeslagen spellen zullen mogelijk niet werken in toekomstige versies van ResidualVM.

source: Hide ResidualVM
nl_nl: Verberg ResidualVM

source: '%s' may be corrupted. MD5: '%s'
nl_nl: Het bestand '%s' is mogelijk corrupt. MD5: '%s'

source: The game data file %s may be corrupted. If you are sure it is not please provide the ResidualVM team the following code, along with the file name, the language and a description of your game version (i.e. dvd-box or jewelcase): %s
nl_nl: Het spelbestand %s is mogelijk corrupt. Als u zeker bent dat dit niet het geval is, neem contact op met het ResidualVM team en vermeld de volgende code, samen met de bestandsnaam en een korte beschrijving van uw spel (bvb. taal en 'dvd-box' of 'jewelcase'): %s

source: Could not open %s for checking
nl_nl: Kon bestand %s niet openen voor integriteitscontrole.

source: Could not open the file %s for checking. It may be missing or you may not have the rights to open it. Go to http://wiki.residualvm.org/index.php/Datafiles to see a list of the needed files.
nl_nl: Kon bestand %s niet openen voor integriteitscontrole. Misschien ontbreekt het of u heeft niet de juiste permissies om het te openen. Ga naar http://wiki.residualvm.org/index.php/Datafiles voor een overzicht van de benodigde bestanden en bestandsstructuur

source: ResidualVM will now verify the game data files, to make sure you have the best gaming experience. This may take a while, please wait. Successive runs will not check them again.
nl_nl: ResidualVM zal nu de integriteit van uw spelbestanden nagaan, voor de beste spelervaring. Dit kan eventjes duren, maar is slechts eenmalig.

source: The original patch of Grim Fandango is missing. Please download it from http://www.residualvm.org/downloads/ and put it in the game data files directory
nl_nl: De originele patch voor Grim Fandango ontbreekt. Download deze van http://www.residualvm.org/downloads/ en plaats deze bij de spelbestanden.

source: The original patch of Escape from Monkey Island is missing. Please download it from http://www.residualvm.org/downloads/ and put it in the game data files directory. Pay attention to download the correct version according to the game's language
nl_nl: De originele patch voor Escape from Monkey Island ontbreekt. Download deze van http://www.residualvm.org/downloads/ en plaats deze bij de spelbestanden. Let erop dat u de versie downloadt voor de correcte taal.

source: residualvm-grim-patch.lab not found
nl_nl: residualvm-grim-patch.lab: bestand niet gevonden

source: Loading datausr.lab. Please note that the ResidualVM-team doesn't provide support for using such patches
nl_nl: Bezig met laden van datausr.lab. Merk op dat het ResidualVM team geen ondersteuning biedt voor zulke patches

source: %s not found
nl_nl: Bestand '%s' niet gevonden.

source: Loading datausr.m4b. Please note that the ResidualVM-team doesn't provide support for using such patches
nl_nl: Bezig met laden van datausr.m4b. Merk op dat het ResidualVM team geen ondersteuning biedt voor zulke patches

source: Cannot find game data - check configuration file
nl_nl: Kan spelbestanden niet vinden. Check het configuratiebestand.

source: This version of Myst III is encrypted with a copy-protection preventing ResidualVM from reading required data. Please replace your 'M3.exe' file with the one from the official update corresponding to your game's language and redetect the game. These updates don't contain the copy-protection and can be downloaded from http://www.residualvm.org/downloads/
nl_nl: Deze versie van Myst III is kopieerbeveiligd, waardoor ResidualVM benodigde data niet kan uitlezen. Vervang 'M3.exe' met een kopie van de officiële update die overeenkomt met de taal van uw spel, en laat het spel opnieuw detecteren. De updates zijn vrij van kopieerbeveiliging en kunnen gedownload worden op http://www.residualvm.org/downloads/
