Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: ## Keyboard shortcuts ScummVM supports various in-game keyboard and mouse shortcuts, and since version 2.2.0 these can be manually configured in the **Keymaps tab**, or in the **configuration file**. For game-specific controls, see the [wiki entry](https://wiki.scummvm.org/index.php?title=Category:Supported_Games) for the game you are playing. Default shortcuts are shown in the table. | Shortcut | Description | --------------|------------------ | `Ctrl+F5` | Displays the Global Main Menu
hu_hu: ## Billentyű kombinációk A ScummVM különféle játékon belüli billentyű és egér kombinációkat támogat, a 2.2.0-s verzió óta beállíthatóak a **Gombkiosztás fülön**, vagy a **konfigurációs fájlban**. A játék specifikus kiosztáshoz keresse fel [wiki bejegyzésünket](https://wiki.scummvm.org/index.php?title=Category:Supported_Games), és tekintse meg a kívánt játékot. Alapértelmezett kombinációk láthatóak a táblában. | Kombináció | Leírás | --------------|------------------ | `Ctrl+F5` | Az átfogó Fő Menü megjelenítése
ko: ## 키보드 단축키 ScummVM은 다양한 게임 내 키보드 및 마우스 단축키를 지원하며, 버전 2.2.0부터 **키맵 탭** 또는 **구성 파일**에서 수동으로 구성할 수 있습니다. 게임별 컨트롤은 플레이 중인 게임의 [위키 항목](https://wiki.scummvm.org/index.php?title=Category:Supported_Games)을 참조하세요. 기본 단축키는 표에 나와 있습니다. | 단축키 | 설명 | --------------|------------------ | `Ctrl+F5` | 글로벌 메인 메뉴 표시
sv_se: ## Kortkommandon för tangentbord ScummVM stöder olika kortkommandon för tangentbord och mus i spelet, och sedan version 2.2.0 kan dessa konfigureras manuellt i fliken **Tangentuppsättningar** eller i konfigurationsfilen **. För spelspecifika kontroller, se [wiki-posten](https://wiki.scummvm.org/index.php?title=Category:Supported_Games) för det spel du spelar. Standardgenvägar visas i tabellen. | Kortkommando | Beskrivning | --------------|------------------ | `Ctrl+F5` | Visar den globala huvudmenyn

source: | `Cmd+q` | Quit (macOS)
hu_hu: | `Cmd+q` | Kilépés (macOS)
ko: | `Cmd+q` | 종료 (macOS)
sv_se: | `Cmd+q` | Avsluta (macOS)

source: | `Alt+F4` | Quit (Windows)
hu_hu: | `Alt+F4` | Kilépés (Windows)
ko: | `Alt+F4` | 종료 (윈도우즈)
sv_se: | `Alt+F4` | Avsluta (Windows)

source: | `Ctrl+q` | Quit (Linux/Unix)
hu_hu: | `Ctrl+q` | Kilépés (Linux/Unix)
ko: | `Ctrl+q` | 종료 (리눅스/유닉스)
sv_se: | `Ctrl+q` | Avsluta (Linux/Unix)

source: | `Ctrl+z` | Quit (other platforms)
hu_hu: | `Ctrl+z` | Kilépés (más platformok)
ko: | `Ctrl+z` | 종료 (기타 플랫폼)
sv_se: | `Ctrl+z` | Avsluta (andra plattformar)

source: | `Ctrl+u` | Mutes all sounds | `Ctrl+m` | Toggles mouse capture | `Ctrl+Alt` and `9` or `0` | Cycles forwards/backwards between graphics filters | `Ctrl+Alt` and `+` or `-` | Increases/decreases the scale factor | `Ctrl+Alt+a` | Toggles aspect ratio correction on/off | `Ctrl+Alt+f` | Toggles between nearest neighbor and bilinear interpolation (graphics filtering on/off) | `Ctrl+Alt+s` | Cycles through stretch modes | `Alt+Enter` | Toggles full screen/windowed mode | `Alt+s` | Takes a screenshot | `Ctrl+F7` | Opens virtual keyboard (if enabled). This can also be opened with a long press of the middle mouse button or wheel. | `Ctrl+Alt+d` | Opens the ScummVM debugger
hu_hu: | `Ctrl+u` | Minden hang némítása | `Ctrl+m` | Egér felvétel ki/be kapcsolása | `Ctrl+Alt` és `9` vagy `0` | Grafikus filterek közötti váltás | `Ctrl+Alt` és `+` vagy `-` | Növeli/Csökkenti a méretezési tényezőt | `Ctrl+Alt+a` | Képarány korrekció ki/be kapcsolása | `Ctrl+Alt+f` | Közeli szomszédos pixel és bilineáris interpoláció közötti váltás (grafikus filterezés be/ki) | `Ctrl+Alt+s` | Végigvált az összes széthúzási módon | `Alt+Enter` | Teljes/Ablakos mód közötti váltás | `Alt+s` | Képernyőkép készítése | `Ctrl+F7` | Virtuális billentyű megnyitása (ha be van kapcsolva). Ez megnyitható a középső egérgomb hosszú nyomásával. | `Ctrl+Alt+d` | A ScummVM debugger megnyitása
ko: | `Ctrl+u` | 모든 사운드 음소거 | `Ctrl+m` | 마우스 캡처 전환 | `Ctrl+Alt` 및 `9` 또는 `0` | 그래픽 필터 사이를 앞뒤로 순환 | `Ctrl+Alt` 및 `+` 또는 `-` | 스케일 팩터 증가/감소 | `Ctrl+Alt+a` | 화면비 교정 켜기/끄기 | `Ctrl+Alt+f` | 최근접 보간과 이중선형 보간 사이 전환 (그래픽 필터링 켜기/끄기) | `Ctrl+Alt+s` | 눌리기 모드 순환 | `Alt+Enter` | 전체 화면/창 모드 전환 | `Alt+s` | 스크린샷 찍기 | `Ctrl+F7` | 가상 키보드 열기(활성화된 경우). 마우스 가운데 버튼이나 휠을 길게 눌러서 열 수도 있습니다. | `Ctrl+Alt+d` | ScummVM 디버거 열기
sv_se: | Ctrl+u | Tystar alla ljud | `Ctrl+m` | Växlar till musfångst | `Ctrl+Alt` och `9` eller `0` | Växlar framåt/bakåt mellan grafikfilter | `Ctrl+Alt` och `+` eller `-` | Ökar/minskar skalfaktorn | `Ctrl+Alt+a` | Slår på/av korrigering av bildförhållande | `Ctrl+Alt+f` | Växlar mellan närmaste granne och bilinjär interpolation (grafikfiltrering på/av) | `Ctrl+Alt+s` | Växlar genom utsträckningslägen | `Alt+Enter` | Växlar mellan helskärms- och fönsterläge | `Alt+s` | Tar en skärmbild | `Ctrl+F7` | Öppnar virtuellt tangentbord (om aktiverat). Detta kan också öppnas med en lång tryckning på musens mittknapp eller hjul. | `Ctrl+Alt+d` | Öppnar ScummVM-felsökaren

source: Hide ScummVM
hu_hu: ScummVM elrejtése
ko: ScummVM 숨기기
sv_se: Dölj ScummVM

source: Hide Others
hu_hu: Többi elrejtése
ko: 기타 숨기기
sv_se: Dölj övriga

source: Show All
hu_hu: Mind mutatása
ko: 모두 표시
sv_se: Visa alla

source: Window
hu_hu: Ablak
ko: 윈도우
sv_se: Fönster

source: Minimize
hu_hu: Kis méret
ko: 최소화
sv_se: Minimera

source: Help
hu_hu: Súgó
ko: 도움말
sv_se: Hjälp

source: User Manual
hu_hu: Felhasználói útmutató
ko: 사용자 매뉴얼
sv_se: Användarhandbok

source: General Information
hu_hu: Általános információ
ko: 일반 정보
sv_se: Allmän information

source: What's New in ScummVM
hu_hu: A ScummVM újdonságai
ko: ScummVM의 새로운 기능
sv_se: Vad är nytt i ScummVM

source: Credits
hu_hu: Közreműködők
ko: 크레딧
sv_se: Eftertexter

source: GPL License
hu_hu: GPL Licensz
ko: GPL 라이선스
sv_se: GPL-licens

source: LGPL License
hu_hu: LGPGL Licensz
ko: LGPL 라이선스
sv_se: LGPL-licens

source: OFL License
hu_hu: OFL Licensz
ko: OFL 라이선스
sv_se: OFL-licens

source: BSD License
hu_hu: BSD Licensz
ko: BSD 라이선스
sv_se: BSD-licens

source: Apache License
hu_hu: Apache Licensz
ko: 아파치 라이선스
sv_se: Apache-licens

source: BSL License
hu_hu: BSL Licensz
ko: BSL 라이선스
sv_se: BSL-licens

source: GLAD License
hu_hu: GLAD Licensz
ko: GLAD 라이선스
sv_se: GLAD-licens

source: ISC License
hu_hu: ISC Licensz
ko: ISC 라이선스
sv_se: ISC-licens

source: Lua License
hu_hu: Lua Licensz
ko: Lua 라이선스
sv_se: Lua-licens

source: MIT License
hu_hu: MIT Licensz
ko: MIT 라이선스
sv_se: MIT-licens

source: MKV License
hu_hu: MKV Licensz
ko: MKV 라이선스
sv_se: MKV-licens

source: MPL License
hu_hu: MPL Licensz
ko: MPL 라이선스
sv_se: MPL-licens

source: TinyGL License
hu_hu: TinyGL Licensz
ko: TinyGL 라이선스
sv_se: TinyGL-licens

source: Catharon License
hu_hu: Catharon Licensz
ko: Catharon 라이선스
sv_se: Catharon-licens

source: Menu
hu_hu: Menü
ko: 메뉴
sv_se: Meny

source: Left Stick X
hu_hu: Bal Kar X
ko: 왼쪽 스틱 X
sv_se: Vänsterspak X

source: Left Stick Y
hu_hu: Bal Kar Y
ko: 왼쪽 스틱 Y
sv_se: Vänsterspak Y

source: Cross
hu_hu: Kereszt
ko: 엑스 버튼
sv_se: Kryss

source: Circle
hu_hu: Kör
ko: 원 버튼
sv_se: Cirkel

source: Square
hu_hu: Négyzet
ko: 네모 버튼
sv_se: Fyrkant

source: Right Stick X
hu_hu: Jobb Kar X
ko: 오른쪽 스틱 X
sv_se: Högerspak X

source: Right Stick Y
hu_hu: Jobb Kar Y
ko: 오른쪽 스틱 Y
sv_se: Högerspak Y

source: Current video mode:
hu_hu: Jelenlegi videómód:
ko: 현재 비디오 모드:
sv_se: Aktuellt videoläge:

source: Double-strike
hu_hu: Dupla-csapás
ko: 더블 스트라이크
sv_se: Ej sammanflätad

source: Horizontal underscan:
hu_hu: Vízszintes alul-pásztázás:
ko: 수평 언더스캔:
sv_se: Vågrät underskanning:

source: Vertical underscan:
hu_hu: Függőleges alul-pásztázás:
ko: 수직 언더스캔:
sv_se: Vertikal underskanning:

source: Input
hu_hu: Bemeneti jel
ko: 입력
sv_se: Inmatning

source: GC Pad sensitivity:
hu_hu: GC Pad érzékenység:
ko: 게임큐브 패드 감도:
sv_se: GC Pad-känslighet:

source: Unknown
hu_hu: Ismeretlen
ko: 알 수 없음
sv_se: Okänd

source: Mount DVD
hu_hu: DVD mountolása
ko: DVD 마운트
sv_se: Montera DVD

source: Unmount DVD
hu_hu: DVD ki-mountolása
ko: DVD 마운트 해제
sv_se: Avmontera DVD

source: Share:
hu_hu: Megosztás:
ko: 공유:
sv_se: Utdelning:

source: Password:
hu_hu: Jelszó:
ko: 비밀번호:
sv_se: Lösenord:

source: Init network
hu_hu: Hálózat inicializálás
ko: 네트워크 초기화
sv_se: Init. nätverk

source: Mount SMB
hu_hu: SMB mountolása
ko: SMB 마운트
sv_se: Montera SMB

source: Unmount SMB
hu_hu: SMB ki-mountolása
ko: SMB 마운트 해제
sv_se: Avmontera SMB

source: DVD Mounted successfully
hu_hu: DVD sikeresen mountolva
ko: DVD 마운트 성공
sv_se: Montering av dvd lyckades

source: Error while mounting the DVD
hu_hu: Hiba a DVD mountolásakor
ko: DVD를 마운트 하는데 오류 발생
sv_se: Fel vid montering av DVD

source: DVD not mounted
hu_hu: DVD nem mountolva
ko: DVD 마운트 안 됨
sv_se: DVD inte monterad

source: Network up, share mounted
hu_hu: Hálózat működik, mountolt megosztása
ko: 네트워크 연결, 공유 폴더 마운트됨
sv_se: Nätverket är aktivt, delade kataloger monterade

source: Network up
hu_hu: Hálózat működik
ko: 네트워크 연결
sv_se: Nätverket är aktivt

source: , error while mounting the share
hu_hu: , hiba a megosztás mountolásakor
ko: , 공유 폴더 마운트 중 오류 발생
sv_se: , fel under montering av delade kataloger

source: , share not mounted
hu_hu: , megosztás nincs mountolva
ko: , 공유 폴더 마운트되지 않음
sv_se: , utdelning inte monterad

source: Network down
hu_hu: Nincs hálózat
ko: 네트워크 실패
sv_se: Nätverket är frånkopplat

source: Initializing network
hu_hu: Hálózat inicializálása
ko: 네트워크 초기화 중
sv_se: Initierar nätverk

source: Timeout while initializing network
hu_hu: Időtúllépés a hálózat inicializálásakor
ko: 네트워크 초기화 시간 초과
sv_se: Tidsgräns överstegs vid initiering av nätverk

source: Network not initialized (%d)
hu_hu: Hálózat nincs inicializálva (%d)
ko: 네트워크 초기화 안 됨 (%d)
sv_se: Nätverket är inte initierat (%d)

source: Launcher
hu_hu: Indítópult
ko: 런처
sv_se: Spelstartaren

source: Check for Updates...
hu_hu: Frissítések keresése...
ko: 업데이트 확인 중...
sv_se: Leta efter uppdateringar...

source: Default keymappings
hu_hu: Alapértelmezett kiosztások
ko: 기본 키맵핑
sv_se: Standardkortkommandon

source: Move / Interact / Skip
sv_se: Flytta / Interagera / Hoppa över

source: Skip movie
sv_se: Hoppa över film

source: Move up
hu_hu: Mozgás fel
ko: 위로 이동
sv_se: Flytta uppåt

source: Move down
hu_hu: Mozgás le
ko: 아래로 이동
sv_se: Flytta neråt

source: Move left
hu_hu: Mozgás balra
ko: 왼쪽으로 이동
sv_se: Flytta åt vänster

source: Move right
hu_hu: Mozgás jobbra
ko: 오른쪽으로 이동
sv_se: Flytta åt höger

source: Move up-left
hu_hu: Mozgás bal-felfelé
ko: 왼쪽 위로 이동
sv_se: Flytta upp till vänster

source: Move up-right
hu_hu: Mozgás jobb-felfelé
ko: 오른쪽 위로 이동
sv_se: Flytta upp till höger

source: Move down-left
hu_hu: Mozgás bal-lefele
ko: 왼쪽 아래로 이동
sv_se: Flytta ner till vänster

source: Move down-right
hu_hu: Mozgás jobb-lefele
ko: 오른쪽 아래로 이동
sv_se: Flytta ner till höger

source: Look
hu_hu: Megnéz
ko: 보기
sv_se: Titta

source: Open
hu_hu: Kinyit
ko: 열기
sv_se: Öppna

source: Get
hu_hu: Vesz
ko: 얻기
sv_se: Ta emot

source: Use
hu_hu: Használ
ko: 사용하기
sv_se: Använd

source: Goto
sv_se: Gå till

source: Talk
hu_hu: Beszél
ko: 대화하기
sv_se: Tala

source: Travel
hu_hu: Utazás
ko: 여행하기
sv_se: Res

source: Take
hu_hu: Tesz
ko: 잡기
sv_se: Ta

source: Inventory
hu_hu: Felszerelés
ko: 인벤토리
sv_se: Inventarie

source: Climb
sv_se: Klättra

source: Walk
hu_hu: Megy
ko: 걷기
sv_se: Gå

source: Open save/load menu
sv_se: Öppna menyn för spara/läs in

source: Unable to locate the '%s' engine data file.
hu_hu: Nem található a(z) '%s' motor adat fájlja.
ko: '%s' 엔진 데이터 파일을 찾을 수 없습니다.
sv_se: Kunde inte hitta spelmotorns datafil '%s'.

source: The '%s' engine data file is corrupt.
hu_hu: A(z) '%s' motor adatfájlja hibás.
ko: '%s' 엔진 데이터 파일이 손상되었습니다.
sv_se: Datafilen '%s' är skadad.

source: Incorrect version of the '%s' engine data file found. Expected %d.%d but got %d.%d.
hu_hu: A '%s' motor adat hibás verziója található. Az elvárt %d.%d helyett %d.%d verziószámú.
ko: '%s' 엔진 데이터 파일 버전이 잘못되었습니다. 필요한 버전: %d.%d, 실제 버전: %d.%d.
sv_se: Felaktig version av datafilen '%s' hittades. Version %d.%d krävs, hittade %d.%d.

source: TV emulation
hu_hu: TV emuláció
ko: TV 에뮬레이션
sv_se: TV-emulering

source: Emulate composite output to an NTSC TV
hu_hu: Kompozit kimenet emulációja NTSC TV-n
ko: NTSC TV로의 컴포지트 출력을 에뮬레이트
sv_se: Emulera kompositutgång till en NTSC-TV

source: Color graphics
hu_hu: Színes grafikák
ko: 컬러 그래픽
sv_se: Färggrafik

source: Use color graphics instead of monochrome
hu_hu: Színes grafika használata monokróm helyett
ko: 흑백 대신 컬러 그래픽을 사용
sv_se: Använd färggrafik istället för monokrom

source: Show scanlines
hu_hu: Pásztázó vonalak megjelenítés
ko: 스캔라인 표시
sv_se: Visa scanlines

source: Darken every other scanline to mimic the look of a CRT
hu_hu: Minden második pásztázó vonal sötétítése a CRT stílus eléréséhez
ko: CRT의 화면 출력을 모방하기 위해 모든 스캔라인을 어둡게 함
sv_se: Förmörka varannan scanline för att härma utseendet hos en CRT

source: Always use sharp monochrome text
hu_hu: Mindig éles monokróm szöveg használata
ko: 항상 또렷한 흑백 텍스트를 사용
sv_se: Använd alltid skarp monokrom text

source: Do not emulate NTSC artifacts for text
hu_hu: Ne emulálja az NTSC torzítást a szöveghez
ko: 텍스트에 NTSC 아티팩트를 에뮬레이션하지 않음
sv_se: Emulera inte NTSC-artifakter för text

source: Use checkered cursor
hu_hu: kockás kurzor használata
ko: 체크무늬 커서 사용
sv_se: Använd rutig markör

source: Use the checkered cursor from later Apple II models
hu_hu: A későbbi Apple II modelles kockás kurzor használata
ko: 후기 애플 II 모델의 체크 무늬 커서를 사용
sv_se: Använd den rutiga markören från senare Apple II-modeller

source: Enable Text to Speech
hu_hu: Szövegből beszéd engedélyezése
ko: TTS 활성화
sv_se: Aktivera text till tal

source: Use TTS to read text in the game (if TTS is available)
hu_hu: Használjon TTS-t a játék szövegek olvasásához (ha a TTS elérhető)
ko: TTS를 사용하여 게임 텍스트 읽기 (TTS가 가능한 경우)
sv_se: Använd TTT för att läsa text i spelet (om TTT är tillgängligt)

source: Early AGI games for Tandy Color Computer are not yet supported.
hu_hu: A Tandy Color számítógéphez készült korai AGI játékok még nem támogatottak.
ko: 탠디 컬러 컴퓨터용 초기 AGI 게임은 아직 지원되지 않습니다.
sv_se: Tidiga AGI-spel för Tandy Color Computer stöds inte än.

source: Could not open/use file 'hgc_font' for Hercules hires font. If you have such file in other AGI (Sierra) game, you can copy it to the game directory
hu_hu: Nem sikerült megnyitni/használni a 'hgc_font' fájlt, a Hercules betűtípushoz. Ha van ilyen fájl más AGI (Sierra) játékban, akkor átmásolhatja a játék könyvtárába
ko: 허큘리스 고해상도 글꼴에 대한 파일 'hgc_font'를 열거나 사용할 수 없습니다. 다른 AGI(시에라) 게임에 해당 파일이 있는 경우, 게임 디렉터리에 복사할 수 있음
sv_se: Kunde inte öppna använda filen 'hgc_font' för Herculer högupplöst typsnitt. Om du har en sådan fil i andra AGI-spel (Sierra), kan du kopiera den till spelkatalogen

source: Use original save/load screens
hu_hu: Eredeti mentés/töltés képernyők használata
ko: 원본 저장/불러오기 화면 사용
sv_se: Använd originalskärmar för spara/läs in

source: Use the original save/load screens instead of the ScummVM ones
hu_hu: Az Eredeti mentés/betöltés képernyő használata a ScummVM helyett
ko: ScummVM의 화면 대신 원본 저장/불러오기 화면을 사용
sv_se: Använd originalskärmarna för läs in och spara istället för ScummVM:s egna

source: Use an alternative palette
hu_hu: Alternatív paletta használata
ko: 대체 팔레트 사용
sv_se: Använd alternativ palett

source: Use an alternative palette, common for all Amiga games. This was the old behavior
hu_hu: Alternatív paletta használata, népszerű volt az Amiga játékoknál. Ez volt a régi működési mód
ko: 모든 아미가 게임에서, 공통적인 대체 팔레트를 사용합니다. 이것은 이전의 동작 방식임
sv_se: Använd en alternativ färgkarta typisk för alla Amiga-spel. Det här är det gamla beteendet

source: Mouse support
hu_hu: Egér támogatás
ko: 마우스 지원
sv_se: Musstöd

source: Enables mouse support. Allows to use mouse for movement and in game menus.
hu_hu: Egérmód engedélyezése. Lehetővé teszi az egérrel való mozgatást játékban és a játékmenükben.
ko: 마우스 지원을 활성화합니다. 마우스를 사용하여 이동하고 게임 내 메뉴를 사용할 수 있습니다.
sv_se: Aktiverar musstöd. Möjliggör användning av musen för rörelser och i spelmenyer.

source: Predictive Input Dialog on mouse click
hu_hu: Prediktív beviteli párbeszédpanel egér kattintásnál
ko: 마우스 클릭 시 예측 입력 대화 상자
sv_se: Förutseende inmatningsdialog vid musklick

source: Enables the assistive Predictive Input Dialog specifically for when clicking the left mouse button within text input fields. The Predictive Input Dialog can still be activated on demand if there's a specified key mapping for it
hu_hu: Kifejezetten a szövegdobozra való kattintáskor kapcsolja be a kisegítő Prediktív Beviteli Párbeszédpanelt. A Prediktív Beviteli Párbeszédpanel külön is bekapcsolható ha van beállítva hozzá billentyű kombináció
ko: 텍스트 입력 필드 내에서 왼쪽 마우스 버튼을 클릭할 때 특히 유용한 예측 입력 대화 상자를 활성화합니다. 지정된 키 매핑이 있는 경우 예측 입력 대화 상자는 여전히 필요에 따라 활성화될 수 있음
sv_se: Aktiverar hjälpmedlet Förutseende inmatning specifikt för när du klickar på vänster musknapp i inmatningsfält för text. Dialogen Förutseende inmatning kan fortfarande aktiveras på begäran om det finns en angiven tangentmappning för den

source: Use Hercules hires font
hu_hu: Hercules magas felbontású font használata
ko: 허큘리스 고해상도 글꼴 사용
sv_se: Använd högupplöst typsnitt för Hercules

source: Uses Hercules hires font, when font file is available.
hu_hu: Hercules nagy felbontású font használata, ha a font fájl elérhető.
ko: 글꼴 파일을 사용할 수 있는 경우, 허큘리스 고해상도 글꼴을 사용합니다.
sv_se: Använd högupplöst Herkules-typsnitt när typsnittsfilen är tillgänglig.

source: Pause when entering commands
hu_hu: Szünet a parancsok beírásakor
ko: 명령어 입력시 일시 정지
sv_se: Pausa spelet när du skriver in kommandon

source: Shows a command prompt window and pauses the game (like in SCI) instead of a real-time prompt.
hu_hu: Megjelenít egy parancssort és szünetelteti a játékot (hasonlóan az SCI-hez) a valós idejű parancssor helyett.
ko: 실시간 프롬프트 대신 명령어 프롬프트 창을 표시하고 게임을 일시 정지합니다 (SCI와 유사).
sv_se: Visar ett fönster med en textruta och pausar spelet (som i SCI-spel) istället för inmatning i realtid.

source: Add speed menu
hu_hu: Sebesség menü hozzáadás
ko: 속도 메뉴 추가
sv_se: Lägg till hastighetsmeny

source: Add game speed menu (similar to PC version)
hu_hu: Játéksebesség-menü hozzáadása (hasonlóan a PC verzióhoz)
ko: 속도 메뉴를 추가합니다. (PC 버전과 유사)
sv_se: Lägg till spelhastighetsmeny (liknandes PC-versionen)

source: Enable copy protection
hu_hu: Másolásvédelem engedélyezése
ko: 복사 방지 기능 활성화
sv_se: Aktivera kopieringsskydd

source: Enable any copy protection that would otherwise be bypassed by default.
hu_hu: Bármilyen másolásvédelem engedélyezése, ami máskülönben átugrásra került volna.
ko: 기본적으로 우회되는 모든 복사 방지 기능을 활성화합니다.
sv_se: Aktivera kopieringsskydd som annars skulle ha överhoppats som standard.

source: Use PCjr's sound chip in 16-bit shift mode
sv_se: Använd PCjrs ljudchip i 16-bitars shift-läge

source: In PCjr sound mode, emulate a non-standard SN76496 sound chip, similar to chips found in SEGA Master System consoles. Allows certain music effects, especially in fanmade games, but original Sierra music designed strictly for PCjr may sound wrong.
sv_se: I PCjr-ljudläge emuleras ett icke-standardiserat SN76496-ljudchip, liknande de chip som finns i SEGA Master System-konsoler. Tillåter vissa musikeffekter, särskilt i fanmade spel, men original Sierra-musik som utformats enbart för PCjr kan låta fel.

source: This game does not support loading
hu_hu: Ez a játék nem támogatja a betöltést
ko: 이 게임은 불러오기를 지원하지 않음
sv_se: Detta spel har inte stöd för inläsning

source: This game does not support saving
hu_hu: Ez a játék nem támogatja a mentést
ko: 이 게임은 저장을 지원하지 않음
sv_se: Detta spel har inte stöd för sparning

source: Restore game:
hu_hu: Játékmenet visszaállítása:
ko: 게임 복원:
sv_se: Återställ spel:

source: Restore
hu_hu: Visszaállítás
ko: 복원
sv_se: Återställ

source: Cutscene file '%s' not found!
hu_hu: '%s' átvezető fájl nem található!
ko: '%s' 컷씬 파일을 찾을 수 없습니다!
sv_se: Mellansekvensfilen '%s' hittades inte!

source: AdLib OPL3 mode
hu_hu: AdLib OPL3 mód
ko: 애드립 OPL3 모드
sv_se: AdLib OPL3-läge

source: When AdLib is selected, OPL3 features will be used. Depending on the game, this will prevent cut-off notes, add extra notes or instruments and/or add stereo.
hu_hu: Ha az AdLib van kiválasztva, az OPL3 funkcióit használja a rendszer. A játéktól függően ez megakadályozza a hangok levágását, további hangjegy vagy hangszereket lejátszását, és/vagy sztereó effektet.
ko: 애드립을 선택하면 OPL3 기능이 사용됩니다. 게임에 따라 음표가 끊어지는 것을 방지하고, 추가 음표나 악기를 추가하고, 스테레오를 추가할 수 있습니다.
sv_se: När AdLib är valt kommer OPL3-funktioner att användas. Beroende på spelet kommer detta att förhindra avbrutna toner, lägga till extra toner eller instrument och/eller lägga till stereo.

source: Use DOS version music tempos
hu_hu: Használjon DOS verziójú zenei tempókat
ko: 도스 버전 음악 템포 사용
sv_se: Använd musiktempot från DOS-version

source: Selecting this option will play the music using the tempos used by the DOS version of the game. Otherwise, the faster tempos of the Windows version will be used.
hu_hu: Ha ezt az opciót választja, akkor a zene a játék DOS-os verziója által diktált tempóval fog lejátszódni. Ellenkező esetben a Windows-verzió gyorsabb tempója kerül felhasználásra.
ko: 이 옵션을 선택하면 도스 버전의 게임에서 사용하는 템포를 사용하여 음악이 재생됩니다. 그렇지 않으면 윈도우즈 버전의 더 빠른 템포가 사용됩니다.
sv_se: När denna inställning är vald kommer musiken att spelas med de tempon som användas i DOS-versionen av spelet. Annars kommer snabbare tempon från Windows-versionen att användas.

source: Prefer digital sound effects
hu_hu: Digitális hangeffektusok preferálása
ko: 디지털 사운드 효과 선호
sv_se: Föredra digitala ljudeffekter

source: Prefer digital sound effects instead of synthesized ones
hu_hu: Digitális hanghatások előnyben részesítése a szintetizáltakkal szemben
ko: 합성 음원 대신 디지털 사운드 효과 선호
sv_se: Föredra digitala ljudeffekter istället för syntetiserade

source: Disable fade-out effects
hu_hu: Az elhalkuló effektek tiltása
ko: 페이드아웃 효과 비활성화
sv_se: Inaktivera uttoningseffekter

source: Don't fade every screen to black when leaving a room.
hu_hu: Ne sötétítse el a képet a szoba elhagyásakor.
ko: 룸을 나갈 때 모든 화면이 어두워지지 않도록 하세요.
sv_se: Tona inte ut varje skärm till svart när ett rum lämnas.

source: MIDI mode:
hu_hu: MIDI mód:
ko: 미디 모드:
sv_se: MIDI-läge:

source: When using external MIDI devices (e.g. through USB-MIDI), select your device here
hu_hu: Külső MIDI-eszköz használatakor (pl. USB-MIDI-n keresztül), itt válassza ki eszközét
ko: 외부 미디 장치(예: USB-미디)를 사용하는 경우, 여기에서 장치를 선택
sv_se: Vid användning av externa MIDI-enheter (t.ex. via USB-MIDI) väljer du enheten här

source: AGOS 2 support is not compiled in
hu_hu: AGOS 2 támogatás nincs lefordítva
ko: AGOS 2 지원은 컴파일되지 않았음
sv_se: Stöd för AGOS 2 har inte kompilerats in

source: AGOS main
hu_hu: Fő AGOS
ko: AGOS 메인
sv_se: Huvudsakliga för AGOS

source: Game keymappings
hu_hu: Játék gombkiosztások
ko: 게임 키맵핑
sv_se: Kortkommandon för spel

source: Yes/No keymapping
hu_hu: Igen/Nem gombkiosztás
ko: 예/아니요 키맵핑
sv_se: Tangentmappning för Ja/Nej

source: Exit cutscene
hu_hu: Bevezető átugrása
ko: 컷씬 나가기
sv_se: Avsluta mellansekvens

source: Music volume down
hu_hu: Zene hangerő le
ko: 음악 볼륨 줄임
sv_se: Musikvolym ner

source: Music volume up
hu_hu: Zene hangerő fel
ko: 음악 볼륨 높임
sv_se: Musikvolym upp

source: Toggle music on / off
sv_se: Växla musik på/av

source: Toggle sound effects on / off
sv_se: Växla ljudeffekter på/av

source: Toggle fast mode on / off
sv_se: Växla snabbläge på/av

source: Walk forward
hu_hu: Előre séta
ko: 앞으로 가기
sv_se: Gå framåt

source: Turn backward
hu_hu: Hátrafordulás
ko: 뒤로 돌아가기
sv_se: Vänd bakåt

source: Turn left
hu_hu: Balra fordulás
ko: 왼쪽으로
sv_se: Sväng vänster

source: Turn right
hu_hu: Jobbra fordulás
ko: 오른쪽으로
sv_se: Sväng höger

source: Toggle fight mode
sv_se: Växla slåssläge

source: Text speed - Fast
hu_hu: Szöveg sebesség - Gyors
ko: 문장 속도 - 빠름
sv_se: Texthastighet - Snabb

source: Text speed - Medium
hu_hu: Szöveg sebesség - Közepes
ko: 문장 속도 - 중간
sv_se: Texthastighet - Medel

source: Text speed - Slow
hu_hu: Szöveg sebesség - Lassú
ko: 문장 속도 - 느림
sv_se: Texthastighet - Långsam
