Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: Spell level 1
sv_se: Besvärjelse nivå 1

source: Spell level 2
sv_se: Besvärjelse nivå 2

source: Spell level 3
sv_se: Besvärjelse nivå 3

source: Spell level 4
sv_se: Besvärjelse nivå 4

source: Spell level 5
sv_se: Besvärjelse nivå 5

source: Spell level 6
sv_se: Besvärjelse nivå 6

source: Show map
hu_hu: Térkép megjelenítés
ko: 지도 표시
sv_se: Visa karta

source: Slide left
sv_se: Glid vänster

source: Slide right
sv_se: Glid höger

source: Options
hu_hu: Opciók
ko: 옵션
sv_se: Alternativ

source: Choose spell
sv_se: Välj besvärjelse

source: The following original saved game file has been found in your game path: %s %S Do you wish to use this saved game file with ScummVM?
hu_hu: A következő eredeti fájlmentást található a játék elérési útvonalán: %s %S Kívánja ezt használni a ScummVM-en keresztül?
ko: 다음의 원본 저장된 게임 파일이 게임 경로에서 발견되었습니다: %s %S 이 저장된 게임 파일을 ScummVM에서 사용하겠습니까?
sv_se: Följande originalsparfil hittades i sökvägen för ditt spel: %s %S Vill du använda den här spardatan med ScummVM?

source: A saved game file was found in the specified slot %d. Overwrite?
hu_hu: Egy mentés találtunk a meghatározott %d slotban. Felülírja?
ko: 지정된 슬롯 %d에서 저장된 게임 파일이 발견되었습니다. 덮어쓰겠습니까?
sv_se: En sparfil hittades på den angivna platsen %d. Vill du skriva över den?

source: %d original saved games have been successfully imported into ScummVM. If you want to manually import original saved game later you will need to open the ScummVM debug console and use the command 'import_savefile'.
hu_hu: Sikeresen importáltunk %d eredeti mentést a ScummVM-be. Ha kézi módszerrel akar importálni eredeti mentéseket, akkor meg kell nyitnia a ScummVM hibakereső konzolt és az 'import_savefile' parancsolt használnia.
ko: %d 개의 원본 저장된 게임이 성공적으로 ScummVM에 가져왔습니다. 나중에 원본 저장된 게임을 수동으로 가져오려면 ScummVM 디버그 콘솔을 열고 'import_savefile' 명령을 사용해야 합니다.
sv_se: %d originalspardata har importerats till ScummVM. Om du vill importera originalspardata manuellt måste du öppna debuggkonsolen och använda kommandot 'import_savefile'.

source: This AMIGA version requires the following font files: EOBF6.FONT EOBF6/6 EOBF8.FONT EOBF8/8 If you used the original installer for the installation these files should be located in the AmigaDOS system 'Fonts/' folder. Please copy them into the EOB game data directory.
hu_hu: Ez az AMIGA verzió a következő betűtípus fájlokat igényli: EOBF6.FONT EOBF6/6 EOBF8.FONT EOBF8/8 Ha az eredeti telepítőt használta a telepítéshez, ezek a fájlok az AmigaDOS rendszer 'Fonts/' mappájában találhatóak. Kérem, másolja ezeket az EOB játék mappájába.
ko: 이 아미가 버전에는 다음 글꼴 파일이 필요합니다: EOBF6.FONT EOBF6 / 6 EOBF8.FONT EOBF8 / 8 설치에 원래 설치 프로그램을 사용한 경우 이 파일은 AmigaDOS 시스템 'Fonts/' 폴더에 있어야 합니다. EOB 게임 데이터 디렉터리에 복사하세요.
sv_se: Denna AMIGA-version kräver följande teckensnittsfiler: EOBF6.FONT EOBF6/6 EOBF8.FONT EOBF8/8 Om du använde det ursprungliga installationsprogrammet för installationen ska dessa filer ligga i AmigaDOS-systemets "Fonts/"-mapp. Kopiera dem till EOB-spelets datakatalog.

source: This AMIGA version requires the following font files: EOBF6.FONT EOBF6/6 EOBF8.FONT EOBF8/8 This is a localized (non-English) version of EOB II which uses language specific characters contained only in the specific font files that came with your game. You cannot use the font files from the English version or from any EOB I game which seems to be what you are doing. The game will continue, but the language specific characters will not be displayed. Please copy the correct font files into your EOB II game data directory.
hu_hu: Ehhez az AMIGA verzióhoz a következő betűtípus fájlok szükségesek: EOBF6.FONT EOBF6/6 EOBF8.FONT EOBF8/8 Ez az EOB II egy fordított (nem angol) verziója, mely nyelv specifikus karaktereket tartalmaz amit csak a játékhoz tartozó betűtípus fájlokkal tud használni. Nem használhatja a betűtípus fájlokat a már korábban lefordított EOB I játékához, és úgy tűnik jelenleg ezt akarja tenni. A játék folytatódik, de a nyelv specifikus karakterek nem kerültnek megjelenítésre. Kérem, másolja be a megfelelő betűtípus fájlokat az EOB II játék adat könyvtárába.
ko: 이 아미가 버전에는 다음 글꼴 파일이 필요합니다: EOBF6.FONT EOBF6 / 6 EOBF8.FONT EOBF8 / 8 이것은 게임과 함께 제공된 특정 글꼴 파일에만 포함된 언어별 문자를 사용하는 EOB II의 현지화된 (영어가 아닌) 버전입니다. 영어 버전이나 EOB I 게임의 글꼴 파일을 사용할 수 없습니다. 게임은 계속되지만, 언어별 문자는 표시되지 않습니다. 올바른 글꼴 파일을 EOB II 게임 데이터 디렉터리에 복사하세요.
sv_se: Denna AMIGA-version kräver följande teckensnittsfiler: EOBF6.FONT EOBF6/6 EOBF8.FONT EOBF8/8 Detta är en lokaliserad (icke-engelsk) version av EOB II som använder språkspecifika tecken som endast finns i de specifika teckensnittsfiler som medföljde ditt spel. Du kan inte använda teckensnittsfilerna filer från den engelska versionen eller från något EOB I-spel, vilket verkar vara vad du gör. Spelet kommer att fortsätta, men de språkspecifika tecknen kommer inte att visas. Kopiera de korrekta teckensnittsfilerna till din EOB II-speldatakatalog.

source: This is a trial Windows version of the game. To play the full version, you will need to use the original interpreter and purchase a key from Wyrmkeep
hu_hu: Ez a játék Windows próbaverziója. A játék teljes verziójához az eredeti bemondót kell használnia, és meg kell vásárolnia a kulcsot a Wyrmkeep-től
ko: 이것은 윈도우즈용 체험판 게임입니다. 정식 버전을 플레이하려면 원본 해석기를 사용하고 Wyrmkeep에서 키를 구매해야 함
sv_se: Detta är en Windows-testversion av spelet. För att spela den fullständiga versionen måste du använda den ursprungliga tolken och köpa en nyckel från Wyrmkeep

source: Exit keymappings
sv_se: Avsluta kortkommandon

source: Map keymappings
sv_se: Kortkommandon för karta

source: Journal keymappings
sv_se: Kortkommandon för dagbok

source: Exit
hu_hu: Kilépés
ko: 나가기
sv_se: Avsluta

source: Raise the sound volume
sv_se: Höj ljudvolymen

source: Lower the sound volume
sv_se: Sänk ljudvolymen

source: Interact with object with chosen action
sv_se: Interagera med objektet med vald åtgärd

source: Take object
sv_se: Ta objekt

source: Move or manipulate object
sv_se: Flytta eller manipulera objekt

source: Open door or object
sv_se: Öppna dörr eller objekt

source: Close door or object
sv_se: Stäng dörr eller objekt

source: Look at object close-up
sv_se: Titta på objektet i närbild

source: Switch to inventory display
sv_se: Växla till inventarieskärm

source: Move focus to interactive object
sv_se: Flytta fokus till interaktivt objekt

source: Start dropping virtual bread crumbs
sv_se: Börja släppa virtuella brödsmulor

source: Follow virtual bread crumbs
sv_se: Följ virtuella brödsmulor

source: Run while following virtual bread crumbs
sv_se: Spring medan du följer virtuella brödsmulor

source: Switch to main display
sv_se: Växla till huvudskärmen

source: Open save / load dialog
sv_se: Öppna dialog för spara / läs in

source: Look at scene
sv_se: Titta på scen

source: Previous inventory item
sv_se: Föregående inventarieobjekt

source: Next inventory item
sv_se: Nästa objekt i inventariet

source: Exit map display
sv_se: Avsluta kartvisning

source: Up one level
sv_se: Upp en nivå

source: Down one level
sv_se: Ner en nivå

source: Go back in journal
sv_se: Gå bakåt i dagbok

source: Exit journal
sv_se: Avsluta dagbok

source: Go forward in journal
sv_se: Gå framåt i dagbok

source: This is the end of the trial version. You can play the full game using the original interpreter from Wyrmkeep
hu_hu: Ez a próbaverzió vége. A teljes játékot a Wyrmkeep eredeti bemondójának használatával játszhatja
ko: 체험판이 종료되었습니다. Wyrmkeep의 원본 해석기를 사용하여 정식 게임을 플레이 할 수 있음
sv_se: Detta är slutet på testversionen. Du kan spela hela spelet med den ursprungliga tolken från Wyrmkeep

source: This puzzle is not available in the trial version of the game
hu_hu: Ez a rejtvény nem érhető el a játék próbaverziójában
ko: 이 퍼즐은 체험판 게임에서 사용할 수 없음
sv_se: Detta pussel är inte tillgängligt i testversionen av spelet

source: TTS Narrator
hu_hu: TTS Narrátor
ko: TTS 나레이터
sv_se: TTT-berättare

source: Fight sequence keymappings
hu_hu: Harc jelenet gombkiosztás
ko: 대결 시퀀스 키맵핑
sv_se: Kortkommandon för slåssekvens

source: Index keymappings
hu_hu: Index gombkiosztás
ko: 색인 키맵핑
sv_se: Kortkommandon för index

source: Yes/No keymappings
hu_hu: Igen/Nem gombkiosztások
ko: 예/아니요 키맵핑
sv_se: Kortkommandon för Ja/Nej

source: Shift Cursor - Top left
hu_hu: Kurzor eltolása - Bal fentre
ko: 커서 이동 - 왼쪽 상단
sv_se: Skifta markör - Övre vänster

source: Shift Cursor - Middle left
hu_hu: Kurzor eltolása - Közép balra
ko: 커서 이동 - 왼쪽 중간
sv_se: Skifta markör - Mitten till vänster

source: Shift Cursor - Bottom left
hu_hu: Kurzor eltolása - Bal lentre
ko: 커서 이동 - 왼쪽 하단
sv_se: Skifta markör - Nedre vänster

source: Shift Cursor - Top right
hu_hu: Kurzor eltolása - Jobb fentre
ko: 커서 이동 - 오른쪽 상단
sv_se: Skifta markör - Övre höger

source: Shift Cursor - Middle right
hu_hu: Kurzor eltolása - Közép jobbra
ko: 커서 이동 - 오른쪽으로 중간
sv_se: Skifta markör - Mitten till höger

source: Shift Cursor - Bottom right
hu_hu: Kurzor eltolása - Jobb lentre
ko: 커서 이동 - 오른쪽 하단
sv_se: Skifta markör - Nedre höger

source: Go to next index
hu_hu: Átlépés a következő indexre
ko: 다음 색인으로 이동
sv_se: Gå till nästa index

source: Go to previous index
hu_hu: Visszalépés az előző indexre
ko: 이전 색인으로 이동
sv_se: Gå till föregående index

source: Select index
hu_hu: Index kiválasztása
ko: 색인 선택
sv_se: Välj index

source: The game is using unsupported engine
hu_hu: A játék nem támogatott motort használ
ko: 게임이 지원되지 않는 엔진을 사용하고 있음
sv_se: Spelet använder en motor som inte stöds

source: Play a digital soundtrack during the opening movie
hu_hu: Játsszon digitális betétdalt a nyitófilm alatt
ko: 오프닝 동영상 중에 디지털 사운드트랙을 재생
sv_se: Spela upp ett digitalt soundtrack under öppningsfilmen

source: If selected, the game will use a digital soundtrack during the introduction. Otherwise, it will play MIDI music.
hu_hu: Bekapcsolása esetén a játék a digitális betétdalt játssza le a nyitófilm alatt. Ellenkező esetben a MIDI zene került lejátszásra.
ko: 선택하면, 게임은 인트로에서 디지털 사운드트랙을 사용합니다. 그렇지 않으면, 미디 음악을 재생합니다.
sv_se: Om detta väljs kommer spelet att använda ett digitalt soundtrack under inledningen. Annars spelar det MIDI-musik.

source: Use Windows cursors
hu_hu: Windows kurzorok használata
ko: 윈도우즈 커서 사용
sv_se: Använd Windows-muspekare

source: If selected, the game will use Windows mouse cursors bundled in the original .exe file. Otherwise, it will use lower resolution cursors from the data files.
sv_se: Om detta alternativ väljs kommer spelet att använda Windows-muspekare som ingår i den ursprungliga .exe-filen. Annars kommer det att använda pekare med lägre upplösning från datafilerna.

source: Cursor up
hu_hu: Kurzor fel
ko: 커서 위
sv_se: Pekare upp

source: Cursor down
hu_hu: Kurzor le
ko: 커서 아래
sv_se: Pekare ner

source: Cursor left
hu_hu: Kurzor bal
ko: 커서 왼쪽
sv_se: Pekare vänster

source: Cursor right
hu_hu: Kurzor jobb
ko: 커서 오른쪽
sv_se: Pekare höger

source: Repeat last message
hu_hu: Utolsó üzenet megismétlése
ko: 마지막 메시지 반복
sv_se: Upprepa sista meddelandet

source: Easy mouse interface
hu_hu: Egyszerű egér interfész
ko: 쉬운 마우스 인터페이스
sv_se: Enkelt musgränssnitt

source: Shows object names when hovering the mouse over them
hu_hu: Megmutatja a tárgyak nevét amikor az egeret felettük tartja
ko: 마우스를 올려놓으면 개체 이름이 표시
sv_se: Visar objektets namn när muspekaren flyttas över dom

source: Animated inventory items
hu_hu: Animált felszerelés tárgyak
ko: 애니메이션 인벤토리 항목
sv_se: Animerade delar i inventariet

source: Animated game interface
hu_hu: Animált játék felület
ko: 애니메이션 게임 인터페이스
sv_se: Animerat spelgränssnitt

source: Naughty game mode
hu_hu: Pajkos játékmód
ko: 꾸러기 게임 모드
sv_se: "Busigt" spelläge

source: Start menu keymappings
hu_hu: Start menü gombkiosztások
ko: 시작 메뉴 키맵핑
sv_se: Kortkommandon för startmeny

source: Open game menu
hu_hu: Játék menü megnyitása
ko: 게임 메뉴 열기
sv_se: Öppna spelmenyn

source: Scroll bar up
hu_hu: Szkroll sáv fel
ko: 스크롤바를 위로
sv_se: Rullningslist upp

source: Scroll bar down
hu_hu: Szkroll sáv le
ko: 스크롤바를 아래로
sv_se: Rullningslist ner

source: Start game
hu_hu: Játék indítása
ko: 게임 시작
sv_se: Starta spelet

source: Resume game
hu_hu: Játék folytatása
ko: 게임 재개
sv_se: Återuppta spelet

source: Show intro
hu_hu: Bevezető megjelenítése
ko: 인트로 표시
sv_se: Visa intro

source: Show quotes
hu_hu: Idézetek megjelenítése
ko: 인용문 표시
sv_se: Visa citat

source: Restart animation
hu_hu: Animáció újraindítása
ko: 애니메이션 재시작
sv_se: Starta om animering

source: Show item costs in standard inventory mode
hu_hu: Szokásos felszerelés nézetben a tárgyak értékének mutatása
ko: 일반 인벤토리 모드에서 아이템 비용 표시
sv_se: Visa kostnader för föremål i standardläge för översikten

source: Shows item costs in standard inventory mode, allowing the value of items to be compared
hu_hu: Szokványos felszerelés nézetben mutassa a tárgyak értékét, lehetővé téve az összehasonlításukat
ko: 일반 인벤토리 모드에서 아이템 비용을 표시하여 품목 가치를 비교할 수 있음
sv_se: Visar kostnader för föremål i standardläge för inventariet i syfte att möjliggöra jämförbarhet mellan olika föremål

source: More durable armor
hu_hu: Tartósabb páncél
ko: 더욱 내구성 있는 갑옷
sv_se: Extra tålig rustning

source: Armor won't break until character is at -80HP, rather than merely -10HP
hu_hu: A páncél nem törik amíg a játékos nem éri el a -80HP-t, a -10HP helyett
ko: 캐릭터가 -10 HP가 아닌 -80 HP가 될 때까지, 방어구가 부숴지지 않음
sv_se: Rustning går inte sönder förrän karaktären är på -80HP, snarare än bara -10HP

source: Hitpoint bars
hu_hu: Életerő sávok
ko: 히트포인트 바
sv_se: Livmätare

source: Replace a colored gem with bars for hit points and spell points.
hu_hu: Az életerő és varázspontok sávjainak lecserélése színes ékkövekre.
ko: 색깔 있는 보석을 히트 포인트와 주문 포인트를 나타내는 바로 대체합니다.
sv_se: Ersätt en färgad ädelsten med staplar för livpoäng och besvärjelsepoäng.

source: View party member 1
sv_se: Visa gruppmedlem 1

source: View party member 2
sv_se: Visa gruppmedlem 2

source: View party member 3
sv_se: Visa gruppmedlem 3

source: View party member 4
sv_se: Visa gruppmedlem 4

source: View party member 5
sv_se: Visa gruppmedlem 5

source: View party member 6
sv_se: Visa gruppmedlem 6

source: Cast
hu_hu: Varázsol
ko: 시전
sv_se: Trolla

source: Exchange
hu_hu: Csere
ko: 교환
sv_se: Byt ut

source: Fight
hu_hu: Harc
ko: 대결
sv_se: Slåss

source: Quick reference
sv_se: Snabbreferens

source: Retreat
hu_hu: Visszavonulás
ko: 철수
sv_se: Retirera

source: Delay
hu_hu: Kivárás
ko: 지연
sv_se: Fördröjning

source: Protect
hu_hu: Védés
ko: 보호
sv_se: Skydda

source: Forwards
hu_hu: Menetelés előre
ko: 앞으로
sv_se: Framåt

source: Backwards
hu_hu: Menetelés hátra
ko: 뒤로
sv_se: Bakåt

source: Toggle minimap
sv_se: Växla minikarta

source: Reorder party
sv_se: Ordna om grupp

source: Search
hu_hu: Keresés
ko: 검색
sv_se: Sök

source: Bash
hu_hu: Ütés
ko: 강타
sv_se: Dräm till

source: Unlock
hu_hu: Felold
ko: 잠금 해제
sv_se: Lås upp

source: Goto location
hu_hu: Ugrás helyszínre
ko: 위치로 이동
sv_se: Gå till plats

source: Might and Magic 1 - Menus
hu_hu: Might and Magic 1 - Menük
ko: 마이트 앤 매직 1 - 메뉴
sv_se: Might and Magic 1 - Menyer

source: Might and Magic 1 - Minimal Keys
hu_hu: Might and Magic 1 - Minimális gombok
ko: 마이트 앤 매직 1 - 최소한의 키
sv_se: Might and Magic 1 - Minimala tangenter

source: Might and Magic 1 - Party
hu_hu: Might and Magic 1 - Csapat
ko: 마이트 앤 매직 1 - 파티
sv_se: Might and Magic 1 - Grupp

source: Might and Magic 1 - Combat
hu_hu: Might and Magic 1 - Harc
ko: 마이트 앤 매직 1 - 전투
sv_se: Might and Magic 1 - Kamp

source: Might and Magic 1 - Cheats
hu_hu: Might and Magic 1 - Csalások
ko: 마이트 앤 매직 - 치트
sv_se: Might and Magic 1 - Fusk

source: You cannot run the game directly from the Graphics Overhaul Mod. Instead, it will automatically be available if you detect the original game and select Enhanced mode.
hu_hu: Nem futtathatja a játékot közvetlenül a Graphical Overhaul Mod-ból. Ehelyett automatikusan opcióként jelenik meg, ha felismerteti az eredeti játékot és a Javított módot aktiválja.
ko: 그래픽 오버홀 개조에서 직접 게임을 실행할 수 없습니다. 대신 원래 게임을 감지하고 강화 모드를 선택하면 자동으로 사용할 수 있습니다.
sv_se: Du kan inte köra spelet direkt från Graphics Overhaul Mod. Istället kommer den automatiskt att vara tillgänglig om du identifierar originalspelet och väljer Enhanced-läget.

source: In order to run in Enhanced mode, please copy xeen.cc from a copy of World of Xeen or Clouds of Xeen to your Might and Magic 1 game folder
hu_hu: A javított mód indításához másolja a xeen.cc fájlt a World of Xeen-ből vagy a Clouds of Xeen-ből a Might and Magic 1 könyvtárába
ko: 강화 모드로 실행하려면, World of Xeen 또는 Clouds of Xeen의 복사본에서 xeen.cc를 마이트 앤 매직 1 게임 폴더로 복사
sv_se: För att kunna köra i Enhanced-läget, kopiera xeen.cc från en kopia av World of Xeen eller Clouds of Xeen till din spelmapp för Might and Magic 1

source: Failed to autosave
hu_hu: Sikertelen automata mentés
ko: 자동 저장 실패함
sv_se: Misslyckades med att autospara

source: ~Z~ip Mode Activated
hu_hu: ~Z~ip mód aktiválva
ko: Zip 모드 활성화됨(~Z~)
sv_se: ~Z~ipläge aktiverat

source: When activated, clicking on an item or area with the lightning bolt cursor takes you directly there, skipping intermediate screens. You can only 'Zip' to a precise area you've already been.
hu_hu: Ha aktiválva van, egy elemre vagy területre kattintva a villám kurzorával közvetlenül oda vezet, átugorva a köztes képernyőket. Csak olyan pontos területre lehet 'Zipelni', ahol már járt.
ko: 활성화되면, 라이트닝 볼트 커서로 아이템이나 영역을 클릭했을 때, 중간 화면을 건너뛰고 그 곳으로 즉시 이동합니다. 이미 이동했던 적이 있는 장소로만 'Zip' 가능합니다.
sv_se: När du klickar på ett föremål eller ett område med blixtmarkören kommer du direkt dit och hoppar över mellanliggande skärmar. Du kan bara ”Zip” till ett exakt område där du redan har varit.

source: ~T~ransitions Enabled
hu_hu: ~Á~tmenetek engedélyezve
ko: 번역 활성화함(~T~)
sv_se: Öv~e~rgångar aktiverade

source: Toggle screen transitions on or off. Turning off screen transitions will enable you to navigate more quickly through the game.
hu_hu: A képernyő átmeneteinek be- vagy kikapcsolása. A képernyőátmenetek kikapcsolásával gyorsabban navigálhat a játékban.
ko: 화면 전환 효과를 켜거나 끕니다. 화면 전환 효과를 끌 경우 게임 내를 더욱 빠르게 다닐 수 있습니다.
sv_se: Slå på eller av skärmövergångar. Om du stänger av skärmövergångarna kan du navigera snabbare genom spelet.

source: Play the Myst fly by movie
hu_hu: Myst bevezetõ film lejátszása
ko: The Myst fly 동영상 재생
sv_se: Spela flygvideon i Myst

source: The Myst fly by movie was not played by the original engine.
hu_hu: A Myst bevezetõ filmet nem játszotta le az eredeti motor.
ko: 원본 게임 엔진에서는 The Myst fly 동영상이 재생되지 않았습니다.
sv_se: Flygvideon i Myst visades inte i originalspelet.

source: Improve Selenitic Age puzzle ~a~ccessibility
hu_hu: A Selenitic Age rejtvény "könnyebb kezelés" javítása
ko: Selenitic Age 퍼즐의 접근성을 개선(~a~)
sv_se: Förbättra ~t~illgängligheten till Selenitic Age-pussel

source: Allow solving Selenitic Age audio puzzles with more error margin.
hu_hu: A Selentic Age hang rejtvények megoldását nagyobb tűréshatárral engedi megfejteni a játék.
ko: 더 많은 오차 범위로 Selenitic Age 오디오 퍼즐을 풀 수 있도록 허용합니다.
sv_se: Gör det möjligt att lösa ljudpussel från Selenitic Age med större felmarginal.

source: Simulate loading times of old CD drives
hu_hu: CD meghajtó betöltő sebesség szimulálása
ko: 오래된 CD 드라이브의 로딩 시간을 시뮬레이션
sv_se: Simulera inläsningstider för gamla cd-enheter

source: Simulate loading times of old CD-ROM drives by adding a random delay during scene transitions.
hu_hu: A jelenetek közé véletlenszerű késleltetések hozzáadása, ezáltal szimulálva a régi CD meghajtók sebességét.
ko: 장면 전환 중에 무작위 지연을 추가하여 오래된 CD-ROM 드라이브의 로딩 시간을 시뮬레이션합니다.
sv_se: Simulera inläsningstider för gamla cd-enheter genom att lägga till en slumpmässig fördröjning under scenövergångar.

source: ~D~rop Page
hu_hu: Oldal Eldobás
ko: 페이지 삭제(~D~)
sv_se: Släpp si~d~a

source: Show ~M~ap
hu_hu: Térkép megjelenítése
ko: 지도표시(~M~)
sv_se: ~V~isa karta

source: Main Men~u~
hu_hu: Fő Menü
ko: 메인 메뉴(~U~)
sv_se: Huvud~m~eny

source: The new language will be applied after restarting the game.
hu_hu: Az új nyelv a játék újraindítása után kerül alkalmazásra.
ko: 새 언어는 게임을 재시작 후 적용됩니다.
sv_se: Det nya språket kommer att tillämpas efter omstart av spelet.

source: ~W~ater Effect Enabled
hu_hu: Víz-effektus engedélyezve
ko: 물결효과 활성화됨(~W~)
sv_se: ~V~atteneffekt aktiverad

source: Toggles the use of QuickTime videos for visual effects related to water surfaces (ripples, waves, etc.).
hu_hu: Bekapcsolja a QuickTime-videók használatát a vízfelületek vizuális effektusaihoz (fodrok, hullámok stb.).
ko: 물 표면 (잔물결, 파도 등)과 관련된 시각 효과를 위해 QuickTime 비디오를 사용할지 여부를 전환합니다.
sv_se: Växlar användningen av QuickTime-videor för visuella effekter relaterade till vattenytor (krusningar, vågor etc.).

source: Transitions:
hu_hu: Átmenetek:
ko: 전환:
sv_se: Övergångar:

source: Adjusts the speed of screen transitions. Disabling screen transitions will enable you to navigate more quickly through the game.
hu_hu: Beállítja a képernyő átmenetek sebességét. A képernyőátmenetek kikapcsolásával gyorsabban navigálhat a játékban.
ko: 화면 전환 속도를 조절합니다. 화면 전환을 끌 경우 게임 내를 더욱 빠르게 다닐 수 있습니다.
sv_se: Justerar hastigheten på skärmövergångarna. Om du inaktiverar skärmövergångarna kan du navigera snabbare genom spelet.

source: Fastest
hu_hu: Leggyorsabb
ko: 가장 빠름
sv_se: Snabbast

source: Best
hu_hu: Legjobb
ko: 최고
sv_se: Bästa

source: Fix audio pops/clicks
sv_se: Fixa knaster/klickljud

source: Reduces audible pops at the end of some sound effects (Non Myst/Riven only).
sv_se: Minskar hörbara knaster i slutet av vissa ljudeffekter (endast Non Myst/Riven).

source: Myst ME support not compiled in
hu_hu: Myst ME támogatás nincs lefordítva
ko: Myst ME 지원이 컴파일되지 않았음
sv_se: Stöd för Myst ME har inte kompilerats in

source: Myst support not compiled in
hu_hu: Myst támogatás nincs lefordítva
ko: Myst 지원이 컴파일 되지 않았음
sv_se: Stöd för Myst har inte kompilerats in

source: Riven support not compiled in
hu_hu: Riven támogatás nincs lefordítva
ko: Riven 지원이 컴파일 되지 않았음
sv_se: Stöd för Riven har inte kompilerats in

source: CSTime support not compiled in
hu_hu: CSTime támogatás nincs lefordítva
ko: CSTime 지원이 컴파일되지 않았음
sv_se: Stöd för CSTime har inte kompilerats in

source: The game is paused. Press any key to continue.
hu_hu: A játék megállításra került. Nyomjon egy gombot a folytatáshoz.
ko: 게임이 일시 정지되었습니다. 계속하려면 아무 키나 누르세요.
sv_se: Spelet är pausat. Tryck på valfri tangent för att fortsätta.

source: Load game state
hu_hu: Játékállás betöltése
ko: 게임 상태 불러오기
sv_se: Läs in speltillstånd

source: Save game state
hu_hu: Játékállás mentés
ko: 게임 상태 저장하기
sv_se: Spara speltillstånd

source: Show options menu
hu_hu: Opciók menü megjelenítése
ko: 옵션 메뉴 표시
sv_se: Visa alternativmenyn

source: Drop page
hu_hu: Oldal eldobás
ko: 페이지 삭제
sv_se: Släpp sida

source: Are you sure you want to load a saved game? All unsaved progress will be lost.
hu_hu: Biztosan be akar tölteni egy mentést? Minden korábban nem mentett előrehaladása elvész.
ko: 저장된 게임을 불러오겠습니까? 저장되지 않은 모든 진행 상황은 사라지게 됩니다.
sv_se: Är du säker på att du vill läsa in ett sparat spel? Alla osparade framsteg kommer gå förlorade.

source: Are you sure you want to start a new game? All unsaved progress will be lost.
hu_hu: Biztosan új játékot akar indítani? Minden korábban nem mentett előrehaladása elvész.
ko: 새 게임을 시작하겠습니까? 저장되지 않은 진행 사항은 사라지게 됩니다.
sv_se: Är du säker på att du vill starta ett nytt spel? Alla osparade framsteg kommer gå förlorade.

source: Are you sure you want to quit? All unsaved progress will be lost.
hu_hu: Biztosan ki akar lépni? Minden korábban nem mentett előrehaladása elvész.
ko: 정말 종료하겠습니까? 저장되지 않은 진행 사항은 사라지게 됩니다.
sv_se: Är du säker på att du vill avsluta? Alla osparade framsteg kommer gå förlorade.

source: You can't leave the library in the demo.
hu_hu: Nem hagyhatja el a könyvtárt a demóban.
ko: 데모에서는 도서관을 벗어날 수 없습니다.
sv_se: Du kan inte lämna biblioteket i demot.
