Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: Online Server:
hu_hu: Online Szerver:
ko: 온라인 서버:

source: Esc
ko: Esc 키

source: Ctrl
ko: Ctrl 키

source: Tab
ko: Tab 키

source: Comm
hu_hu: Komm
ko: 통신기

source: Down Left
ko: 왼쪽 아래

source: Down Right
ko: 오른쪽 아래

source: Up Left
ko: 왼쪽 위

source: Up Right
ko: 오른쪽 위

source: Spiff
ko: 스피프

source: Katton
ko: 캣튼

source: Max
ko: 최대

source: Toggle really fast mode on/off
ko: 정말 빠른 모드 켜기/끄기 전환

source: Scroll up in your dialogues
ko: 대화에서 위로 스크롤

source: Scroll down in your dialogues
ko: 대화에서 아래로 스크롤

source: Go to next dialogue
ko: 다음 대화로 이동

source: Go to previous dialogues
ko: 이전 대화로 이동

source: Select dialogue
ko: 대화 선택

source: Skip video sequence or dialogue
ko: 비디오 시퀀스 또는 대화 건너뛰기

source: Main Menu
ko: 메인 메뉴

source: Options Dialog
ko: 대화 옵션

source: Page Up in save/load menu
ko: 저장/불러오기 메뉴에서 페이지 위로

source: Page down in save/load menu
ko: 저장/불러오기 메뉴에서 페이지 아래로

source: Go to start of save/load menu
ko: 저장/불러오기 메뉴 시작으로 이동

source: Go to end of save/load menu
ko: 저장/불러오기 메뉴 끝으로 이동

source: Skip sequence/open quit dialogue
ko: 시퀀스 건너뛰기/종료 대화 상자 열기

source: Skip Dialogue
ko: 대화 건너뛰기

source: Toggle between voice/text/text and voice
ko: 음성/텍스트/텍스트 및 음성 간 전환

source: Return
ko: 리턴

source: Turn Left/Crawl West
ko: 좌회전/서쪽으로 기어가기

source: Turn Right/Crawl East
ko: 우회전/동쪽으로 기어가기

source: Debug Grid Camera Up
ko: 디버그 격자 카메라 위

source: Debug Grid Camera Down
ko: 디버그 격자 카메라 아래

source: Debug Grid Camera Left
ko: 디버그 격자 카메라 왼쪽

source: Debug Grid Camera Right
ko: 디버그 격자 카메라 오른쪽

source: Normal Behaviour
ko: 기본 동작

source: Athletic Behaviour
ko: 육상 동작

source: Aggressive Behaviour
ko: 공격적인 동작

source: Discreet Behaviour
ko: 신중한 동작

source: Behaviour Action
ko: 동작 작업

source: Change Behaviour
ko: 동작 변경

source: Options Menu
ko: 옵션 메뉴

source: Use Selected Object
ko: 선택한 개체를 사용

source: Throw Magic Ball
ko: 매직 볼을 던지기

source: Special Action
ko: 특수 작업

source: Scenery Zoom
ko: 풍경 확대/축소

source: Video:
hu_hu: Videó:
ko: 비디오:

source: Ransome *unbeeped* (DLC)
hu_hu: Váltságdíj *kisípolás* (DLC)
ko: 랜섬 *삐 소리 없음* (DLC)

source: Select verb/item Left
ko: 왼쪽 버브/아이템 선택

source: Select verb/item Right
ko: 오른쪽 버브/아이템 선택

source: Select verb/item Up
ko: 위쪽 버브/아이템 선택

source: Select verb/item Down
ko: 아래쪽 버브/아이템 선택

source: Select Actor 1
ko: 배우 1 선택

source: Select Actor 2
ko: 배우 2 선택

source: Select Actor 3
ko: 배우 3 선택

source: Select Actor 4
ko: 배우 4 선택

source: Select Actor 5
ko: 배우 5 선택

source: Select Choice 1
ko: 선택 1 선택

source: Select Choice 2
ko: 선택 2 선택

source: Select Choice 3
ko: 선택 3 선택

source: Select Choice 4
ko: 선택 4 선택

source: Select Choice 5
ko: 선택 5 선택

source: Select Choice 6
ko: 선택 6 선택

source: Select Next Actor
ko: 다음 배우 선택

source: Select Previous Actor
ko: 이전 배우 선택

source: Skip Text
ko: 대사 건너뛰기

source: Ultima VI
ko: 울티마 VI

source: Ultima VIII
ko: 울티마 VIII

source: Crusader
hu_hu: Keresztes lovag
ko: 크루세이더

source: Dialogue answer 1
ko: 대화 답변 1

source: Dialogue answer 2
ko: 대화 답변 2

source: Dialogue answer 3
ko: 대화 답변 3

source: Dialogue answer 4
ko: 대화 답변 4

source: Look Up
ko: 위를 보기

source: Look Down
ko: 아래를 보기

source: ID:
hu_hu: Azonosító:

# lowres
source: ID:
hu_hu: Azonosító:

source: N:
hu_hu: S:

source: LAN
hu_hu: Helyi hálózat

source: Martian Dreams
hu_hu: Marsi Álmok

source: The Savage Empire
hu_hu: A Barbár Birodalom
