Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: This setting forces ScummVM to use 2D renderer while running 2D games
hu_hu: Ez a beállítás arra kényszeríti a ScummVM-et, hogy 2D renderelőt használjon 2D játékok futtatása közben
ko: 이 설정은 2D 게임을 실행하는 동안 ScummVM이 2D 렌더러를 사용하도록 강제함
sv_se: Denna inställning tvingar ScummVM att använda 2D-renderare då 2D-spel körs

source: Use Italian speech pack
sv_se: Använd italienskt språkpaket

source: Use Italian dubbing instead of the default English one
sv_se: Använd italiensk dubbning istället för engelska

source: Run SD version (1280x800)
sv_se: Kör SD-version (1280x800)

source: Run the legacy SD version, which is better for small screens
sv_se: Kör föråldrade SD-versionen, vilken är bättre för mindre skärmar

source: FoxTail support is not compiled in
hu_hu: FoxTail támogatás nincs lefordítva
ko: FoxTail 지원은 컴파일되지 않았음
sv_se: Stöd för FoxTail har inte kompilerats in

source: Hero Craft support is not compiled in
hu_hu: Hero Craft támogatás nincs lefordítva
ko: Hero Craft 지원이 컴파일되지 않았음
sv_se: Stöd för Hero Craft har inte kompilerats in

source: Wintermute3D support is not compiled in
hu_hu: Wintermute3D támogatás nincs lefordítva
ko: Wintermute3D 지원이 컴파일되지 않았음
sv_se: Stöd för Wintermute3D har inte kompilerats in

source: This game requires PNG, JPEG and Vorbis support.
hu_hu: Ehhez a játékhoz PNG, JPEG és Vorbis támogatás szükséges.
ko: 이 게임은 PNG, JPEG, Vorbis 지원을 필요로 합니다.
sv_se: Detta spel kräver PNG-, JPEG- och Vorbis-stöd.

source: This game requires the FoxTail subengine, which is not compiled in.
hu_hu: Ehhez a játékhoz FoxTail almotor szükséges, ami nincs befordítva.
ko: 이 게임을 하려면 FoxTail 서브엔진이 필요한데, 이 엔진은 컴파일되지 않았습니다.
sv_se: Detta spel kräver FoxTail-undermotorn, vilken inte kompilerats in.

source: This game requires the HeroCraft subengine, which is not compiled in.
hu_hu: Ehhez a játékhoz HeroCraft almotor szükséges, ami nincs befordítva.
ko: 이 게임을 하려면 HeroCraft 서브엔진이 필요한데, 이 엔진은 컴파일되지 않았습니다.
sv_se: Detta spel kräver HeroCraft-undermotorn, vilken inte kompilerats in.

source: This game requires 3D capabilities, which is not compiled in. As such, it is likely to be unplayable totally or partially.
hu_hu: Ez a játék 3D feltételeket igényel, melyeket nem fordítottak be. Így valószínűleg teljesen vagy részben játszhatatlan.
ko: 이 게임은 3D 기능을 필요로 하는데, 이는 컴파일되어 있지 않습니다. 따라서 전체 또는 부분적으로 플레이가 불가능할 가능성이 높습니다.
sv_se: Detta spel kräver 3D-förmågor vilka inte kompilerats in. Därför kommer det troligtvis vara helt eller delvis ospelbart.

source: Show scene geometry
hu_hu: Jelenet geometria megjelenítése
ko: 장면 지오메트리 표시
sv_se: Visa scengeometri

source: Show hints
hu_hu: Tippek mutatása
ko: 힌트 표시
sv_se: Visa ledtrådar

source: GUI variant A
hu_hu: "A" felület variáns
ko: GUI 변형 A
sv_se: Gränssnittsvariant A

source: GUI variant B
hu_hu: "B" felület variáns
ko: GUI 변형 B
sv_se: Gränssnittsvariant B

source: Phone cancel button
hu_hu: Hívás lerakás gomb
ko: 전화: 취소 버튼
sv_se: Telefon avbryt-knapp

source: Phone up button
hu_hu: Hívás felvétel gomb
ko: 전화: 위 버튼
sv_se: Telefon upp-knapp

source: Phone down button
hu_hu: Telefon le gomb
ko: 전화: 아래 버튼
sv_se: Telefon ned-knapp

source: Alternative action
hu_hu: Alternatív művelet
ko: 대체 작업
sv_se: Alternativ handling

source: Phone 0 button
hu_hu: Telefon 0 gomb
ko: 전화: 0 버튼
sv_se: Telefon 0-knapp

source: Phone 1 button
hu_hu: Telefon 1 gomb
ko: 전화: 1 버튼
sv_se: Telefon 1-knapp

source: Phone 2 button
hu_hu: Telefon 2 gomb
ko: 전화: 2 버튼
sv_se: Telefon 2-knapp

source: Phone 3 button
hu_hu: Telefon 3 gomb
ko: 전화: 3 버튼
sv_se: Telefon 3-knapp

source: Phone 4 button
hu_hu: Telefon 4 gomb
ko: 전화: 4 버튼
sv_se: Telefon 4-knapp

source: Phone 5 button
hu_hu: Telefon 5 gomb
ko: 전화: 5 버튼
sv_se: Telefon 5-knapp

source: Phone 6 button
hu_hu: Telefon 6 gomb
ko: 전화: 6 버튼
sv_se: Telefon 6-knapp

source: Phone 7 button
hu_hu: Telefon 7 gomb
ko: 전화: 7 버튼
sv_se: Telefon 7-knapp

source: Phone 8 button
hu_hu: Telefon 8 gomb
ko: 전화: 8 버튼
sv_se: Telefon 8-knapp

source: Phone 9 button
hu_hu: Telefon 9 gomb
ko: 전화: 9 버튼
sv_se: Telefon 9-knapp

source: Phone * button
hu_hu: Telefon * gomb
ko: 전화: * 버튼
sv_se: Telefon *-knapp

source: Phone # button
hu_hu: Telefon # gomb
ko: 전화: # 버튼
sv_se: Telefon #-knapp

source: Show help
hu_hu: Súgó megjelenítése
ko: 도움말 표시
sv_se: Visa hjälp

source: Change shadow type
hu_hu: Árnyék típus cseréje
ko: 그림자 유형 변경
sv_se: Ändra skuggtyp

source: Volume max
hu_hu: Max hangerő
ko: 볼륨 최대
sv_se: Volym max

source: Show debug parser
hu_hu: Hiba elemző megjelenítése
ko: 디버그 파서 표시
sv_se: Visa felsökningstolk

source: Debug print
hu_hu: Hiba kijelző
ko: 디버그 프린트
sv_se: Felsökningsutskrift

source: Light helper window
hu_hu: Egyszerűsített súgó ablak
ko: 광원 설정 도우미 창
sv_se: Hjälpfönster för belysning

source: Run forward
hu_hu: Futás előre
ko: 앞으로 달리기
sv_se: Spring framåt

source: Run backward
hu_hu: Futás hátra
ko: 뒤로 달리기
sv_se: Spring bakåt

source: Turn left fast
hu_hu: Gyorsan balra
ko: 왼쪽으로 빠르게 회전
sv_se: Sväng vänster snabbt

source: Turn right fast
hu_hu: Gyorsan jobbra
ko: 오른쪽으로 빠르게 회전
sv_se: Sväng höger snabbt

source: Show blueprint
hu_hu: Tervrajz megjelenítése
ko: 청사진 표시
sv_se: Visa teknisk ritning

source: Next action
hu_hu: Következő művelet
ko: 다음 행동
sv_se: Nästa handling

source: Previous action
hu_hu: Előző művelet
ko: 이전 행동
sv_se: Föregående handling

source: Volume off
hu_hu: Hangerő ki
ko: 볼륨 끄기
sv_se: Volym av

source: Change font size
hu_hu: Betűméret változtatás
ko: 글꼴 크기 변경
sv_se: Ändra typsnittsstorlek

source: Walking speed: Low
hu_hu: Séta sebesség: Lassú
ko: 걷기 속도: 천천히
sv_se: Gånghastighet: Långsam

source: Walking speed: Medium
hu_hu: Séta sebesség: Közepes
ko: 걷기 속도: 중간
sv_se: Gånghastighet: Medel

source: Walking speed: High
hu_hu: Séta sebesség: Gyors
ko: 걷기 속도: 빠르게
sv_se: Gånghastighet: Snabb

source: Cancel waiting
hu_hu: Várakozás megszakítása
ko: 대기 최소
sv_se: Avbryt väntande

source: Walking speed: Ultra Super Mega Fast
hu_hu: Séta sebesség: Őrülten Végtelenül Szörnyen Vágtató
ko: 걷기 속도: 울트라 수퍼 메가 빠르게
sv_se: Gånghastighet: Super Duper Mega-snabb

source: Show game credits
hu_hu: Játék stáblista megjelenítése
ko: 게임 크레딧 표시
sv_se: Visa speleftertexter

source: Play selected music record
hu_hu: Kiválasztott zenei lemez lejátszása
ko: 선택한 음악 레코드 재생
sv_se: Spela vald musikskiva

source: Select next music record
hu_hu: Következő zenei lemez kiválasztása
ko: 다음 음악 레코드 선택
sv_se: Spela upp nästa musikskiva

source: Play note 1: A
hu_hu: 1. Hangjegy: A
ko: 음 1 연주: A
sv_se: Spela not 1: A

source: Play note 2: F#
hu_hu: 2. Hangjegy: F#
ko: 음 2 연주: F#
sv_se: Spela not 2: F#

source: Play note 3: D#
hu_hu: 3. Hangjegy: D#
ko: 음 3 연주: D#
sv_se: Spela not 3: D#

source: Play note 4: C#
hu_hu: 4. Hangjegy: C#
ko: 음 4 연주: C#
sv_se: Spela not 4: C#

source: Play note 5: E
hu_hu: 5. Hangjegy: E
ko: 음 5 연주: E
sv_se: Spela not 5: E

source: Play note 6: G#
hu_hu: 6. Hangjegy: G#
ko: 음 6 연주: G#
sv_se: Spela not 6: G#

source: Play note 7: B
hu_hu: 7. Hangjegy: B
ko: 음 7 연주: B
sv_se: Spela not 7: B

source: Ability: Telekinesis
hu_hu: Képesség: Telekinézis
ko: 어빌리티: 염동력
sv_se: Förmåga: Telekinesi

source: Ability: Push
hu_hu: Képesség: Tolás
ko: 어빌리티: 밀기
sv_se: Förmåga: Knuffa

source: Ability: Lightning
hu_hu: Képesség: Villám
ko: 어빌리티: 라이트닝
sv_se: Förmåga: Åska

source: Ability: Light
hu_hu: Képesség: Fény
ko: 어빌리티: 빛
sv_se: Förmåga: Ljus

source: Ability: Wind
hu_hu: Képesség: Szél
ko: 어빌리티: 바람
sv_se: Förmåga: Vind

source: Ability: Sound
hu_hu: Képesség: Hang
ko: 어빌리티: 사운드
sv_se: Förmåga: Ljud

source: Ability: Esence
hu_hu: Képesség: Ezotéria
ko: 어빌리티: 에센스
sv_se: Förmåga: Essens

source: Ability: Exorcist
hu_hu: Képesség: Ördögűzés
ko: 어빌리티: 엑소시스트
sv_se: Förmåga: Exorcist

source: Show hints / Dance move
hu_hu: Tippek megjelenítése / Tánc lépés
ko: 힌트 표시 / 댄스 이동
sv_se: Visa tips / danssteg

source: Dance move up
hu_hu: Tánc mozgás fel
ko: 댄스 위로 이동
sv_se: Dans flytta upp

source: Dance move down
hu_hu: Tánc mozgás le
ko: 댄스 아래로 이동
sv_se: Dans flytta ned

source: Dance move left
hu_hu: Tánc lépés balra
ko: 댄스 왼쪽으로 이동
sv_se: Dans flytta vänster

source: Dance move right
hu_hu: Tánc lépés jobbra
ko: 댄스 오른쪽으로 이동
sv_se: Dans flytta höger

source: Cancel input
hu_hu: Bevitel megszakítás
ko: 입력 취소
sv_se: Avbryt inmatning

source: Hide hints
hu_hu: Tippek elrejtése
ko: 힌트 숨기기
sv_se: Dölj tips

source: Shift key
hu_hu: Shift billentyű
ko: 시프트 키
sv_se: Skift-tangent

source: Chapayev's action
hu_hu: Chapayev tette
ko: Chapayev의 행동
sv_se: Chapayevs handling

source: Settings
hu_hu: Beállítások
ko: 설정
sv_se: Inställningar

source: Dialog answer 1
sv_se: Dialogsvar 1

source: Dialog answer 2
sv_se: Dialogsvar 2

source: Dialog answer 3
sv_se: Dialogsvar 3

source: Dialog answer 4
sv_se: Dialogsvar 4

source: Spin wheel slower
hu_hu: Kerék lassabb forgatása
ko: 돌림판을 천천히 돌림
sv_se: Snurra hjulet långsammare

source: Spin wheel faster
hu_hu: Kerék forgatása gyorsabban
ko: 돌림판을 빠르게 돌림
sv_se: Snurra hjulet snabbare

source: Zoom out
hu_hu: Kizoomolás
ko: 축소
sv_se: Zooma ut

source: Zoom in
hu_hu: Bezoomolás
ko: 확대
sv_se: Zooma in

source: Show journal
hu_hu: Folyóirat megjelenítése
ko: 일기 표시
sv_se: Visa dagbok

source: Bezier window
hu_hu: Bezier ablak
ko: 베지어 창
sv_se: Bezier-fönster

source: Droid's action
hu_hu: Droid tette
ko: 드로이드의 행동
sv_se: Robots handling

source: Rotate
hu_hu: Forgatás
ko: 회전
sv_se: Rotera

source: Player 1: Up
hu_hu: 1.Játékos: Fel
ko: 플레이어 1: 위쪽
sv_se: Spelare 1: Upp

source: Player 1: Left
hu_hu: 1.Játékos: Bal
ko: 플레이어 1: 왼쪽
sv_se: Spelare 1: Vänster

source: Player 1: Down
hu_hu: 1.Játékos: Le
ko: 플레이어 1: 아래쪽
sv_se: Spelare 1: Ner

source: Player 1: Right
hu_hu: 1.Játékos: Jobb
ko: 플레이어 1: 오른쪽
sv_se: Spelare 1: Höger

source: Player 2: Up
hu_hu: 2.Játékos: Fel
ko: 플레이어 2: 위쪽
sv_se: Spelare 2: Upp

source: Player 2: Left
hu_hu: 2.Játékos: Bal
ko: 플레이어 2: 왼쪽
sv_se: Spelare 2: Vänster

source: Player 2: Down
hu_hu: 2.Játékos: Le
ko: 플레이어 2: 아래쪽
sv_se: Spelare 2: Ner

source: Player 2: Right
hu_hu: 2.Játékos: Jobb
ko: 플레이어 2: 오른쪽
sv_se: Spelare 2: Höger

source: Debug FPS
hu_hu: FPS hibakeresés
ko: FPS 디버그
sv_se: Felsökning bilder/s

source: Key i
hu_hu: i Gomb
ko: i 키
sv_se: Tangent i

source: This saved game uses version %u, but this engine only supports up to version %d. You will need an updated version of the engine to use this saved game.
hu_hu: A mentés %u verziót használ, de a motor csak %d-ig támogatja. Frissítenie kell a a motort, hogy használni tudja a mentést.
ko: 이 저장된 게임은 버전 %u 사용하지만, 이 엔진은 버전 %d까지만 지원합니다. 이 저장된 게임을 사용하려면 업데이트 된 버전의 엔진이 필요합니다.
sv_se: Den här sparfilen använder version %u, men spelmotorn har bara stöd för upp till version %d. Det krävs en uppdaterad version av spelmotorn för att använda den här sparfilen.

source: Double FPS
hu_hu: Dupla FPS
ko: 더블 FPS
sv_se: Dubbla bilder/s

source: Increase framerate from 30 to 60 FPS
hu_hu: Növeli a képkockaszámot 30-ról 60-ra
ko: 프레임 속도를 30에서 60 FPS으로 증가
sv_se: Öka antalet bildrutor per sekund från 30 till 60

source: Enable Venus
hu_hu: Vénusz engedélyezve
ko: 비너스 활성화
sv_se: Aktivera Venus

source: Enable the Venus help system
hu_hu: Vénusz súgórendszer engedélyezve
ko: 비너스 도움말 시스템 활성화
sv_se: Aktivera Venus-hjälpsystemet

source: Disable animation while turning
hu_hu: Animáció tiltás forgás közben
ko: 회전 중 애니메이션 비활성화
sv_se: Inaktivera animering när skärmen vänds

source: Disable animation while turning in panorama mode
hu_hu: Animáció kikapcsolása panoráma módban való forgás közben
ko: 파노라마 모드에서 회전 중 애니메이션을 비활성화
sv_se: Inaktivera animering medan skärmen vänds i panoramaläge

source: Use high resolution MPEG video
hu_hu: Nagy felbontású MPEG videó használata
ko: 고해상도 MPEG 비디오 사용
sv_se: Använd högupplösta MPEG-video

source: Use MPEG video from the DVD version instead of lower resolution AVI
hu_hu: A DVD verzió MPEG videójának használata, a kisebb felbontású AVI helyett
ko: 저해상도 AVI 대신 DVD 버전의 MPEG 비디오를 사용
sv_se: Använd MPEG-video från DVD-versionen istället för lågupplöst AVI

source: Enable widescreen support
sv_se: Aktivera bredbildsstöd

source: Rearrange placement of menus & subtitles so as to make better use of modern wide aspect ratio displays
sv_se: Ordna om placeringen av menyer och undertexter för att bättre utnyttja moderna skärmar med bredbildsformat

source: Enable high quality panoramas
sv_se: Aktivera panoramabilder i hög kvalitet

source: Apply bilinear filtering to panoramic backgrounds
sv_se: Tillämpa bilinjär filtrering för panoramabakgrunder

source: Spellbook
hu_hu: Varázskönyv
ko: 스펠북
sv_se: Trollformelbok

source: Score
hu_hu: Pontszám
ko: 점수
sv_se: Poäng

source: Put away object
hu_hu: Tárgy elrakása
ko: 개체 정리 및 보관
sv_se: Lägg undan objekt

source: Extract coin
hu_hu: Érmét kivon
ko: 동전 추출
sv_se: Extrahera mynt

source: Preferences
hu_hu: Preferenciák
ko: 환경설정
sv_se: Inställningar

source: Before playing this game, you'll need to copy the required fonts into ScummVM's extras directory, or into the game directory. On Windows, you'll need the following font files from the Windows font directory: Times New Roman, Century Schoolbook, Garamond, Courier New and Arial. Alternatively, you can download the Liberation Fonts package. You'll need all the fonts from the font package you choose, i.e., LiberationMono, LiberationSans and LiberationSerif.
hu_hu: A játék indítása előtt a következő betűtípusokat kell bemásolnia a ScummVM extra mappájába, vagy a játék mappájába. Windows platformon a következő betűtípusok szükségesek a Windows Font könyvtárból: Times New Roman, Century Schoolbook, Garamond, Courier New és Arial. Esetlegesen letöltheti a Liberation Betűtípusok csomagot. Minden betűtípusra szükség van a választott csomagból pl: LiberationMono, LiberationSans és LiberationSerif.
ko: 이 게임을 하기 전에 필요한 글꼴을 ScummVM의 extras 디렉터리나 게임 디렉터리에 복사해야 합니다. 윈도우즈에서는 윈도우즈 글꼴 디렉터리에서 Times New Roman, Century Schoolbook, Garamond, Courier New, Arial 등의 글꼴 파일이 필요합니다. 또는 Liberation Fonts 패키지를 다운로드할 수 있습니다. 선택한 글꼴 패키지의 모든 글꼴, 즉 LiberationMono, LiberationSans, LiberationSerif가 필요합니다.
sv_se: Innan du spelar detta spel måste du kopiera de typsnitt som krävs in i ScummVMs extras-katalog, eller in i spelkatalogen. På Windows kommer du att behöva följande typsnittsfiler från Windows typsnittskatalog: Times New Roman, Century Schoolbook, Garamond, Courier New och Arial. Alternativt kan du hämta ner Liberation-typsnitten. Du kommer att behöva alla typsnitten från typsnittspaketet du väljer, d.v.s. LiberationMono, LiberationSans och LiberationSerif.

source: MIDI playback is not available, or else improperly configured. Zork Nemesis contains several music puzzles which require MIDI audio in order to be solved. These puzzles may alternatively be solved using subtitles, if supported. Continue launching game?
sv_se: MIDI-uppspelning är inte tillgänglig eller felaktigt konfigurerad. Zork Nemesis innehåller flera musikpussel som kräver MIDI-ljud för att kunna lösas. Dessa pussel kan alternativt lösas med hjälp av undertexter, om detta stöds. Vill du fortsätta spela?

source: OK
ko: 확인

source: Backend
ko: 백엔드

source: MIDI
ko: 미디

source: Reverb
hu_hu: Visszhang
ko: 리버브

source: Chorus
hu_hu: Kórus
ko: 코러스

# group
source: Initial
hu_hu: Kezdeti
ko: 초기

source: Shader:
ko: 셰이더:

source: AdLib emulator:
hu_hu: AdLib emulátor:
ko: 애드립 에뮬레이터:

source: SoundFont:
ko: 사운드폰트:

# lowres
source: SoundFont:
ko: 사운드폰트:

source: * Pre
hu_hu: * Elő
ko: * 예측

source: * Num
hu_hu: * Szám
ko: * 숫자

source: Standard
hu_hu: Szabványos
ko: 일반

source: Ok
ko: 확인

source: Could not find any engine capable of running the selected game
ko: 선택한 게임을 실행할 수 있는 엔진을 찾을 수 없음

source: Alt
ko: Alt 키

source: Enter
ko: 엔터

source: ~O~K
ko: 확인(~O~)

source: AdLib emulator
hu_hu: AdLib emulátor
ko: 애드립 에뮬레이터

source: MAME OPL emulator
hu_hu: MAME OPL emulátor
ko: 마메 OPL 에뮬레이터

source: DOSBox OPL emulator
hu_hu: DOSBox OPL emulátor
ko: 도스박스 OPL 에뮬레이터

source: Nuked OPL emulator
hu_hu: Nuked OPL emulátor
ko: 누크드 OPL 에뮬레이터

source: ALSA Direct FM
ko: ALSA 다이렉트 FM

source: RetroWave OPL3
ko: 레트로웨이브 OPL3

source: Creative Music System emulator
hu_hu: Creative Music System emulátor
ko: 크레이티브 뮤직 시스템 에뮬레이터

source: MT-32 emulator
hu_hu: MT-32 emulátor
ko: MT-32 에뮬레이터

source: IBM PCjr emulator
hu_hu: IBM PCjr emulátor
ko: IBM PCjr 에뮬레이터

source: Global
hu_hu: Átfogó
ko: 글로벌

source: SDL Surface
hu_hu: SDL Felület
ko: SDL 표면

source: Left Mouse Button
ko: 왼쪽 마우스 버튼

source: Right Mouse Button
ko: 오른쪽 마우스 버튼

source: Middle Mouse Button
ko: 중간 마우스 버튼

source: Mouse Wheel Up
ko: 마우스 휠 올림

source: Mouse Wheel Down
ko: 마우스 휠 내림

source: X1 Mouse Button
ko: X1 마우스 버튼

source: X2 Mouse Button
ko: X2 마우스 버튼

source: Joy A
ko: 조이패드 A 버튼

source: Joy B
ko: 조이패드 B 버튼

source: Joy X
ko: 조이패드 X 버튼

source: Joy Y
ko: 조이패드 Y 버튼

source: Joy Back
ko: 조이패드 백 버튼

source: Joy Guide
ko: 조이패드 가이드 버튼

source: Joy Start
ko: 조이패드 시작 버튼

source: Left Stick
ko: 왼쪽 스틱

source: Right Stick
ko: 오른쪽 스틱

source: Left Shoulder
ko: 왼쪽 숄더 버튼

source: Right Shoulder
ko: 오른쪽 숄더 버튼

source: D-pad Center
ko: 십자 패드 중앙

source: Left Trigger
ko: 왼쪽 트리거 버튼

source: Right Trigger
ko: 오른쪽 트리거 버튼

source: Windows MIDI
ko: 윈도우즈 미디

source: A
ko: A 버튼

source: X
ko: X 버튼

source: Y
ko: Y 버튼

source: ZL
ko: ZL 버튼

source: ZR
ko: ZR 버튼

source: L
ko: L 버튼

source: R
ko: R 버튼

source: C-Pad X
ko: C-패드 X

source: C-Pad Y
ko: C-패드 Y

source: Status:
hu_hu: Státusz:
ko: 상태:

source: ## Libretro playlists for ScummVM core Playlists used in Libretro frontends (e.g. Retroarch) are plain text lists used to directly launch a game with a specific core from the user interface. Those lists are structured to pass to the core the path of a specific content file to be loaded (e.g. ROM). ScummVM core can accept as content the path to any of the files inside a valid game folder, the detection system will try to autodetect the game from the content file parent folder and run the game with default ScummVM options. The core also supports dedicated per game **hook** plain text files with **.
ko: ## ScummVM 코어용 Libretro 재생목록 Libretro 프런트엔드(예: Retroarch)에서 사용되는 재생목록은 사용자 인터페이스에서 특정 코어로 게임을 직접 시작하는 데 사용되는 일반 텍스트 목록입니다. 이러한 목록은 불러올 특정 콘텐츠 파일(예: ROM)의 경로를 코어에 전달하도록 구조화되어 있습니다. ScummVM 코어는 유효한 게임 폴더 내의 모든 파일에 대한 경로를 콘텐츠로 허용할 수 있으며, 감지 시스템은 콘텐츠 파일 부모 폴더에서 게임을 자동으로 감지하고 기본 ScummVM 옵션으로 게임을 실행합니다. 코어는 또한 **를 포함한 게임별 **후크** 일반 텍스트 파일을 지원합니다.

source: Freefont License
ko: Freefont 라이선스

source: L2
ko: L2 버튼

source: R2
ko: R2 버튼

source: L3
ko: L3 버튼

source: R3
ko: R3 버튼

source: L1
ko: L1 버튼

source: R1
ko: R1 버튼

source: Minus
hu_hu: Mínusz
ko: - 버튼

source: Plus
hu_hu: Plusz
ko: + 버튼

source: Video
hu_hu: Videó
ko: 비디오

source: GC Pad acceleration:
hu_hu: GC Pad gyorsulás:
ko: 게임큐브 패드 가속:

source: Status:
hu_hu: Státusz:
ko: 상태:

source: Server:
hu_hu: Szerver:
ko: 서버:

source: Toggle music on/off
ko: 음악 켜기/끄기 전환

source: Toggle sound effects on/off
ko: 사운드 효과 켜기/끄기 전환

source: Toggle fast mode on/off
ko: 빠른 모드 켜기/끄기 전환

source: Toggle background sounds on/off
ko: 배경음 켜기/끄기 전환

source: Toggle hitbox names on/off
ko: 히트박스 이름 켜기/끄기 전환

source: Toggle animation on/off
ko: 애니메이션 켜기/끄기 전환

source: Escape
ko: 탈출

source: Toggle Combat
ko: 전투 전환

source: Skip dialogue
ko: 대화 건너뛰기

source: Game Options
ko: 게임 옵션

source: Open KIA Database
ko: KIA 데이터베이스 열기

source: Delete Selected Saved Game
ko: 선택한 저장된 게임 삭제

source: Scroll Up
ko: 위로 스크롤

source: Scroll Down
ko: 아래로 스크롤

source: Toggle Clue Privacy
ko: 단서 개인 정보 보호 전환

source: Save Game
ko: 게임 저장

source: Load Game
ko: 게임 불러오기

source: Crime Scene Database
ko: 범죄 현장 데이터베이스

source: Suspect Database
ko: 용의자 데이터베이스

source: Clue Database
ko: 단서 데이터베이스

source: Quit Game
ko: 게임 종료

source: Exit/Skip
ko: 나가기/건너뛰기

source: Game Info
ko: 게임 정보

source: Quit Prompt
ko: 프롬프트 종료

source: Inventory Item 1 (Select/Deselect)
ko: 인벤토리 아이템 1 (선택/해제)

source: Inventory Item 2 (Select/Deselect)
ko: 인벤토리 아이템 2 (선택/해제)

source: Inventory Item 3 (Select/Deselect)
ko: 인벤토리 아이템 3 (선택/해제)

source: Inventory Item 4 (Select/Deselect)
ko: 인벤토리 아이템 4 (선택/해제)

source: Inventory Item 5 (Select/Deselect)
ko: 인벤토리 아이템 5 (선택/해제)

source: Inventory Item 6 (Select/Deselect)
ko: 인벤토리 아이템 6 (선택/해제)

source: Inventory Item 7 (Select/Deselect)
ko: 인벤토리 아이템 7 (선택/해제)

source: Inventory Item 8 (Select/Deselect)
ko: 인벤토리 아이템 8 (선택/해제)

source: DEBUG: Access to Location 1
ko: 디버그: 위치 1에 대한 접속

source: DEBUG: Access to Locations 1-8
ko: 디버그: 위치 1-8에 대한 접속

source: DEBUG: Access to Locations 1-16
ko: 디버그: 위치 1-16에 대한 접속

source: DEBUG: Access to Locations 1-23
ko: 디버그: 위치 1-23에 대한 접속

source: DEBUG: Access to Locations 1-24
ko: 디버그: 위치 1-24에 대한 접속

source: Close the Dialogue box
ko: 대화 상자를 닫기

source: Talk/Interact
ko: 대화/상호작용

source: Next Page
ko: 다음 페이지

source: Previous Page
ko: 이전 페이지

source: Quick Save
ko: 빠른 저장

source: Quick Load
ko: 빠른 불러오기

source: Exit game
ko: 게임 나가기

source: Change Command
ko: 변경 명령

source: Time Advance
ko: 타임 어드밴스

source: Skip intro/Exit map or inventory
ko: 인트로 건너뛰기/지도 또는 인벤토리 나가기

source: Debug Graphics
ko: 그래픽 디버그

source: Strafe Left
ko: 왼쪽으로 폭겨

source: Strafe Right
ko: 오른쪽으로 폭격

source: Info Menu
ko: 정보 메뉴

source: Thor Dies
ko: 토르가 죽음

source: Speed Up Cutscene
ko: 컷씬 속도 높임

source: Use/Talk
ko: 사용/대화

source: Pick up/Put away
ko: 줍기/내려놓기

source: Cycle Objects Up
ko: 개체 위로 순환

source: Cycle Objects Down
ko: 개체 아래로 순환

source: Quick Room Exit
ko: 빠른 룸 나가기

source: Examine/Look
ko: 조사하기/보기

source: Option dialog
ko: 대화 옵션

source: Lean Left
ko: 십자 패드 왼쪽

source: Lean Right
ko: 십자 패드 오른쪽

source: Interact Mode
ko: 상호작용 모드

source: Look Mode
ko: 보기 모드

source: Personal Notes
ko: 개인 노트

source: Remora
ko: 레모라

source: Side Step
ko: 사이드 스텝

source: Make implementation of AD&D rules more compliant with the AD&D 2nd edition handbook
ko: AD&D 2차 수정판 핸드북을 통해 AD&D 규칙 구현을 보다 준수하도록 함

source: Interact via Left Click
ko: 왼쪽 클릭으로 상호 작용

source: Interact via Right Click
ko: 오른쪽 클릭으로 상호 작용

source: Move Backwards
ko: 뒤로 이동

source: Move Left
ko: 왼쪽으로 이동

source: Move Right
ko: 오른쪽으로 이동

source: Open/Close Inventory
ko: 인벤토리 열기/닫기

source: Switch Inventory/Character screen
ko: 인벤토리/캐릭터 화면 전환

source: Cast Spell
ko: 주문 시전

source: Spell Level 1
ko: 주문 수준 1

source: Spell Level 2
ko: 주문 수준 2

source: Spell Level 3
ko: 주문 수준 3

source: Spell Level 4
ko: 주문 수준 4

source: Spell Level 5
ko: 주문 수준 5

source: Spell Level 6
ko: 주문 수준 6

source: Attack 1
hu_hu: 1. Támadás
ko: 공격 1

source: Attack 2
hu_hu: 2. Támadás
ko: 공격 2

source: Attack 3
hu_hu: 3. Támadás
ko: 공격 3

source: Show Map
ko: 지도 표시

source: Slide Left
ko: 왼쪽으로 슬라이드

source: Slide Right
ko: 오른쪽으로 슬라이드

source: Choose Spell
ko: 주문 선택

source: View Party Member 1
ko: 파티 멤버 1 보기

source: View Party Member 2
ko: 파티 멤버 2 보기

source: View Party Member 3
ko: 파티 멤버 3 보기

source: View Party Member 4
ko: 파티 멤버 4 보기

source: View Party Member 5
ko: 파티 멤버 5 보기

source: View Party Member 6
ko: 파티 멤버 6 보기

source: Quick Reference
ko: 빠른 참조

source: Toggle Minimap
ko: 미니맵 전환

source: Reorder Party
ko: 파티 재편성

source: Might and Magic 1
ko: 마이트 앤 매직 1

source: Normal
hu_hu: Normál
ko: 보통

source: Nancy Drew
ko: 낸시 드류

source: Left Click Interact
ko: 왼쪽 클릭 상호 작용

source: Right Click Interact
ko: 오른쪽 클릭 상호 작용

source: Show/hide maze map
ko: 미로지도 표시/숨기기

source: <original>
hu_hu: <eredeti>
ko: <원본>

source: Up/Zoom In/Move Forward/Open Doors
ko: 위로/확대/앞으로 이동/문 열기

source: Down/Zoom Out
ko: 아래로/축소

source: Display/Hide Inventory Tray
ko: 인벤토리 트레이 표시/숨기기

source: Display/Hide Biochip Tray
ko: 바이오칩 트레이 표시/숨기기

source: Toggle Center Data Display
ko: 중앙 데이터 표시 전환

source: Display/Hide Info Screen
ko: 정보 화면 표시/숨기기

source: Display/Hide Pause Menu
ko: 일시 정지 메뉴 표시/숨기기

source: Show dialogue
ko: 대화 표시

source: Standard (GM / MT-32)
hu_hu: Szabványos (GM / MT-32)
ko: 일반 (GM / MT-32)

source: Roland D-110 / D-10 / D-20
ko: 롤랜드 D-110 / D-10 / D-20

source: Yamaha FB-01
ko: 야마하 FB-01

source: Casio MT-540
ko: 카시오 MT-540

source: Casio CT-460 / CSM-1
ko: 카시오 CT-460 / CSM-1

source: Expert
hu_hu: Szakértő
ko: 전문가
