Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: ## Touch control modes The touch control mode can be changed by tapping or clicking on the controller icon in the upper right corner, by swiping two fingers from left to right, or in the global settings from the Launcher go to **Global Options > Backend > Choose the preferred touch mode**. It's possible to configure the touch mode for three situations (ScummVM menus, 2D games and 3D games). ### Direct mouse The touch controls are direct. The pointer jumps to where the finger touches the screen (default for menus). ![Direct mouse mode](mouse.png "Direct mouse mode"){w=10em} ### Touchpad emulation The touch controls are indirect, like on a laptop touchpad. ![Touchpad mode](touchpad.png "Touchpad mode"){w=10em} To select the preferred touch mode for menus, 2D games, and 3D games, go to **Global Options > Backend > Choose the preferred touch mode**. ## Touch actions | Gesture | Action | ------------------|------------------- | `One finger tap` | Left mouse click | `Two fingers tap` | Right mouse click | `Two fingers double tap` | ESC | `One finger press & hold for >0.5s` | Left mouse button hold and drag, such as for selection from action wheel in Curse of Monkey Island | `Two fingers press & hold for >0.5s` | Right mouse button hold and drag, such as for selection from action wheel in Tony Tough | `Two fingers swipe (left to right)` | Toggles between the touch modes | `Two fingers swipe (right to left)` | Toggles virtual controller (>iOS 15) | `Two fingers swipe (top to bottom)` | Access Global Main Menu in games | `Pinch (zoom in/out)` | Enables/disables keyboard ### Virtual Gamepad Devices running iOS 15 or later can connect virtual gamepad controller by swiping two fingers from right to left or through **Global Options > Backend**. The directional button can be configured to either a thumbstick or a dpad. **Note** While the virtual controller is connected it is not possible to perform mouse clicks using tap gestures since they are disabled as long as the virtual controller is visible. Left mouse clicks are performed by pressing the A button. Tap gestures are enabled again when virtual controller is disconnected. ### Global Main Menu To open the Global Main Menu, tap on the menu icon at the top right of the screen or swipe two fingers downwards. ![Menu icon](menu.png "Menu icon"){w=10em} ## Virtual keyboard To open the virtual keyboard, long press on the controller icon at the top right of the screen, perform a pinch gesture (zoom out) or tap on any editable text field. To hide the virtual keyboard, tap the controller icon again, do an opposite pinch gesture (zoom in) or tap outside the text field. ![Keyboard icon](keyboard.png "Keyboard icon"){w=10em}
hu_hu: ## Érintős irányítómódok Az érintési irányító módok megváltoztathatóak a jobb felső sarokban levő kontroller ikonra kattintva vagy érintve, majd két újjal balról jobbra húzva a képet két újjal, vagy az átfogó beállításokban az indítóból **Átfogó Opciók > Backend > Preferált érintésmód**. Az érintésmód beállítható három estre is (ScummVM menük, 2D játékok és 3D játékok). ### Direkt egér Az érintő irányítás direkt módon történik. A mutató oda ugrik, ahol a képernyő érintésre kerül (alapértelmezett a menüknél). ![Direkt egér mód](mouse.png "Direkt egér mód"){w=10em} ### Tapipad emuláció Az érintési irányítás indirekt módon történik, mint egy laptop tapipadján. ![Tapipad mód](touchpad.png "Tapipad mód"){w=10em} A preferált menü, 2D játékok, 3D játékok érintő mód kiválasztásához menjen az **Átfogó Opciók > Backend > Preferált érintőmód kiválasztása** opcióhoz. ## Érintő műveletek | Gesztus | Művelet | ------------------|------------------- | `Egyujjas érintés` | Bal egér gomb | `Kétujjas érintés` | Right mouse click | `Kétujjas dupla érintés` | ESC | `Egyujjas érintés & lenyomva tartás >0.5mp-en keresztül` | Bal egérgombos tartás és áthelyezés, mint ahogy a Curse of Monkey Island választó kerekénél használható | `Egyujjas érintés & lenyomva tartás >0.5mp-en keresztül` | Jobb egérgombos tartás és áthelyezés, mint a Tony Tough műveleti kerekénél | `Kétujjas félrehúzás (balról jobbra)` | Érintő módok közötti váltás | `Kétujjas félrehúzás (jobbról balra)` | Virtuális kontroller bekapcsolása (>iOS 15) | `Kétujjas félrehúzás (fentről lefelé)` | Átfogó FŐmenü elérése a játékokban | `Csípés (nagyítás be/ki)` | Billentyűzet ki/be kapcsolása ### Virtuális Gamepad A legalább iOS 15-el rendelkező eszközök képesek csatlakozni a virtuális gamepadhoz ha két újjal jobbról balra félrehúzza a képernyőt, vagy a **Átfogó Opciók > Backend** opción keresztül. Az iránygombok használhatóak joy karként vagy irányválasztóként. **Jegyzet** Amíg a virtuális kontroller csatlakoztatva van, nem lehet egérgomb lenyomást eszközölni érintéssel egészen addig amíg a kontroller látható. Bal egérgomb lenyomást az A gombbal végezhetünk. Az érintő gesztus akkor aktiválódik újra, ha a virtuális kontrollert lecsatlakoztatja. ### Átfogó Fő Menü Az átfogó Fő Menü megnyitásához nyomjon a menü ikonra a jobb felső sarokban, vagy húzza fentről lefelé a képernyőt két ujjal. ![Menü ikon](menu.png "Menü ikon"){w=10em} ## Virtuális billentyűzet A virtuális billentyűzet megnyitásához nyomja hosszan a kontroller ikon a képernyő jobb felső sarkában, majd egy csípész gesztust (kinagyítás), vagy nyomjon bármely szerkeszthető szövegdobozra. A virtuális billentyűzet elrejtéséhez érintse meg újra a kontroller ikont, majd az előzővel ellentétes csípés gesztus hajtson végre, vagy csak érintse meg a képet a szövegdobozon kívül. ![Billentyűzet ikon](keyboard.png "Billentyűzet ikon"){w=10em}
ko: ## 터치 컨트롤 모드 터치 컨트롤 모드는 오른쪽 상단 모서리에 있는 컨트롤러 아이콘을 탭하거나 클릭하거나, 두 손가락을 왼쪽에서 오른쪽으로 쓸어 넘기거나, 런처의 글로벌 설정에서 **글로벌 옵션 > 백엔드 > 선호하는 터치 모드 선택**으로 이동하여 변경할 수 있습니다. 세 가지 상황(ScummVM 메뉴, 2D 게임 및 3D 게임)에 대해 터치 모드를 구성할 수 있습니다. ### 직접 마우스 터치 컨트롤은 직접적입니다. 포인터는 메뉴의 기본값 손가락이 화면을 터치하는 곳으로 이동합니다. ![Direct mouse mode](mouse.png "Direct mouse mode"){w=10em} ### 터치패드 에뮬레이션 터치 컨트롤은 노트북의 터치패드처럼 간접적입니다. ![Touchpad mode](touchpad.png "Touchpad mode"){w=10em} 메뉴, 2D 게임, 3D 게임에 적합한 터치 모드를 선택하려면 **글로벌 옵션 > 백엔드 > 원하는 터치 모드 선택**으로 이동하세요. ## 터치 동작 | 제스처 | 동작 | ------------------|------------------- | `한 손가락 탭` | 왼쪽 마우스 클릭 | `두 손가락 탭` | 오른쪽 마우스 클릭 | `두 손가락 두 번 탭` | ESC | `한 손가락으로 0.5초 이상 누르고 있음` | 왼쪽 마우스 버튼을 누른 채로 드래그하면 원숭이 섬의 저주의 액션 휠에서 선택할 수 있음 | `두 손가락으로 0.5초 이상 누르고 있음` | 오른쪽 마우스 버튼을 누른 채로 드래그하면 토니 터프의 액션 휠에서 선택할 수 있음 | `두 손가락으로 밀기 (왼쪽에서 오른쪽으로)` | 터치 모드 간 전환 | `두 손가락으로 밀기 (오른쪽에서 왼쪽으로)` | 가상 컨트롤러 전환 (>iOS 15) | `두 손가락으로 밀기 (위에서 아래로)` | 게임 내 글로벌 메인 메뉴 접속 | `핀치 (확대/축소)` | 키보드 활성화/비활성화 ### 가상 게임패드 iOS 15 이상을 실행하는 장치는 두 손가락을 오른쪽에서 왼쪽으로 밀거나 **글로벌 옵션 > 백엔드**를 통해 가상 게임패드 컨트롤러를 연결할 수 있습니다. 방향 버튼은 엄지스틱 또는 십자 패드로 구성할 수 있습니다. **참고** 가상 컨트롤러가 연결되어 있는 동안은 가상 컨트롤러가 표시되는 한 탭 제스처가 비활성화되어 있으므로 탭 제스처를 사용하여 마우스 클릭을 수행할 수 없습니다. 왼쪽 마우스 클릭은 A 버튼을 눌러 수행합니다. 가상 컨트롤러가 연결 해제되면 탭 제스처가 다시 활성화됩니다.. ### 글로벌 메인 메뉴 글로벌 메인 메뉴를 열려면 화면 오른쪽 상단에 있는 메뉴 아이콘을 탭하거나 두 손가락을 아래로 살짝 밉니다. ![Menu icon](menu.png "Menu icon"){w=10em} ## 가상 키보드 가상 키보드를 열려면 화면 오른쪽 상단의 컨트롤러 아이콘을 길게 누르거나, 핀치 제스처(축소)를 수행하거나, 편집 가능한 텍스트 필드를 탭합니다. 가상 키보드를 숨기려면 컨트롤러 아이콘을 다시 탭하거나, 반대로 핀치 제스처(확대)를 수행하거나, 텍스트 필드 밖을 탭합니다. ![Keyboard icon](keyboard.png "Keyboard icon"){w=10em}
sv_se: ## Lägen för pekstyrning Pekstyrningsläget kan ändras genom att trycka eller klicka på styrenhetsikonen i det övre högra hörnet, genom att svepa med två fingrar från vänster till höger, eller i de globala inställningarna från spelstartaren gå till **Globala inställningar > Backend > Välj önskat pekläge**. Det är möjligt att konfigurera pekläget för tre situationer (ScummVM-menyer, 2D-spel och 3D-spel). ### Direkt mus Pekkontrollerna är direkta. Pekaren hoppar till den plats där fingret rör vid skärmen (standard för menyer). ![Direkt musläge](mouse.png "Direkt musläge"){w=10em} ### Emulering av pekplatta Pekkontrollerna är indirekta, som på en bärbar dators pekplatta. ![Pekplattans läge](touchpad.png "Pekplattans läge"){w=10em} För att välja önskat pekläge för menyer, 2D-spel och 3D-spel, gå till **Globala inställningar > Backend > Välj önskat pekläge**. ## Pekåtgärder | Gest | Åtgärd | ------------------|------------------- | Ett fingers tryck | Vänster musklick | Två fingrar trycker på höger musklick | `Två fingrar dubbelklickar` | ESC | `Ett fingers tryck och håll i >0,5s` | Vänster musknapp håll och dra, till exempel för att välja från actionhjulet i Curse of Monkey Island | `Två fingrar trycker och håller ned i >0,5s` | Höger musknapp hålls ned och dras, t.ex. för att välja från actionhjulet i Tony Tough | `Svep med två fingrar (vänster till höger)` | Växlar mellan peklägena | `Två fingrar sveper (höger till vänster)` | Växlar virtuell kontroll (>iOS 15) | "Svep med två fingrar (uppifrån och ned)" | Tillgång till den globala huvudmenyn i spel | "Nyp (zooma in/ut)" | Aktiverar/inaktiverar tangentbord ### Virtuell spelkontroll Enheter som kör iOS 15 eller senare kan ansluta en virtuell gamepad-kontroller genom att svepa två fingrar från höger till vänster eller via **Globala inställningar > Backend**. Riktningsknappen kan konfigureras till antingen en thumbstick eller en dpad. **Anmärkning** När den virtuella kontrollenheten är ansluten går det inte att utföra musklick med hjälp av tryckgester eftersom de är inaktiverade så länge den virtuella kontrollenheten är synlig. Vänster musklick utförs genom att trycka på A-knappen. Tap gestures aktiveras igen när den virtuella kontrollen kopplas bort. ### Global huvudmeny För att öppna den globala huvudmenyn trycker du på menyikonen längst upp till höger på skärmen eller sveper två fingrar nedåt. ![Menyikon](menu.png "Menyikon"){w=10em} ## Virtuellt tangentbord Du öppnar det virtuella tangentbordet genom att trycka länge på styrenhetsikonen längst upp till höger på skärmen, göra en nyprörelse (zooma ut) eller trycka på ett redigerbart textfält. För att dölja det virtuella tangentbordet trycker du på controller-ikonen igen, gör en motsatt nypgest (zoomar in) eller trycker utanför textfältet. ![Tangentbordsikon](keyboard.png "Tangentbordsikon"){w=10em}

source: External keyboard
hu_hu: Külső billentyűzet
ko: 외부 키보드
sv_se: Externt tangentbord

source: ## Use of keyboard External keyboards are supported and from iOS 13.4 most of the special keys, e.g. function keys, Home and End, are mapped. For external keyboards missing the special keys, e.g. the Apple Magic Keyboard for iPads, the special keys can be triggered using the following key combinations: | Key combination | Action | ------------------|------------------- | `CMD + 1` | F1 | `CMD + 2` | F2 | `...` | ... | `CMD + 0` | F10 | `CMD + SHIFT + 1` | F11 | `CMD + SHIFT + 2` | F12 | `CMD + UP` | PAGE UP | `CMD + DOWN` | PAGE DOWN | `CMD + LEFT` | HOME | `CMD + RIGHT` | END
hu_hu: ## Billentyűzet használata Az iOS 13.4 óta támogatottak a külső billentyűzetek, a legtöbb speciális gomb mint a funkció gombok, Home, End, már mind előre map-pelve vannak. A speciális gomb nélküli külső billentyűzetek esetében, pl: az Ipad-ekhez járó Apple Magic Keyboard a speciális gombok a következő kombinációkkal érhetőek el: | Gomb kombinációk | Művelet | ------------------|------------------- | `CMD + 1` | F1 | `CMD + 2` | F2 | `...` | ... | `CMD + 0` | F10 | `CMD + SHIFT + 1` | F11 | `CMD + SHIFT + 2` | F12 | `CMD + FEL` | PAGE UP | `CMD + LE` | PAGE DOWN | `CMD + BAL` | HOME | `CMD + JOBB` | END
ko: ## 키보드 사용 외부 키보드가 지원되고 iOS 13.4부터 대부분의 특수 키(예: 기능 키, Home 및 End)가 매핑됩니다. 특수 키가 없는 외부 키보드 (예: iPad용 애플 매직 키보드)의 경우 다음 키 조합을 사용하여 특수 키를 트리거할 수 있습니다: | 키 조합 | 작동 | ------------------|------------------- | `CMD + 1` | F1 | `CMD + 2` | F2 | `...` | ... | `CMD + 0` | F10 | `CMD + SHIFT + 1` | F11 | `CMD + SHIFT + 2` | F12 | `CMD + UP` | PAGE UP | `CMD + DOWN` | PAGE DOWN | `CMD + LEFT` | HOME | `CMD + RIGHT` | END
sv_se: ## Användning av tangentbord Externa tangentbord stöds och från iOS 13.4 är de flesta specialtangenterna, t.ex. funktionstangenter, Home och End, mappade. För externa tangentbord som saknar specialtangenter, t.ex. Apple Magic Keyboard för iPads, kan specialtangenterna utlösas med följande tangentkombinationer: | Tangentkombination | Åtgärd | ------------------|------------------- | `CMD + 1` | F1 | `CMD + 2` | F2 | `...` | ... | `CMD + 0` | F10 | `CMD + SHIFT + 1` | F11 | `CMD + SHIFT + 2` | F12 | `CMD + UP` | SIDA UPP | `CMD + NER` | SIDA NER | `CMD + VÄNSTER` | HOME | `CMD + HÖGER` | END

source: ## Adding Games 1. Copy the required game files to the ScummVM application. There are several ways to do that, see our [Transferring game files documentation](https://docs.scummvm.org/en/latest/other_platforms/ios.html#transferring-game-files) for more information. 2. Select **Add Game...** from the launcher. 3. In the ScummVM file browser, double-tap to browse to your added folder. Add a game by selecting the sub-folder containing the game files, then tap **Choose**. To add more games, repeat the steps above. See our [iOS documentation](https://docs.scummvm.org/en/latest/other_platforms/ios.html) for more information.
hu_hu: ## Játékok hozzáadása 1. Másolja a szükséges fájlokat a ScummVM applikációba. Erre többféle lehetőség is van, tekintse meg erről szóló [Játék fájlok másolása dokumentációnkat](https://docs.scummvm.org/en/latest/other_platforms/ios.html#transferring-game-files) a további információkért. 2. Válassza a **Játék hozzáadása...** gombot az indítóból. 3. A ScummVM fájl böngészőben dupla érintéssel keresse ki a hozzáadott könyvtárját. A játékot hozzá tudja adni szimplán a játékfájlokat tartalmazó alkönyvtár kiválasztásával, amit ki tud választani a **Kiválaszt** gombbal. További játékok hozzáadásához ismételje meg a fenti lépéseket. Tekintse meg az [iOS dokumentációnkat](https://docs.scummvm.org/en/latest/other_platforms/ios.html) a további információkért.
ko: ## 게임 추가 1. 필요한 게임 파일을 ScummVM 애플리케이션에 복사합니다. 여러 가지 방법이 있습니다. 자세한 내용은 [게임 파일 전송 설명서](https://docs.scummvm.org/en/latest/other_platforms/ios.html#transferring-game-files)를 참조하세요. 2. 런처에서 **게임 추가...**를 선택합니다. 3.ScummVM 파일 브라우저에서 두 번 탭하여 추가한 폴더를 탐색합니다. 게임 파일이 들어 있는 하위 폴더를 선택하여 게임을 추가한 다음 **선택**을 탭합니다. 더 많은 게임을 추가하려면 위의 단계를 반복합니다. 자세한 내용은 [iOS 설명서](https://docs.scummvm.org/en/latest/other_platforms/ios.html)를 참조하세요.
sv_se: ## Lägga till spel 1. Kopiera de nödvändiga spelfilerna till ScummVM-programmet. Det finns flera sätt att göra det på, se vår [Dokumentation om överföring av spelfiler](https://docs.scummvm.org/en/latest/other_platforms/ios.html#transferring-game-files) för mer information. 2. Välj **Lägg till spel...** från spelstartaren. 3. I ScummVM:s filbläddrare dubbelklickar du för att bläddra till din tillagda mapp. Lägg till ett spel genom att välja den undermapp som innehåller spelfilerna och tryck sedan på **Välj**. Upprepa stegen ovan om du vill lägga till fler spel. Se vår [iOS-dokumentation](https://docs.scummvm.org/en/latest/other_platforms/ios.html) för mer information.

source: ## Touch actions ### Press Touch area Press Touch area to perform a left mouse click ### Play/Pause Press Play/Pause to perform a right mouse click ### Global Main Menu To open the Global Main Menu, press Back/Menu button. ## Virtual keyboard To open the virtual keyboard, press and hold the Play/Pause button. To hide the virtual keyboard, press the Back/Menu button.
hu_hu: ## Érintési műveletek ### Nyomja meg az Érintési területet Nyomja meg az érintési területet a bal egér gombnyomáshoz ### Lejátszás/Szünet Nyomja meg a Lejátszás/Szünet-et a jobb egér gombnyomáshoz ### Átfogó Fő Menü Az Átfogó Fő Menü megnyitásához nyomja meg a Vissza/Menü gombot. ## Virtuális billentyűzet A virtuális billentyűzet megnyitásához nyomja meg és tartsa lenyomva a Lejátszás/Szünet gombot. Elrejtéséhez nyomja meg a Vissza/Menü gombot.
ko: ## 터치 동작 ### 터치 영역 누르기 터치 영역을 눌러 왼쪽 마우스 클릭을 수행 ### 재생/일시 정지 재생/일시 정지를 눌러 오른쪽 마우스 클릭을 수행 ### 글로벌 메인 메뉴 글로벌 메인 메뉴를 열려면 뒤로/메뉴 버튼을 누릅니다. ## 가상 키보드 가상 키보드를 열려면 재생/일시 정지 버튼을 길게 누릅니다. 가상 키보드를 숨기려면 뒤로/메뉴 버튼을 누릅니다.
sv_se: ## Pekåtgärder ### Tryck på pekområde Tryck på pekområdet för att utföra ett vänster musklick ### Spela upp/Pausa Tryck på Spela upp/Paus för att utföra en höger musklickning ### Global huvudmeny För att öppna den globala huvudmenyn, tryck på Bakåt/Meny-knappen. ## Virtuellt tangentbord Öppna det virtuella tangentbordet genom att hålla Spela upp/Paus-knappen intryckt. För att dölja det virtuella tangentbordet, tryck på Bakåt/Meny-knappen.

source: ## Adding Games 1. Copy the required game files to the ScummVM application. There are several ways to do that, see our [Transferring game files documentation](https://docs.scummvm.org/en/latest/other_platforms/tvos.html#transferring-game-files) for more information. 2. Select **Add Game...** from the launcher. 3. In the ScummVM file browser, double-tap to browse to your added folder. Add a game by selecting the sub-folder containing the game files, then tap **Choose**. To add more games, repeat the steps above. See our [tvOS documentation](https://docs.scummvm.org/en/latest/other_platforms/tvos.html) for more information.
hu_hu: ## Játékok hozzáadása 1. Másolja a szükséges fájlokat a ScummVM applikációba. Erre többféle lehetőség is van, tekintse meg erről szóló [Játék fájlok másolása dokumentációnkat](https://docs.scummvm.org/en/latest/other_platforms/tvos.html#transferring-game-files) a további információkért. 2. Válassza a **Játék hozzáadása...** gombot az indítóból. 3. A ScummVM fájl böngészőben dupla érintéssel keresse ki a hozzáadott könyvtárját. A játékot hozzá tudja adni szimplán a játékfájlokat tartalmazó alkönyvtár kiválasztásával, amit ki tud választani a **Kiválaszt** gombbal. További játékok hozzáadásához ismételje meg a fenti lépéseket. Tekintse meg az [tvOS dokumentációnkat](https://docs.scummvm.org/en/latest/other_platforms/tvos.html) a további információkért.
ko: ## 게임 추가 1. 필요한 게임 파일을 ScummVM 애플리케이션에 복사합니다. 여러 가지 방법이 있습니다. 자세한 내용은 [게임 파일 전송 설명서](https://docs.scummvm.org/en/latest/other_platforms/tvos.html#transferring-game-files)를 참조하세요. 2. 런처에서 **게임 추가...**를 선택합니다. 3. ScummVM 파일 브라우저에서 두 번 탭하여 추가한 폴더를 찾습니다. 게임 파일이 들어 있는 하위 폴더를 선택하여 게임을 추가한 다음 **선택**을 탭합니다. 더 많은 게임을 추가하려면 위의 단계를 반복합니다. 자세한 내용은 [tvOS 설명서](https://docs.scummvm.org/en/latest/other_platforms/tvos.html)를 참조하세요.
sv_se: ## Lägga till spel 1. Kopiera de nödvändiga spelfilerna till ScummVM-programmet. Det finns flera sätt att göra det på, se vår [Dokumentation om överföring av spelfiler](https://docs.scummvm.org/en/latest/other_platforms/tvos.html#transferring-game-files) för mer information. 2. Välj **Lägg till spel...** från spelstartaren. 3. I ScummVM:s filbläddrare dubbelklickar du för att bläddra till din tillagda mapp. Lägg till ett spel genom att välja den undermapp som innehåller spelfilerna och tryck sedan på **Välj**. Upprepa stegen ovan om du vill lägga till fler spel. Se vår [tvOS-dokumentation](https://docs.scummvm.org/en/latest/other_platforms/tvos.html) för mer information.

source: LIBRETRO PLAYLIST GENERATOR
hu_hu: LIBRETRO JÁTÉKLISTA GENERÁTOR
ko: LIBRETRO 재생목록 생성기
sv_se: LIBRETRO SPELLISTGENERATOR

source: (check '? > Libretro playlist' for detailed info)
hu_hu: (check '? > Libretro játéklista' további információkért)
ko: (자세한 정보는 '? > Libretro 재생목록'에서 확인)
sv_se: (kontrollera '?> Libretro spellista' för detaljerad info)

source: Playlists Path
hu_hu: Játéklista Elérési út
ko: 재생목록 경로
sv_se: Sökväg för spellistor

source: Specifies where your playlist will be saved.
hu_hu: Játéklisták elérési útjának meghatározása.
ko: 재생목록이 저장될 위치를 지정합니다.
sv_se: Anger var dina spellistor kommer att sparas.

source: Playlist format:
hu_hu: Játéklista formátum:
ko: 재생목록 형식:
sv_se: Format för spellista:

source: Hooks location:
hu_hu: Hook helye:
ko: 후크 위치:
sv_se: Plats för hooks:

source: All in save folder
hu_hu: Minden a mentési könyvtárban
ko: 모두 저장 폴더에 있음
sv_se: Alla i sparningsmapp

source: One in each game folder
hu_hu: Mappánként egy
ko: 각 게임 폴더에 하나씩
sv_se: En i varje spelmapp

source: Clear existing hooks
hu_hu: Már meglevő Hook-ok törlése
ko: 기존 후크 지우기
sv_se: Töm befintliga hooks

source: Generate playlist
hu_hu: Játéklista generálása
ko: 재생목록 생성
sv_se: Generera spellista

source: Failed, can't access playlist file
hu_hu: Sikertelen, a játéklista nem elérhető
ko: 실패함, 재생목록 파일에 접근할 수 없음
sv_se: Misslyckades, kan inte komma åt spellistefil

source: cleaning failed
hu_hu: sikertelen tisztítás
ko: 지우기 실패함
sv_se: rensning misslyckades

source: Failed, can't create hook files
hu_hu: Sikertelen, hook fájl nem hozható létre
ko: 실패함, 후크 파일을 생성할 수 없음
sv_se: Misslyckades, kan inte skapa hook-filer

source: Select Playlist directory
hu_hu: Játéklista mappa kiválasztása
ko: 재생목록 디렉터리 선택
sv_se: Välj spellistkatalog

source: Libretro playlist
hu_hu: Libretro játéklista
ko: Libretro 재생목록
sv_se: Libretro-spellista

source: ## Libretro playlists for ScummVM core Playlists used in Libretro frontends (e.g. Retroarch) are plain text lists used to directly launch a game with a specific core from the user interface. Those lists are structured to pass to the core the path of a specific content file to be loaded (e.g. ROM). ScummVM core can accept as content the playlist-provided path to any of the files inside a valid game folder, the detection system will try to autodetect the game from the content file parent folder and run the game with default ScummVM options. The core also supports dedicated per game **hook** plain text files with **.
sv_se: ## Libretro-spellistor för ScummVM-kärnan Spellistor som används i Libretro-frontends (t.ex. Retroarch) är listor i klartext som används för att direkt starta ett spel med en specifik kärna från användargränssnittet. Dessa listor är strukturerade för att skicka sökvägen till en specifik innehållsfil som ska läsas in (t.ex. ROM) till kärnan. ScummVM-kärnan kan acceptera som innehåll spellistans tillhandahållna sökväg till någon av filerna i en giltig spelmapp, detekteringssystemet kommer att försöka autodetektera spelet från innehållsfilens överordnade mapp och köra spelet med standard ScummVM-alternativ. Kärnan stöder också dedikerade per spel **hook** ren textfiler med **.

source: Click Mode
hu_hu: Kattintás Mód
ko: 클릭 모드
sv_se: Klickläge

source: Left Click
hu_hu: Bal Kattintás
ko: 왼쪽 클릭
sv_se: Vänsterklick

source: Middle Click
hu_hu: Középső Kattintás
ko: 중간 클릭
sv_se: Mittenklick

source: Right Click
hu_hu: Jobb Kattintás
ko: 오른쪽 클릭
sv_se: Högerklick

source: Keyboard
hu_hu: Billentyűzet
ko: 키보드
sv_se: Tangentbord
