Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: ## Touch control modes The touch control mode can be changed by tapping or clicking on the controller icon in the upper right corner ### Direct mouse The touch controls are direct. The pointer jumps to where the finger touches the screen (default for menus). ![Direct mouse mode](mouse.png "Direct mouse mode"){w=10em} ### Touchpad emulation The touch controls are indirect, like on a laptop touchpad. ![Touchpad mode](touchpad.png "Touchpad mode"){w=10em} ### Gamepad emulation Fingers must be placed on lower left and right of the screen to emulate a directional pad and action buttons. ![Gamepad mode](gamepad.png "Gamepad mode"){w=10em} To select the preferred touch mode for menus, 2D games, and 3D games, go to **Global Options > Backend > Choose the preferred touch mode**. ## Touch actions ### Two finger scroll To scroll, slide two fingers up or down the screen ### Two finger tap To do a two finger tap, hold one finger down and then tap with a second finger. ### Three finger tap To do a three finger tap, start with holding down one finger and progressively touch down the other two fingers, one at a time, while still holding down the previous fingers. Imagine you are impatiently tapping your fingers on a surface, but then slow down that movement so it is rhythmic, but not too slow. ### Immersive Sticky fullscreen mode Swipe from the edge to reveal the system bars. They remain semi-transparent and disappear after a few seconds unless you interact with them. ### Global Main Menu To open the Global Main Menu, tap on the menu icon at the top right of the screen. ![Menu icon](menu.png "Menu icon"){w=10em} ## Virtual keyboard To open the virtual keyboard, long press on the controller icon at the top right of the screen, or tap on any editable text field. To hide the virtual keyboard, tap the controller icon again, or tap outside the text field. ![Keyboard icon](keyboard.png "Keyboard icon"){w=10em}
hu_hu: ## Érintő irányítás módok Az érintő mód megváltoztatható a jobb felső sarokban található kontroller ikonra kattintva vagy érintve ### Direkt egér Az érintő irányítás direkt módon történik. A mutató oda ugrik ahol megérinti a képernyőt (alapértelmezett a menüknél). ![Direkt egér mód](mouse.png "Direkt egér mód"){w=10em} ### Tapipad emuláció Az érintő irányítás indirekt módon történik, mint egy laptop tapipadján. ![Tapipad mód](touchpad.png "Tapipad mód"){w=10em} ### Gamepad emuláció Az ujjait helyezze a kép alsó jobb és bal sarkába, hogy így emulálja az irányválasztó irányzékait és az akciógombokat. ![Gamepad mód](gamepad.png "Game mód"){w=10em} Hogy ki tudja választani a preferált érintőmódot a 2D játékokhoz és a 3D játékokhoz, menjen az **Átfogó Opciók > Backend > Válassza ki a preferált érintőmódot**. ## Érintés műveletek ### Kétujjas görgetés A görgetéshez húzza a két ujját le vagy fel a képernyőn ### Kétujjas érintés A kétujjas érintéshez tartsa az egyik ujját a képernyőn, és érintse meg a másodikkal. ### Háromujjas érintés A háromujjas érintést kezdje azzal, hogy egy ujját a képernyőn tartja, majd folyamatosan egyenként érintse meg a képernyőt a másik két ujjával amíg a korábbi ujjak is a képernyőn maradnak. Hasonlóan mintha türelmetlenül kopogna a képernyőn, de lassítsa le magát az ütemet ritmusosra, de ne túl lassú ütemre. ### Belemerülő-ragadós teljesképernyős mód Ha lehúzza az ujját a képernyő szélétől, akkor feltárja a rendszer csíkokat. Áttetszők maradnak, és eltűnnek ha nem érinti meg őket. ### Átfogó Főmenü Az átfogó főmenü megnyitásához nyomjon a menü ikonra a képernyő jobb felső sarkában. ![Menü ikon](menu.png "Menü ikon"){w=10em} ## Virtuális billentyűzet A virtuális billentyűzet megnyitásához nyomja hossza a kontroller ikont a képernyő jobb felső sarkában, vagy nyomjon bármelyik szerkeszthető szövegmezőbe. Az elrejtéséhez nyomjon újra a kontroller ikonra, vagy a szövegmezőn kívűlre. ![Billentyűzet ikon](keyboard.png "Billentyűzet ikon"){w=10em}
ko: ## 터치 컨트롤 모드 터치 컨트롤 모드는 오른쪽 상단 모서리에 있는 컨트롤러 아이콘을 탭하거나 클릭하여 변경할 수 있음 ### 직접 마우스 터치 컨트롤은 직접적입니다. 포인터는 (메뉴의 기본값) 손가락이 화면을 터치하는 곳으로 이동합니다. ![Direct mouse mode](mouse.png "Direct mouse mode"){w=10em} ### 터치패드 에뮬레이션 터치 컨트롤은 노트북 터치패드처럼 간접적입니다. ![Touchpad mode](touchpad.png "Touchpad mode"){w=10em} ### 게임패드 에뮬레이션 방향 패드와 액션 버튼을 에뮬레이션 하려면 손가락을 화면의 왼쪽과 오른쪽 아래에 놓아야 합니다. ![Gamepad mode](gamepad.png "Gamepad mode"){w=10em} 메뉴, 2D 게임, 3D 게임에 대한 기본 터치 모드를 선택하려면 **글로벌 옵션 > 백엔드 > 기본 터치 모드 선택**으로 이동하세요. ## 터치 동작 ### 두 손가락 스크롤 스크롤하려면 두 손가락을 화면 위나 아래로 밀기 ### 두 손가락 탭 두 손가락 탭을 하려면 한 손가락을 누른 다음 두 번째 손가락으로 탭합니다. ### 세 손가락 탭 세 손가락으로 탭하려면 한 손가락을 누른 상태에서 다른 두 손가락을 한 번에 하나씩 점진적으로 터치하면서 이전 손가락은 계속 누릅니다. 손가락을 표면에 대고 참을성 없이 탭하는 모습을 상상해 보세요. 하지만 그 움직임을 느리게 해서 리듬을 맞추되 너무 느리지 않게 합니다. ### 몰입형 스티키 전체 화면 모드 가장자리에서 밀어 시스템 바를 표시합니다. 바는 반투명 상태로 유지되며, 상호작용하지 않는 한 몇 초 후에 사라집니다. ### 글로벌 메인 메뉴 글로벌 메인 메뉴를 열려면 화면 오른쪽 상단에 있는 메뉴 아이콘을 탭합니다. ![Menu icon](menu.png "Menu icon"){w=10em} ## 가상 키보드 가상 키보드를 열려면 화면 오른쪽 상단의 컨트롤러 아이콘을 길게 누르거나 편집 가능한 텍스트 필드를 탭합니다. 가상 키보드를 숨기려면 컨트롤러 아이콘을 다시 탭하거나 텍스트 필드 밖을 탭합니다. ![Keyboard icon](keyboard.png "Keyboard icon"){w=10em}
sv_se: ## Läget för pekstyrning Pekstyrningsläget kan ändras genom att trycka eller klicka på styrenhetsikonen i det övre högra hörnet ### Direkt mus Pekkontrollerna är direkta. Pekaren hoppar till den plats där fingret rör vid skärmen (standard för menyer). ![Direkt musläge](mouse.png "Direkt musläge"){w=10em} ### Emulering av pekplatta Pekkontrollerna är indirekta, som på en bärbar dators pekplatta. ![Pekplattans läge](touchpad.png "Pekplattans läge"){w=10em} ### Gamepad-emulering Fingrarna måste placeras längst ner till vänster och höger på skärmen för att emulera en styrplatta och åtgärdsknappar. ![Gamepad-läge](gamepad.png "Gamepad-läge"){w=10em} För att välja önskat pekläge för menyer, 2D-spel och 3D-spel, gå till **Globala inställningar> Backend > Välj önskat pekläge**. ## Pekåtgärder ### Bläddra med två fingrar För att bläddra, dra två fingrar uppåt eller nedåt på skärmen ### Tryck med två fingrar Tryck med två fingrar genom att hålla ner ett finger och sedan trycka med det andra fingret. ### Tryck med tre fingrar För att knacka med tre fingrar börjar du med att hålla ned ett finger och knackar sedan successivt med de andra två fingrarna, ett i taget, medan du fortfarande håller ned de föregående fingrarna. Föreställ dig att du otåligt knackar med fingrarna på en yta, men sakta sedan ner rörelsen så att den blir rytmisk, men inte för långsam. ### Immersive Sticky helskärmsläge Svep från kanten för att visa systemfälten. De förblir halvgenomskinliga och försvinner efter några sekunder om du inte interagerar med dem. ### Global huvudmeny För att öppna den globala huvudmenyn trycker du på menyikonen längst upp till höger på skärmen. ![Menyikon](menu.png "Menyikon"){w=10em} ## Virtuellt tangentbord Du öppnar det virtuella tangentbordet genom att trycka länge på styrenhetsikonen längst upp till höger på skärmen eller genom att trycka på ett redigerbart textfält. Du döljer det virtuella tangentbordet genom att trycka på controller-ikonen igen eller genom att trycka utanför textfältet. ![Tangentbordsikon](keyboard.png "Tangentbordsikon"){w=10em}

source: Adding Games
hu_hu: Játékok hozzáadása
ko: 게임 추가
sv_se: Lägger till spel

source: ## Adding Games 1. Select **Add Game...** from the launcher. 2. Inside the ScummVM file browser, select **Go Up** until you reach the root folder which has the **<Add a new folder>** option. ![ScummVM file browser root](browser-root.png "ScummVM file browser root"){w=70%} 3. Double-tap **<Add a new folder>**. In your device's file browser, navigate to the folder containing all your game folders. For example, **SD Card > ScummVMgames**. 4. Select **Use this folder**. ![OS selectable folder](fs-folder.png "OS selectable folder"){w=70%} 5. Select **ALLOW** to give ScummVM permission to access the folder. ![OS access permission dialog](fs-permission.png "OS access permission"){w=70%} 6. In the ScummVM file browser, double-tap to browse through your added folder. Add a game by selecting the sub-folder containing the game files, then tap **Choose**. ![SAF folder added](browser-folder-in-list.png "SAF folder added"){w=70%} Step 2 and 3 are done only once. To add more games, repeat Steps 1 and 6. See our [Android documentation](https://docs.scummvm.org/en/latest/other_platforms/android.html) for more information.
hu_hu: ## Játékok hozzáadása 1. Válassza a **Játék hozzáadása...** gombot az indítóban. 2. A ScummVM fájlkezelőn belül válassza a **Fel** lehetőséget egészen addig, amíg nem jut el a gyökérhez ahol már csak az **<Új mappa>** opció érhető el. ![ScummVM fájlkezelő gyökér](browser-root.png "ScummVM fájlkezelő gyökér"){w=70%} 3. Nyomjon duplán az **<Új mappa>** opcióra. Az eszközén navigáljon el ahhoz a könyvtárhoz, ami tartalmazza az összes játék könyvtárat. Például: ** SD Kártya > ScummVMjatekok**. 4. Válassza a **Ezen könyvtár használata** opciót. ![OS választható könyvtár](fs-folder.png "OS választható könyvtár"){w=70%} 5. Válassza az **ENGEDÉLYEZÉS** opciót, hogy hozzáférést biztosítson a könyvtárhoz a ScummVM számára. ![OS hozzáférés engedély ablak](fs-permission.png "OS hozzáférés engedély ablak"){w=70%} 6. A ScummVM fájlkezelőben nyomjon duplán a mappán belüli böngészéshez. Hozzáadhat egy játékot egy játék fájlokat tartalmazó alkönyvtár kiválasztásával, majd a **Kiválaszt** gomb megnyomásával.. ![SAF mappa hozzáadva](browser-folder-in-list.png "SAF mappa hozzáadva"){w=70%} A 2-es és 3-as pontokat csak egyszer kell elvégezni. További játékok hozzáadásához ismételje meg az 1--es és 6-os pontot. Tekintse meg az [Android dokumentációnkat](https://docs.scummvm.org/en/latest/other_platforms/android.html) további információkért.
ko: ## 게임 추가 1. 런처에서 **게임 추가...**를 선택합니다. 2. ScummVM 파일 브라우저에서 **<새 폴더 추가>** 옵션이 있는 루트 폴더에 도달할 때까지 **위로 이동**을 선택합니다. ![ScummVM 파일 브라우저 루트](browser-root.png "ScummVM 파일 브라우저 루트"){w=70%} 3. **<새 폴더 추가>**를 두 번 탭합니다. 기기의 파일 브라우저에서 모든 게임 폴더가 있는 폴더로 이동합니다. 예를 들어, **SD 카드 > ScummVMgames**. 4. **이 폴더 사용**을 선택합니다. ![OS 선택 가능 폴더](fs-folder.png "OS 선택 가능 폴더"){w=70%} 5. **허용**을 선택하여 ScummVM에 폴더에 접속할 수 있는 권한을 부여합니다. ![OS 접속 권한 대화 상자](fs-permission.png "OS 접속 권한 대화 상자"){w=70%} 6. ScummVM 파일 브라우저에서 두 번 탭하여 추가한 폴더를 탐색합니다. 게임 파일이 들어 있는 하위 폴더를 선택하여 게임을 추가한 다음 **선택**을 탭합니다. ![SAF 폴더 추가됨](browser-folder-in-list.png "SAF 폴더 추가됨"){w=70%} 2단계와 3단계는 한 번만 수행합니다. 게임을 더 추가하려면 1단계와 6단계를 반복합니다. 자세한 내용은 [안드로이드 설명서](https://docs.scummvm.org/en/latest/other_platforms/android.html)를 참조하세요.
sv_se: ## Lägga till spel 1. Välj **Lägg till spel...** från spelstartaren. 2. I ScummVM:s filbläddrare väljer du **Gå upp** tills du når rotmappen som har alternativet **<Lägg till en ny mapp>**. ![ScummVM-filbläddrarens rot](browser-root.png "ScummVM-filbläddrarens rot"){w=70%} 3. Dubbelklicka på **<Lägg till en ny mapp>**. I enhetens filbläddrare navigerar du till mappen som innehåller alla dina spelmappar. Till exempel, **SD-kort &gt; ScummVM-spel**. 4. Välj **Använd den här mappen**. ![OS-valbar mapp](fs-folder.png "OS-valbar mapp"){w=70%} 5. Välj **TILLÅT** för att ge ScummVM tillstånd att komma åt mappen. ![Dialog för OS-åtkomstbehörighet](fs-permission.png "OS-åtkomstbehörighet"){w=70%} 6. I ScummVM:s filbläddrare dubbelklickar du för att bläddra igenom den mapp du lagt till. Lägg till ett spel genom att välja den undermapp som innehåller spelfilerna och tryck sedan på **Välj**. ![SAF-mapp tillagd](browser-folder-in-list.png "SAF-mapp tillagd"){w=70%} Steg 2 och 3 görs bara en gång. Om du vill lägga till fler spel upprepar du steg 1 och 6. Se vår [Android-dokumentation](https://docs.scummvm.org/en/latest/other_platforms/android.html) för mer information.

source: Show On-screen control
hu_hu: Képernyőn-megjelenő irányító mutatása
ko: 화면상 조작 표시
sv_se: Visa kontroller på skärmen

source: Ignore safe areas in-game
sv_se: Ignorera säkra områden i spelet

source: Choose the preferred touch mode:
hu_hu: Válassza ki a preferált érintési módot:
ko: 선호하는 터치 모드를 선택:
sv_se: Välj önskat pekläge:

source: In menus
hu_hu: A menükben
ko: 메뉴에서
sv_se: I menyer

source: Touchpad emulation
hu_hu: Tapipad emuláció
ko: 터치패드 에뮬레이션
sv_se: Emulering av pekplatta

source: Direct mouse
hu_hu: Direkt egér
ko: 직접 마우스
sv_se: Direktmus

source: Gamepad emulation
hu_hu: Gamepad emuláció
ko: 게임패드 에뮬레이션
sv_se: Gamepad-emulering

source: In 2D games
hu_hu: 2D játékokban
ko: 2D 게임에서
sv_se: I 2D-spel

source: In 3D games
hu_hu: 3D játékokban
ko: 3D 게임에서
sv_se: I 3D-spel

source: Select the orientation:
hu_hu: Válassza ki a tájolást:
ko: 방향을 선택:
sv_se: Välj orientering:

source: Automatic
hu_hu: Automatikus
ko: 자동
sv_se: Automatisk

source: Portrait
hu_hu: Függőleges
ko: 세로 방향
sv_se: Porträtt

source: Landscape
hu_hu: Fekvőmód
ko: 가로 방향
sv_se: Landskap

source: In games
hu_hu: Játékokban
ko: 게임에서
sv_se: I spel

source: Export backup
sv_se: Exportera säkerhetskopia

source: Export a backup of the configuration and save files
sv_se: Exportera en säkerhetskopia av konfigurationen och sparade filer

source: Import backup
sv_se: Importera säkerhetskopia

source: Import a previously exported backup file
sv_se: Importera en tidigare exporterad säkerhetskopiefil

source: Remove folder authorizations...
hu_hu: Mappaengedélyek eltávolítása...
ko: 폴더 권한을 제거합니다...
sv_se: Ta bort mappbehörigheter...

source: Select backup destination
sv_se: Välj mål för säkerhetskopia

source: The backup has been saved successfully.
sv_se: Säkerhetskopian har sparats.

source: The backup has been saved successfully to the Downloads folder.
sv_se: Säkerhetskopian har sparats till Hämtningar-mappen.

source: The game saves couldn't be backed up
sv_se: Sparade spel kunde inte säkerhetskopieras

source: An error occured while saving the backup.
sv_se: Ett fel inträffade när säkerhetskopian sparades.

source: Restoring a backup will erase the current configuration and overwrite existing saves. Do you want to proceed?
sv_se: Om du återställer en säkerhetskopia raderas den aktuella konfigurationen och befintliga sparade filer skrivs över. Vill du fortsätta?

source: Select backup file
sv_se: Välj säkerhetskopiefil

source: The backup has been restored successfully.
sv_se: Säkerhetskopian har återställts.

source: An error occured while restoring the backup.
sv_se: Ett fel inträffade under återställningen av säkerhetskopian.

source: Remove
hu_hu: Eltávolítás
ko: 제거
sv_se: Ta bort

source: Unscaled
hu_hu: Nem átméretezett
ko: 크기 조정 안 함
sv_se: Oskalad

source: Hardware scale (fast, but low quality)
hu_hu: Hardveres átméretezés (gyors, de alacsony minőségű)
ko: 하드웨어 크기조절 (빠름, 저품질)
sv_se: Hårdvaruskalning (snabb, men låg kvalitet)

source: Software scale (good quality, but slower)
hu_hu: Szoftveres átméretezés (jó minőség, de lassú)
ko: 소프트웨어 크기 조정 (좋은 품질, 느림)
sv_se: Programvaruskalning (bra kvalitet, men långsam)

source: Show Gamepad Controller (iOS 15 and later)
hu_hu: A képernyőn megjelenő vezérlés megjelenítése (iOS 15 és újabb)
ko: 게임패드 컨트롤러 표시 (iOS 15 이상)
sv_se: Visa Gamepad-kontroller (iOS 15 och senare)

source: Gamepad opacity
hu_hu: Gamepad áttetszőség
ko: 게임패드 불투명도
sv_se: Gamepad-transparens

source: Directional button:
hu_hu: Irányválasztó gomb:
ko: 방향 버튼:
sv_se: Riktningsknapp:

source: Thumbstick
hu_hu: Botkar
ko: 엄지스틱
sv_se: Tumspak

source: Dpad
hu_hu: Irányválasztó
ko: 십자 패드
sv_se: Riktningsknappar

source: Use minimal gamepad layout
hu_hu: Minimális gamepad kiosztás használata
ko: 최소한의 게임패드 레이아웃을 사용
sv_se: Använd minimal gamepad-layout

source: Show keyboard function bar
hu_hu: Billentyűzet funkció sáv mutatása
ko: 키보드 기능바 표시
sv_se: Visa funktionsrad för tangentbord

source: ## Help, I'm lost! First, make sure you have the games and necessary game files ready. Check the **Where to Get the Games** section under the **General** tab. Once obtained, follow the steps outlined in the **Adding Games** tab to finish adding them on this device. Need more help? Refer to our [online documentation for iOS](https://docs.scummvm.org/en/latest/other_platforms/ios.html). Got questions? Swing by our [support forums](https://forums.scummvm.org/viewforum.php?f=15) or hop on our [Discord server](https://discord.gg/4cDsMNtcpG), which includes an [iOS support channel](https://discord.com/channels/581224060529148060/1149456560922316911). Oh, and heads up, many of our supported games are intentionally tricky, sometimes mind-bogglingly so. If you're stuck in a game, think about checking out a game walkthrough. Good luck!
hu_hu: ## Segítség, elvesztem! Első körben győződjön meg, hogy rendelkezésre áll a játék és annak fájljai. Tekintse át a **Honnan szerezzem be a játékokat** szekciót az **Általános** fül alatt. Beszerzést követően kövesse a kiemelt lépéseket a **Játékok hozzáadása**. Figyelmesen tekintse át, mert visszajelzések szerint az új Android változások miatt sokan futott bele hibákba. Szüksége van még további segítségre? Tanulmányozza az [online iOS dokumentációnkat](https://docs.scummvm.org/en/latest/other_platforms/ios.html). Kérdése van? Nézzen be a [támogatói fórumunkra](https://forums.scummvm.org/viewforum.php?f=15) vagy nézzen fel a [Discord szerverünkre](https://discord.gg/4cDsMNtcpG), ahol található egy dedikált [iOS támogatói alcsatorna](https://discord.com/channels/581224060529148060/1149456560922316911). Azonban maguk a támogatott játékok szándékosan furmányosak, néma már majdnem észveszejtő szinten. Ha végleg el van akadva egy játékban, érdemes megtekinteni egy végigjátszást. Sok sikert!
ko: ## 도와주세요, 길을 잃었어요! 먼저, 게임과 필요한 게임 파일을 준비했는지 확인하세요. **일반** 탭 아래의 **게임을 얻는 곳** 섹션을 확인하세요. 게임을 얻으면 **게임 추가** 탭에 설명된 단계에 따라 이 기기에 게임을 추가합니다. 더 많은 도움이 필요한가요? [iOS용 온라인 설명서](https://docs.scummvm.org/en/latest/other_platforms/ios.html)를 참조하세요. 궁금한 점이 있나요? [지원 포럼](https://forums.scummvm.org/viewforum.php?f=15)에 들르거나 [디스코드 서버](https://discord.com/channels/581224060529148060/1149456560922316911)에 접속하세요. 아, 그리고 알려드리자면, 우리가 지원하는 게임 중 다수는 의도적으로 까다롭고, 때로는 정신이 아찔할 정도로 까다롭습니다. 게임에 막혔다면 게임 연습을 확인해 보세요. 행운을 빕니다!
sv_se: ## Hjälp, vad gör jag nu! Först måste du se till att du har spelen och de nödvändiga spelfilerna redo. Se avsnittet **Var får jag tag på spelen** under fliken **Allmänt**. När du har fått tag på dem följer du stegen på fliken **Lägga till spel** för att lägga till dem på den här enheten. Behöver du mer hjälp? Se vår [online-dokumentation för iOS](https://docs.scummvm.org/en/latest/other_platforms/ios.html). Har du några frågor? Besök våra [supportforum](https://forums.scummvm.org/viewforum.php?f=15) eller hoppa in på vår [Discord-server](https://discord.gg/4cDsMNtcpG), som innehåller en [iOS-supportkanal](https://discord.com/channels/581224060529148060/1149456560922316911). Många av de spel som vi stöder är avsiktligt svåra, ibland helt förbluffande svåra. Om du fastnar i ett spel, fundera på att kolla in en spelgenomgång. Vi önskar dig lycka till!
