Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: Unable to access the globally set save path! Please revert to default from ScummVM Options
hu_hu: Nem érhető el az átfogó mentési útvonal! Kérem térjen vissza az alapbeállításra a ScummVM Opciókban
ko: 글로벌적으로 설정된 저장 경로에 접속할 수 없습니다! ScummVM 옵션에서 기본값으로 되돌려주세요
sv_se: Kan inte komma åt den globalt inställda sökvägen! Återställ till standard i ScummVM-inställningarna

source: Toggle virtual keyboard
hu_hu: Virtuális billentyűzet bekapcsolása
ko: 가상 키보드 전환
sv_se: Växla virtuellt tangentbord

source: Done
hu_hu: Kész
ko: 완료
sv_se: Klar

source: Mode change
hu_hu: Mód módosítás
ko: 모드 변경
sv_se: Lägesändring

source: Shift
ko: 시프트
sv_se: Skift

source: Close popup
hu_hu: Felugró ablak bezárása
ko: 팝업 닫기
sv_se: Stäng popup

source: Please select the *root* of your external (physical) SD card. This is required for ScummVM to access this path:
hu_hu: Kérem válassza ki a külső (fizikai) SD kártya *gyökérét*. A ScummVM-nek szüksége van erre, hogy hozzáférjen ehhez az elérési úthoz:
ko: 외부(물리적) SD 카드의 *루트*를 선택하세요. 이는 ScummVM이 이 경로에 접속하는 데 필요합니다:
sv_se: Välj *roten* för ditt externa (fysiska) SD-kort. Detta krävs för att ScummVM ska kunna komma åt denna sökväg:

source: Storage Access Framework Permissions for ScummVM were revoked!
hu_hu: A ScummVM-hez tartozó Tárhely Hozzáférés Keretrendszer jogosultságok visszavonásra kerültek!
ko: ScummVM에 대한 저장소 접속 프레임워크 권한이 취소되었습니다!
sv_se: Storage Access Framework-rättigheter för ScummVM har återkallats!

source: Configuration file could not be parsed
hu_hu: Nem elemezhető a konfigurációs fájl
ko: 구성 파일을 구문 분석할 수 없음
sv_se: Konfigurationsfilen kunde inte tolkas

source: Run a game
hu_hu: Egy játék indítása
ko: 게임 실행
sv_se: Kör ett spel

source: Search a game
hu_hu: Játék keresése
ko: 게임 검색
sv_se: Sök efter ett spel

source: No games (yet) Open ScummVM and add your games here.
hu_hu: Nincsenek játékok (még) Nyissa meg a ScummVM-et, és adja hozzá a játékait.
ko: (아직) 게임 없음 ScummVM을 열고 여기에 게임을 추가하세요.
sv_se: Inga spel (ännu) Öppna ScummVM och lägg till dina spel här.

source: Game icon
hu_hu: Játék ikon
ko: 게임 아이콘
sv_se: Spelikon

source: Shortcut label
hu_hu: Parancsikon elnevezés
ko: 바로가기 레이블
sv_se: Genvägsetikett

source: Shortcut icon
hu_hu: Parancsikon ikonja
ko: 바로가기 아이콘
sv_se: Genvägsikon

source: Interpreter for numerous adventure games and role-playing games
hu_hu: Tolmács számos kalandjátékhoz és szerepjátékhoz
ko: 다양한 어드벤처 게임과 롤플레잉 게임 통역기
sv_se: Tolk för ett flertal äventyrsspel och rollspel

source: ScummVM is a program which allows you to run a wide variety of classic graphical point-and-click adventure games and role-playing games, provided you already have their data files. The clever part about this: ScummVM just replaces the executables shipped with the game, allowing you to play them on systems for which they were never designed!
hu_hu: A ScummVM egy olyan program, mely számos klasszikus grafikus "point-and-click" kalandjáték és szerepjáték futtatását teszi lehetővé, és ehhez csak az adat fájlok szükségesek. Itt jön a képbe az okosság: A ScummVM csupán kicseréli a játék eredeti indító fájljait, lehetővé téve, hogy olyan rendszereken játsszák őket, amelyekre soha nem lettek tervezve!
ko: ScummVM은 다양한 클래식 그래픽 포인트 앤 클릭 어드벤처 게임과 롤플레잉 게임을 실행할 수 있는 프로그램으로, 해당 데이터 파일이 이미 있는 경우에 한합니다. 이 프로그램의 똑똑한 점은 ScummVM이 게임과 함께 제공된 실행 파일을 대체하여 원래 설계되지 않은 시스템에서도 플레이할 수 있다는 것입니다!
sv_se: ScummVM är ett program som gör att du kan köra en mängd olika klassiska grafiska peka-klicka-äventyrsspel och rollspel, förutsatt att du redan har deras datafiler. Den smarta delen om detta: ScummVM ersätter bara de körbara filer som levereras med spelet, så att du kan spela dem på system som de aldrig var avsedda för!

source: Currently, ScummVM supports a huge library of adventures with over 4000 games in total. It supports many classics published by legendary studios like LucasArts, Sierra On-Line, Revolution Software, Cyan, Inc. and Westwood Studios.
hu_hu: Jelenleg a ScummVM egy hatalmas kalandokkal teli könyvtárat támogat, összesen több mint 4000 játékkal. Támogatja számos legendás stúdió által kiadott klasszikust, mint például a LucasArts, a Sierra On-Line, a Revolution Software, a Cyan, Inc. és a Westwood Studios.
ko: 현재 ScummVM은 총 4,000개가 넘는 게임으로 구성된 방대한 어드벤처 라이브러리를 지원합니다. 루카스아츠, 시에라 온라인, 레볼루션 소프트웨어, 사이언, 웨스트우드 스튜디오스와 같은 전설적인 스튜디오에서 발매한 많은 고전 게임을 지원합니다.
sv_se: För närvarande har ScummVM stöd för ett enormt äventyrsbibliotek med totalt över 4000 spel. Det stöder många klassiker som publicerats av legendariska studior som LucasArts, Sierra On-Line, Revolution Software, Cyan, Inc. och Westwood Studios.

source: Next to ground-breaking titles like the Monkey Island series, Broken Sword, Myst, Blade Runner and countless other games you will find some really obscure adventures and truly hidden gems to explore.
hu_hu: Az olyan úttörő címek mellett, mint a Monkey Island sorozat, a Broken Sword, a Myst, a Blade Runner és a számtalan más játék mellett találhat alig ismert kalandjátékokat, esetlegesen megbúvó briliánsokat is.
ko: 원숭이 섬 시리즈, 브로큰 소드, 미스트, 블레이드 런너 등 획기적인 타이틀과 그 외 수많은 게임 외에도 잘 알려지지 않은 모험과 탐험할 만한 숨겨진 보석을 찾을 수 있습니다.
sv_se: Förutom banbrytande titlar som Monkey Island-serien, Broken Sword, Myst, Blade Runner och oräkneliga andra spel kommer du att hitta andra väldigt obskyra äventyr och genuint dolda pärlor att utforska.

source: Achievement unlocked!
hu_hu: Teljesítmény feloldva!
ko: 도전과제가 잠금 해제되었습니다!
sv_se: Prestation upplåst!

source: Illegitimate game copy detected. We provide no support in such cases
hu_hu: Illegális játékpéldány észlelve. Ilyen esetekben nem nyújtunk támogatást
ko: 불법복제된 게임이 감지되었습니다. 이 경우 어떤 지원도 제공하지 않음
sv_se: Olaglig spelkopia upptäckt. Vi ger ingen support i sådana fall

source: ~R~esume
hu_hu: Folytatás
ko: 재개(~R~)
sv_se: ~F~ortsätt

source: ~L~oad
hu_hu: Betö~l~tés
ko: 불러오기(~L~)
sv_se: ~L~äs in

source: ~S~ave
hu_hu: Menté~s~
ko: 저장(~S~)
sv_se: ~S~para

source: ~O~ptions
hu_hu: ~O~pciók
ko: 옵션(~O~)
sv_se: A~I~termativ

source: ~H~elp
hu_hu: Súgó
ko: 도움말(~H~)
sv_se: ~H~jälp

source: ~A~bout
hu_hu: Névjegy
ko: 정보(~A~)
sv_se: O~m~

source: ~R~eturn to Launcher
hu_hu: Visszaté~r~és az indítóba
ko: 런처로 돌아가기(~R~)
sv_se: Åte~r~vänd till spelstartaren

# lowres
source: ~R~eturn to Launcher
hu_hu: Visszaté~r~és az indítóba
ko: 런처로 돌아가기(~R~)
sv_se: Åte~r~vänd till spelstartaren

source: Save game:
hu_hu: Játék mentése:
ko: 게임 저장:
sv_se: Spara spelet:

source: Save
hu_hu: Mentés
ko: 저장
sv_se: Spara

source: Sorry, this engine does not currently provide in-game help. Please consult the README for basic information, and for instructions on how to obtain further assistance.
hu_hu: Sajnáljuk, a motor jelenleg nem támogat játék közbeni súgót. Olvassa el a README-t az alap információkról, valamint a további támogatással kapcsolatos instrukciókról.
ko: 죄송합니다, 이 엔진은 현재 게임 내 도움말을 제공하지 않습니다. 기본 정보와 추가 지원을 받는 방법에 대한 지침은 README를 참조하세요.
sv_se: Tyvärr stöds för tillfället inte den här motorns hjälpfunktionen. Hänvisa till README-filen för grundläggande information och instruktioner för att få ytterligare hjälp.

source: This game does not support saving from the menu. Use in-game interface
hu_hu: Ez a játék nem támogatja a menüből való mentést. Használja a játék belső menüjét
ko: 이 게임은 메뉴에서 저장을 지원하지 않습니다. 게임 내 인터페이스 사용
sv_se: Det här spelet saknar stöd för sparning från menyn. Använd gränssnittet i spelet

source: This game cannot be saved at this time. Please try again later
hu_hu: A játékállás jelenleg nem menthető. Kérjük próbálja meg később
ko: 이 게임은 현재 저장할 수 없습니다. 나중에 다시 시도
sv_se: Detta spel kan inte sparas just nu. Prova igen senare

source: Failed to save game (%s)! Please consult the README for basic information, and for instructions on how to obtain further assistance.
hu_hu: Nem sikerült a %s mentése! Olvassa el a README-t az alap információkról, valamint a további támogatással kapcsolatos instrukciókról.
ko: (%s) 게임 저장에 실패했습니다! 기본 정보와 추가 지원을 받는 방법에 대한 지침은 README를 참조하세요.
sv_se: Kunde inte spara data (%s)! Läs README-filen för grundläggande information och instruktioner för hur du kan få mer hjälp.

source: This game does not support loading from the menu. Use in-game interface
hu_hu: Ez a játék nem támogatja a menüből való mentés betöltést. Használja a játék belső menüjét
ko: 이 게임은 메뉴에서 불러오기를 지원하지 않습니다. 게임 내 인터페이스 사용
sv_se: Det här spelet saknar stöd för inläsning från menyn. Använd gränssnittet i spelet

source: This game cannot be loaded at this time. Please try again later
hu_hu: Ez a játékállás jelenleg nem tölthető be. Kérjük próbálja meg később
ko: 이 게임은 현재 불러올 수 없습니다. 나중에 다시 시도
sv_se: Detta spelet kan inte läsas in just nu. Prova igen senare

source: ~C~ancel
hu_hu: Mégsem
ko: 취소(~C~)
sv_se: A~v~bryt

source: Could not switch to resolution '%dx%d'.
hu_hu: A '%dx%d' felbontás nem alkalmazható.
ko: '%dx%d' 해상도로 전환할 수 없습니다.
sv_se: Kunde inte byta till upplösningen '%dx%d'.

source: Could not initialize color format.
hu_hu: A szín formátum nem alkalmazható.
ko: 색상 형식을 초기화할 수 없습니다.
sv_se: Kunde inte initiera färgformat.

source: Could not switch to video mode '%s'.
hu_hu: A '%s' videó mód nem alkalmazható.
ko: '%s' 비디오 모드로 전환할 수 없습니다.
sv_se: Kunde inte byta till videoläget '%s'.

source: Could not switch to stretch mode '%s'.
hu_hu: A '%s' nyújtorr videó mód nem alkalmazható.
ko: '%s' 늘리기 모드로 전환할 수 없습니다.
sv_se: Kunde inte byta till utsträckningsläget: '%s'.

source: Could not apply aspect ratio setting.
hu_hu: Az új képarány nem került alkalmazásra.
ko: 화면비 설정을 적용할 수 없습니다.
sv_se: Kunde inte tillämpa inställningen för bildförhållanden.

source: Could not apply fullscreen setting.
hu_hu: Teljesképernyős mód nem került alkalmazásra.
ko: 전체 화면 설정을 적용할 수 없습니다.
sv_se: Kunde inte tillämpa helskärmsinställning.

source: Could not apply filtering setting.
hu_hu: A filterezezési beállítás nem került alkalmazásra.
ko: 필터링 설정을 적용할 수 없습니다.
sv_se: Kunde inte tillämpa filterinställningen.

source: Could not apply shader setting.
sv_se: Kunde inte tillämpa skuggningsinställningen.

source: Error
hu_hu: Hiba
ko: 오류
sv_se: Fel

source: You appear to be playing this game directly from the CD. This is known to cause problems, and it is therefore recommended that you copy the data files to your hard disk instead. See the documentation (CD audio) for details.
hu_hu: Úgy néz ki, ezt a játékot CD-ről futtatja. Ez köztudottan problémákat okozhat, ezért ajánlatos átmásolni a játék adatfájljait a merevlemezére. További részletekért olvassa el a dokumentációt (CD hang).
ko: 이 게임을 CD로부터 직접 플레이하는 것으로 보입니다. 이 경우 문제가 발생할 수 있으므로, 게임 데이터 파일을 하드 디스크에 저장하는 것을 권장합니다. 문서(CD 오디오)에서 추가 정보를 확인해 주세요.
sv_se: Det verkar som att du spelar det här spelet direkt från CD:n. Detta har en tendens att orsaka problem. Det är därför rekommenderat att du kopierar datafilerna till din hårddisk istället. Se dokumentationen (CD-audio) för detaljer.

source: This game has audio tracks on its CD. These tracks need to be ripped from the CD using an appropriate CD audio extracting tool in order to listen to the game's music. See the documentation (CD audio) for details.
hu_hu: A játék CD-jén hangsávok találhatóak. Ezeket a sávokat ki kell nyerni egy megfelelő CD hang "ripper" program segítségével, annak érdekében hogy a játék zenéje hallható legyen. További részletekért olvassa el a dokumentációt (CD hang).
ko: 이 게임의 CD에는 오디오 트랙이 있습니다. 게임의 음악을 듣기 위해서는 적절한 CD 오디오 추출 도구를 사용하여 CD에서 이러한 트랙을 추출해야 합니다. 자세한 내용은 설명서(CD 오디오)를 참조하세요.
sv_se: Det här spelet har ljudspår på sin skiva. Dessa spår måste rippas från skivan med hjälp av ett lämpligt program för extraktion av CD-ljud för att kunna lyssna på spelets musik. Se dokumentationen (CD-audio) för detaljer.

source: Skip autosave
hu_hu: Automatikus mentés kihagyása
ko: 자동 저장 건너뛰기
sv_se: Hoppa över autospara

source: WARNING: The autosave slot contains a saved game named %S, and an autosave is pending. Please move this saved game to a new slot, or delete it if it's no longer needed. Alternatively, you can skip the autosave (will prompt again in 5 minutes).
hu_hu: FIGYELMEZTETÉS: Az automatikus mentési hely egy %S nevű mentett játékot tartalmaz, és egy automatikus mentés jelenleg függőben van. Kérjük, helyezze át ezt a mentett játékot egy új helyre, vagy törölje, ha már nincs szükség rá. Esetlegesen átugorhatja az automatikus mentést (5 perc múlva újra rákérdez).
ko: 경고: 자동 저장 슬롯에는 %S라는 이름의 저장된 게임이 포함되어 있으며 자동 저장이 보류 중입니다. 이 저장된 게임을 새 슬롯으로 옮기거나 더 이상 필요하지 않으면 삭제하세요. 그 대신에, 자동 저장을 건너뛸 수 있습니다 (5 분 후에 다시 메세지 표시).
sv_se: VARNING: I autosparplatsen finns ett sparat spel med namnet %S, och en autosparning väntar. Flytta det här sparade spelet till en ny plats eller ta bort det om det inte längre behövs. Alternativt kan du hoppa över autosparningen (kommer att fråga igen om 5 minuter).

source: ERROR: Could not copy the savegame to a new slot
hu_hu: HIBA: A játékmentés nem másolható az új helyre
ko: 오류: 저장 게임을 새 슬롯에 복사할 수 없음
sv_se: FEL: Kunde inte kopiera det sparade spelet till en ny plats

source: Autosave
hu_hu: Automata mentés
ko: 자동 저장
sv_se: Autospara

source: Error occurred making autosave
hu_hu: Hiba történt az automatikus mentéskor
ko: 자동 저장을 하는 중 오류가 발생함
sv_se: Fel inträffade vid skapande av autosparning

source: Failed to load saved game (%s)! Please consult the README for basic information, and for instructions on how to obtain further assistance.
hu_hu: Nem sikerült a %s mentés betöltése! Olvassa el a README-t az alap információkról, valamint a további támogatással kapcsolatos instrukciókról.
ko: 저장된 게임 (%s)을 불러오는 데 실패했습니다! 기본 정보와 추가 지원을 받는 방법에 대한 지침은 README를 참조하세요.
sv_se: Kunde inte läsa in sparat spel (%s)! Referera till README-filen för mer information och instruktioner för hur du får mer hjälp.

source: WARNING:
hu_hu: FIGYELEM:
ko: 경고:
sv_se: VARNING:

source: Shall we still run the game?
hu_hu: Mégis futtatja a játékot?
ko: 그래도 게임을 실행하겠습니까?
sv_se: Vill du fortfarande köra spelet?

source: WARNING: The game you are about to start is not yet fully supported by ScummVM. As such, it is likely to be unstable, and any saved game you make might not work in future versions of ScummVM.
hu_hu: FIGYELEM: Az indítandó játék még nem teljesen támogatott ScummVM-ben. Emiatt elképzelhető instabil futás, és a most készített mentések nem biztos, hogy működnek majd a ScummVM következő verzióiban.
ko: 경고: 지금 시작하려는 게임은 아직 ScummVM에서 완전히 지원하지 않습니다. 동작이 불안정할 가능성이 높으며 세이브 파일이 앞으로 나올 ScummVM 버전에서 지원되지 않을 수도 있습니다.
sv_se: VARNING: Spelet du är på väg att starta stöds inte ännu till fullo av ScummVM. Därför är det troligtvis instabilt och om du skapar spardata kan de möjligtvis vara inkompatibla med framtida versioner av ScummVM.

source: Start anyway
hu_hu: Indítás mégis
ko: 무시하고 시작
sv_se: Starta ändå

source: WARNING: the game you are about to start contains the add-on "%s" which is not yet fully supported by ScummVM. As such, it is likely to be unstable, and any saved game you make might not work in future versions of ScummVM.
sv_se: VARNING: Spelet du är på väg att starta innehåller tillägget "%s" som ännu inte stöds till fullo av ScummVM. Därför är det troligtvis instabilt och om du skapar spardata kan de möjligtvis vara inkompatibla med framtida versioner av ScummVM.

source: The game "%s" you are trying to add is an add-on for "%s" that cannot be run independently. Please copy the add-on contents into a subdirectory of the base game, and start the base game itself.
sv_se: Spelet ”%s” som du försöker lägga till är ett tillägg till ”%s” som inte kan köras separat. Kopiera tilläggets innehåll till en underkatalog till basspelet och starta själva basspelet.

source: This game is not supported.
hu_hu: Ez a játék nem támogatott.
ko: 이 게임은 지원되지 않습니다.
sv_se: Detta spel stöds inte.

source: This game is not supported for the following reason:
hu_hu: Ez a játék a következő okból nem támogatott:
ko: 이 게임은 다음과 같은 이유로 지원되지 않습니다:
sv_se: Det saknas stöd för detta spel av följande anledning:

source: Loading game is currently unavailable
hu_hu: A játék betöltés jelenleg nem támogatott
ko: 현재는 게임을 불러올 수 없음
sv_se: Inläsning av spel går inte just nu

source: Saving game is currently unavailable
hu_hu: A játék mentés jelenleg nem támogatott
ko: 현재는 게임을 저장할 수 없음
sv_se: Det går inte att spara just nu

source: The directory '%s' looks like an add-on for the game '%s', but ScummVM could not find any matching add-on in it.
sv_se: Katalogen ’%s’ ser ut som ett tillägg till spelet ’%s’, men ScummVM kunde inte hitta något matchande tillägg i den.

source: Directory '%s' matches several add-ons, please pick one.
sv_se: Katalogen ’%s’ matchar flera tillägg, välj ett.

source: The game in '%s' seems to be an unknown game variant. Please report the following data to the ScummVM team at %s along with the name of the game you tried to add and its version, language, etc.:
hu_hu: A(z) '%s' játék egy ismeretlen játékváltozatnak tűnik. Kérjük, jelentse a következő adatokat a ScummVM csapatnak a %s címen a játék nevével együtt, amelyet megpróbált hozzáadni, valamint annak verzióját, nyelvét stb.:
ko: '%s'의 게임은 알 수 없는 게임 변형인 것 같습니다. 추가하려고 했던 게임의 이름, 버전, 언어 등과 함께 다음 데이터를 %s의 ScummVM 팀에 보고해 주세요:
sv_se: Spelet i '%s' verkar vara en okänd spelvariant. Rapportera följande data till ScummVM-teamet på %s tillsammans med namnet på det spel du försökte lägga till och dess version, språk etc:

source: Matched game IDs for the %s engine:
hu_hu: Megfelelő játékazonosítók a %s motorhoz:
ko: %s 엔진에 일치하는 게임 ID:
sv_se: Matchande spel-id:n för motorn %s:

source: Game not implemented
hu_hu: A játék még nem került implementálásra
ko: 게임이 구현되지 않았음
sv_se: Spelet är inte implementerat

source: Default game keymap
hu_hu: Alapértelmezett billentyűzet kiosztás
ko: 기본 게임 키설정
sv_se: Förvald knappuppsättning

source: Left click
sv_se: Vänsterklick

source: Middle click
sv_se: Mittenklick

source: Right click
hu_hu: Jobb katt
sv_se: Högerklick

source: Pause
hu_hu: Szünet
ko: 일시 정지
sv_se: Pausa

source: Game menu
hu_hu: Játék menü
ko: 게임 메뉴
sv_se: Spelmeny

source: Skip
hu_hu: Átugrás
ko: 건너뛰기
sv_se: Hoppa över

source: Skip line
hu_hu: Sor átugrása
ko: 대사 건너뛰기
sv_se: Hoppa över rad

source: Predictive input dialog
hu_hu: Prediktív beviteli párbeszédpanel
ko: 예측 입력 대화 상자
sv_se: Textförslag medan du skriver

source: Confirm
hu_hu: Megerősít
ko: 확인
sv_se: Bekräfta

source: Autosave on
hu_hu: Automata mentés be
ko: 자동 저장 켬
sv_se: Autospara på

source: Autosave off
hu_hu: Automata mentés ki
ko: 자동 저장 끔
sv_se: Autospara av

source: OpenGL with shaders
hu_hu: OpenGL shader-ekkel
ko: 셰이더를 사용한 OpenGL
sv_se: OpenGL med shaders

# lowres
source: OpenGL with shaders
hu_hu: OpenGL shader-ekkel
ko: 셰이더를 사용한 OpenGL
sv_se: OpenGL med shaders

source: The selected audio device '%s' was not found (e.g. might be turned off or disconnected).
hu_hu: A kiválasztott '%s' hangeszköz nem található (pl. ki van kapcsolva vagy ki van húzva).
ko: 선택한 오디오 장치 '%s'을(를) 찾을 수 없습니다 (예: 꺼져 있거나 연결이 끊어졌을 수 있음).
sv_se: Den valda ljudenheten '%s' kunde inte hittas (möjligtvis avstängd eller frånkopplad).

source: Attempting to fall back to the next available device...
hu_hu: Átállás a következő elérhető eszközre...
ko: 사용 가능한 다음 장치로 돌아가려고 시도 중입니다...
sv_se: Försöker använda nästa tillgängliga ljudenhet...

source: The selected audio device '%s' cannot be used. See log file for more information.
hu_hu: A kiválasztott '%s' hangeszköz nem használható. Bővebb információ a naplófájlban.
ko: 선택한 오디오 장치 '%s'를 사용할 수 없습니다. 자세한 내용은 로그 파일을 참조하세요.
sv_se: Den valda ljudenheten '%s' kan inte användas. Se loggfilen för mer information.

source: The preferred audio device '%s' was not found (e.g. might be turned off or disconnected).
hu_hu: A '%s' preferált hangeszköz nem található (pl. ki van kapcsolva vagy ki van húzva).
ko: 기본 오디오 장치 '%s'을(를) 찾을 수 없습니다 (예: 꺼져 있거나 연결이 끊어졌을 수 있음).
sv_se: Den föredragna ljudenheten '%s' kunde inte hittas (möjligtvis avstängd eller frånkopplad).

source: The preferred audio device '%s' cannot be used. See log file for more information.
hu_hu: A '%s' preferált hangeszköz nem használható. Bővebb információ a naplófájlban.
ko: 선호하는 오디오 장치 '%s'를 사용할 수 없습니다. 자세한 내용은 로그 파일을 참조하세요.
sv_se: Den föredragna ljudenheten '%s' kan inte användas. Se loggfilen för mer information.

source: Starting MIDI dump
hu_hu: MIDI dumb indítása
ko: 미디 덤프 시작
sv_se: Startar MIDI-dump

source: Amiga Audio emulator
hu_hu: Amiga Hang emulátor
ko: 아미가 오디오 에뮬레이터
sv_se: Amiga-ljudemulator

source: No music
hu_hu: Nincs zene
ko: 음악 없음
sv_se: Ingen musik

source: Apple II GS emulator (NOT IMPLEMENTED)
hu_hu: Apple II GS emulátor (NEM IMPLEMENTÁLVA)
ko: 애플 II GS 에뮬레이터 (구현되지 않음)
sv_se: Apple II GS-emulator (INTE IMPLEMENTERAD)

source: FluidSynth requires a 'soundfont' setting. Please specify it in ScummVM GUI on MIDI tab. Music is off.
hu_hu: A FluidSynth-hez szükséges a 'soundfont' beállítás is. Kérjük állítsa be a ScummVM felület MIDI fülén. Zene kikapcsolva.
ko: FluidSynth에는 '사운드폰트' 설정이 필요합니다. ScummVM GUI의 미디 탭에서 지정해 주세요. 음악은 꺼져 있습니다.
sv_se: FluidSynth kräver en 'soundfont'-inställning. Ange en på MIDI-fliken i ScummVMs gränssnitt. Musiken är avstängd.

source: FluidSynth: Failed loading custom SoundFont '%s'. Music is off.
hu_hu: FluidSynth: Nem sikerült betölteni a '%s' soundfont-ot. Zene kikapcsolva.
ko: FluidSynth: 커스텀 사운드폰트 '%s'을(를) 불러오는 데 실패했습니다. 음악이 꺼져 있습니다.
sv_se: FluidSynth: Misslyckades med att läsa in anpassad SoundFont '%s'. Musiken är avstängd.

source: FM-Towns Audio
hu_hu: FM-Towns Hang
ko: FM-TOWNS 오디오
sv_se: FM Towns-ljud

source: PC-98 Audio
hu_hu: PC-98 Hang
ko: PC-98 오디오
sv_se: PC-98-ljud

source: SegaCD Audio
hu_hu: SegaCD Hang
ko: 세가CD 오디오
sv_se: SegaCD-ljud

source: Initializing MT-32 Emulator
hu_hu: MT-32 Emulátor beindítása
ko: MT-32 에뮬레이터 초기화 중
sv_se: Initierar MT-32-emulator

source: PC Speaker emulator
hu_hu: PC Speaker emulátor
ko: PC 스피커 에뮬레이터
sv_se: Emulator för PC-högtalare

source: C64 Audio emulator
hu_hu: C64 Hang emulátor
ko: C64 오디오 에뮬레이터
sv_se: C64-ljudemulator

source: <syncing...>
hu_hu: <szinkronizálás...>
ko: <동기화 중...>
sv_se: <synkroniserar...>

source: Saved games sync was cancelled.
hu_hu: Mentés szinkronizálás megszakítva.
ko: 저장된 게임 동기화가 취소되었습니다.
sv_se: Synkningen av sparade speldata avbröts.

source: Saved games sync failed. Check your Internet connection.
hu_hu: A mentés szinkronizáció sikertelen. Ellenőrizze az internetkapcsolatát.
ko: 저장된 게임 동기화에 실패했습니다. 인터넷 연결을 확인하세요.
sv_se: Synkningen av sparade speldata misslyckades. Kontrollera din internetanslutning.

source: Download complete. Failed to download %u files.
hu_hu: Letöltés befejeződött. %u fájlt nem sikerült letölteni.
ko: 다운로드 완료하였습니다. %u 개 파일 다운로드 실패하였습니다.
sv_se: Hämtningen är färdig. Kunde inte hämta ner %u filer.

source: Download complete.
hu_hu: Letöltés befejeződött.
ko: 다운로드 완료하였습니다.
sv_se: Hämtningen är färdig.

source: Download failed.
hu_hu: Sikertelen letöltés.
ko: 다운로드 실패하였습니다.
sv_se: Hämtningen misslyckades.

source: Do you really want to return to the Launcher? Any unsaved progress will be lost.
hu_hu: Tényleg vissza akar térni az Indítóhoz? A nem mentett állapot elvész.
ko: 정말 런처로 돌아가겠습니까? 저장하지 않은 진행 사항은 모두 사라집니다.
sv_se: Är du verkligen säker på att du vill återgå till spelstartaren? Alla osparade framsteg kommer gå förlorade.

source: Do you really want to quit? Any unsaved progress will be lost.
hu_hu: Biztosan ki akar lépni? A nem mentett állapot elvész.
ko: 정말 종료하겠습니까? 저장되지 않은 진행 상황은 모두 사라집니다.
sv_se: Är du verkligen säker på att du vill avsluta? Alla osparade framsteg kommer gå förlorade.

source: Global Main Menu
hu_hu: Átfogó Főmenü
ko: 글로벌 메인 메뉴
sv_se: Global huvudmeny

source: Display keyboard
hu_hu: Billentyűzet megjelenítése
ko: 키보드 표시
sv_se: Visa tangentbord

source: Toggle mute
hu_hu: Némítás kapcsolása
ko: 음소거 전환
sv_se: Ljud av/på

source: Open Debugger
hu_hu: Hibakezelő megnyitása
ko: 디버거 열기
sv_se: Öppna felsökaren

source: Clicking Enabled
hu_hu: Kattintás engedélyezve
ko: 클릭 활성됨
sv_se: Klickning aktiverad
