Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: WARNING: Autosave was enabled. Some of your games have existing saved games on the autosave slot. You can either move the existing saves to new slots, disable autosave, or ignore (you will be prompted when autosave is about to overwrite a save). List of games:
hu_hu: FIGYELEM: Az automatikus mentés engedélyezve volt. Néhány játék rendelkezik meglévő mentésekkel az automatikus mentési helyen. A meglévő mentéseket áthelyezheti új helyekre, letilthatja az automatikus mentést, vagy figyelmen kívül hagyhatja (a rendszer megkérdezi, amikor az automatikus mentés felülírja a mentést). A játékok listája:
ko: 경고: 자동 저장이 활성화되었습니다. 일부 게임은 자동 저장 슬롯에 기존 저장된 게임이 있습니다. 기존 저장을 새 슬롯으로 이동하거나, 자동 저장을 비활성화하거나, 무시할 수 있습니다 (자동 저장이 저장을 덮어쓰려고 할 때 메시지가 표시됨). 게임 목록:
sv_se: VARNING: Autosparning var aktiverat. Vissa av dina spel har befintliga sparade spel på autosave-platsen. Du kan antingen flytta de befintliga sparningarna till nya platser, inaktivera autosparning eller ignorera (du får en fråga när autosparning är på väg att skriva över en sparning). Lista över spel:

source: And more...
hu_hu: Továbbiak...
ko: 그리고 더 많은 정보...
sv_se: Och mera...

source: Move
hu_hu: Mozgás
ko: 이동
sv_se: Flytta

source: ERROR: Failed to move the following saved games:
hu_hu: HIBA: Nem sikerült áthelyezni a következő mentett játékokat:
ko: 오류: 다음 저장 데이터를 옮기는데 실패함:
sv_se: VARNING: Flytt av lagrade spelpunkt misslyckades:

source: Failed to change cloud storage!
hu_hu: A felhőtároló cseréje nem sikerült!
ko: 클라우드 저장소 변경에 실패했습니다!
sv_se: Kunde inte ändra molnlagring!

source: Another cloud storage is already active.
hu_hu: Egy másik felhőtároló már aktív.
ko: 다른 클라우드 저장소가 이미 활성화되어 있습니다.
sv_se: En annan molnlagring är redan aktiv.

source: Theme does not support selected language!
hu_hu: A téma nem támogatja a választott nyelvet!
ko: 테마는 선택한 언어를 지원하지 않습니다!
sv_se: Temat stöder inte det valda språket!

source: Theme cannot be loaded!
hu_hu: A téma nem tölthető be!
ko: 테마를 불러올 수 없습니다!
sv_se: Temat kunde inte läsas in!

source: Misc settings will be restored.
hu_hu: Egyéb beállítások helyreállításra kerülnek.
ko: 기타 설정이 복원됩니다.
sv_se: Diverse inställningar kommer att återställas.

source: Select directory for GUI themes
hu_hu: GUI téma mappájának kiválasztása
ko: GUI 테마 디렉터리를 선택
sv_se: Välj katalog för gränssnittsteman

source: Select directory for GUI launcher thumbnails
hu_hu: Válassza ki a GUI indító bélyegképeinek könyvtárát
ko: GUI 런처 섬네일을 위한 디렉터리 선택
sv_se: Välj miniatyrbildskatalog för spelstartaren

source: Select directory for DLC downloads
hu_hu: Válassza ki a DLC-letöltések könyvtárát
ko: DLC 다운로드를 위한 디렉터리를 선택
sv_se: Välj katalog för DLC-hämtningar

source: Select directory for extra files
hu_hu: Mappa választása extra fájloknak
ko: 추가 파일 디렉터리를 선택
sv_se: Välj katalog för extra filer

source: Select directory for plugins
hu_hu: Mappa kiválasztása plugin-ok számára
ko: 플러그인 디렉터리를 선택
sv_se: Välj katalog för tillägg

source: Select directory for Files Manager /root/
hu_hu: Válassza ki a fájlkezelő /gyökér/ mappáját
ko: 파일 매니저 /root/ 디렉터리를 선택
sv_se: Välj katalog för filhanterarens /root/

source: This Storage is working now. Do you want to interrupt it?
hu_hu: Ez a tároló már aktív. Meg akarja szakítani?
ko: 이 저장소는 현재 작동 중입니다. 중단하겠습니까?
sv_se: Denna lagring fungerar nu. Vill du avbryta det?

source: Wait until current Storage finishes up and try again.
hu_hu: Várjon amíg a jelenlegi tárhely végez, és próbálkozzon újra.
ko: 현재 저장소 작업이 완료될 때까지 기다렸다가 다시 시도하세요.
sv_se: Vänta tills det nuvarande lagring är färdigt och försök igen.

source: <right now>
hu_hu: <éppen most>
ko: <지금 당장>
sv_se: <just nu>

source: Request failed. Check your Internet connection.
hu_hu: Sikertelen kérés. Ellenőrizze az internetkapcsolatát.
ko: 요청이 실패했습니다. 인터넷 연결을 확인해 주세요.
sv_se: Begäran misslyckades. Kontrollera din internetanslutning.

source: A test pattern should be displayed. Do you want to keep these shader scaler settings?
hu_hu: Meg kell hogy jelenjen a tesztminta. Megtartja ezeket a shader méretező beállításokat?
ko: 테스트 패턴이 보여주어야 합니다. 이 셰이더 크기 조정 설정을 유지하겠습니까?
sv_se: Ett testmönster borde visas. Vill du att behålla dessa inställningar?

source: Reverting automatically in %d seconds
hu_hu: Automatikus visszaállítás %d másodperc múlva
ko: %d 초 후 자동으로 복귀
sv_se: Återställer automatiskt inom %d sekunder

source: Enter Text
hu_hu: Írja be a szöveget
ko: 텍스트 입력
sv_se: Ange text

source: # next
hu_hu: # következõ
ko: # 다음
sv_se: # nästa

source: add
hu_hu: hozzáadás
ko: 추가
sv_se: lägg till

source: Delete char
hu_hu: Karakter törlés
ko: 문자 삭제
sv_se: Ta bort tecken

source: Recorder or Playback Gameplay
hu_hu: Játékmenet felvétel vagy visszajátszás
ko: 게임플레이 녹화 또는 재생
sv_se: Inspelare eller återuppspelning

source: Delete
hu_hu: Törlés
ko: 삭제
sv_se: Ta bort

source: Record
hu_hu: Felvétel
ko: 녹화
sv_se: Spela in

source: Playback
hu_hu: Visszajátszás
ko: 재생
sv_se: Spela upp

source: Edit
hu_hu: Szerkesztés
ko: 편집
sv_se: Redigera

source: Author:
hu_hu: Szerző:
ko: 원작자:
sv_se: Upphovsperson:

source: Notes:
hu_hu: Megjegyzés:
ko: 참고:
sv_se: Anteckningar:

source: Do you really want to delete this record?
hu_hu: Biztosan le akarja törölni ezt a felvételt?
ko: 이 기록을 정말 삭제하겠습니까?
sv_se: Vill du verkligen ta bort den här inspelningen?

source: Unknown Author
hu_hu: Ismeretlen Szerző
ko: 알 수 없는 원작자
sv_se: Okänd upphovsperson

source: ScummVM could not access the directory!
hu_hu: ScummVM nem tud hozzáférni a mappához!
ko: ScummVM이 디렉터리에 접근할 수 없습니다!
sv_se: ScummVM kunde inte komma åt katalogen!

source: Downloading saves...
hu_hu: Mentések letöltése...
ko: 저장 파일 다운로드하는 중...
sv_se: Hämtar ner sparade spel...

source: Run in background
hu_hu: Futtatás a háttérben
ko: 백그라운드에서 실행
sv_se: Kör i bakgrunden

source: %s (%s %S / %s %S, %s / %s files)
hu_hu: %s (%s %S / %s %S, %s / %s fájl)
ko: %s (%s %S / %s %S, %s / %s 파일)
sv_se: %s (%s %S / %s %S, %s / %s filer)

source: No date saved
hu_hu: Dátum nem került mentésre
ko: 날짜가 저장되지 않았음
sv_se: Inget datum sparat

source: No time saved
hu_hu: Idő nem került mentésre
ko: 시간이 저장되지 않았음
sv_se: Ingen tid sparad

source: No playtime saved
hu_hu: Játékidő nem került mentésre
ko: 플레이 시간이 저장되지 않았음
sv_se: Ingen speltid sparad

source: Untitled saved game
hu_hu: Névtelen játék mentés
ko: 제목 없는 저장된 게임
sv_se: Namnlöst spardata

source: Do you really want to delete this saved game?
hu_hu: Biztosan törölni akarja ezt a játék mentést?
ko: 이 저장된 게임을 정말 삭제하겠습니까?
sv_se: Vill du verkligen ta bort detta sparade spel?

source: Error deleting saved game
hu_hu: Hiba a mentés törlése során
ko: 저장된 게임 삭제 오류
sv_se: Fel vid borttagning av sparat spel

source: Date:
hu_hu: Dátum:
ko: 날짜:
sv_se: Datum:

source: Time:
hu_hu: Idő:
ko: 시간:
sv_se: Tid:

source: Playtime:
hu_hu: Játékidő:
ko: 플레이 시간:
sv_se: Speltid:

source: New Save
hu_hu: Új Mentés
ko: 새 저장
sv_se: Ny sparning

source: Create a new saved game
hu_hu: Új játékmentés létrehozása
ko: 새 저장된 게임 만들기
sv_se: Skapa ett nytt sparat spel

source: Name:
hu_hu: Név:
ko: 이름:
sv_se: Namn:

source: Enter a description for slot %d:
hu_hu: Adjon meg egy leírást a %d slothoz:
ko: 슬롯 %d에 대한 설명을 입력하세요:
sv_se: Ange en beskrivning för plats %d:

source: Choose shader from the list below (or pick a file instead)
hu_hu: Válasszon ki egy shadert az alábbi listából (vagy válasszon helyette egy fájlt)
ko: 아래 목록에서 셰이더 선택 (또는 대신할 파일을 선택)
sv_se: Välj shader från listan nedan (eller välj en shader-fil istället)

source: Pick file instead...
hu_hu: Válasszon inkább fájlt...
ko: 대신할 파일을 선택...
sv_se: Välj fil istället...

source: Pick shader from file system
hu_hu: Válassza ki a shadert a fájlok közül
ko: 파일 시스템에서 셰이더 선택
sv_se: Välj shader från filsystem

source: Select shader
hu_hu: Válasszon shadert
ko: 셰이더 선택
sv_se: Välj shader

source: Select a Theme
hu_hu: Válassz témát
ko: 테마 선택
sv_se: Välj ett tema

source: Disabled GFX
hu_hu: GFX letiltva
ko: GFX 비활성화
sv_se: Inaktiverad GFX

# lowres
source: Disabled GFX
hu_hu: GFX letiltva
ko: GFX 비활성화
sv_se: Inaktiverad GFX

source: Standard renderer
hu_hu: Szabványos render
ko: 일반 렌더러
sv_se: Standardrenderare

source: Antialiased renderer
hu_hu: Élsimított rederer
ko: 안티에일리어싱 렌더러
sv_se: Kantutjämnad rendering

source: Antialiased
hu_hu: Élsimított
ko: 안티에일리어싱
sv_se: Kantutjämnad

source: Add anyway
hu_hu: Hozzáadás mégis
ko: 무시하고 추가
sv_se: Lägg till ändå

source: Copy to clipboard
hu_hu: Másolás vágólapra
ko: 클립보드로 복사
sv_se: Kopiera till urklipp

source: Report game
hu_hu: Játék jelentése
ko: 게임 보고하기
sv_se: Rapportera spelet

source: Use the button below to copy the required game information into your clipboard.
hu_hu: Az alábbi gombra kattintva a szükséges játékinformációk a vágólapra másolódnak.
ko: 아래 버튼을 사용하여 필요한 게임 정보를 클립보드에 복사하세요.
sv_se: Använd nedanstående knapp för att kopiera all relevant spelinformation till urklippet.

source: You can also directly report your game to the Bug Tracker.
hu_hu: A játékot közvetlenül a Bug Tracker-be is bejelentheti.
ko: 버그 트래커로 게임을 직접 보고할 수도 있습니다.
sv_se: Du kan också rapportera spelet direkt till vårt felrapporteringssystem.

source: All necessary information about your game has been copied into the clipboard
hu_hu: Minden szükséges információ a játékról a vágólapra került másolásra
ko: 게임에 대한 모든 필수 정보가 클립보드로 복사되었음
sv_se: All relevant spelinformation har kopierats till urklippet

source: Copying the game information to the clipboard has failed!
hu_hu: Sikertelen a játékinformációk vágólapra másolása!
ko: 게임 정보를 클립보드로 복사하는데 실패했습니다!
sv_se: Det gick inte att kopiera spelinformationen till urklippet!

source: ScummVM now supports automatic check for updates which requires access to the Internet. Would you like to enable this feature?
hu_hu: ScummVM immáron támogatja az automatikus frissítéseket amely internethozzáférést igényel. Szeretné engedélyezni ezt a funkciót?
ko: ScummVM은 자동 업데이트 검사를 지원합니다. 이 기능은 인터넷 연결이 필요합니다. 자동 업데이트 검사를 활성화하겠습니까?
sv_se: ScummVM stöder nu automatisk uppdateringskontroll, vilket kräver en internetanslutning. Vill du aktivera den här funktionen?

source: You can change this setting later in the Misc tab in the Options dialog.
hu_hu: Ezt a beállítást később módosíthatja az Egyéb lapon az Opciók párbeszédablakban.
ko: 이 설정은 나중에 옵션 대화 상자의 기타 탭에서 변경할 수 있습니다.
sv_se: Du kan ändra den här inställningen senare under "Diverse"-fliken i Inställningar.

source: Clear value
hu_hu: Érték törlése
ko: 값 지우기
sv_se: Töm värdet

source: Play
hu_hu: Indítás
ko: 플레이
sv_se: Spela

source: Saves
hu_hu: Mentések
ko: 저장
sv_se: Sparar

source: Bad config file format. overwrite?
hu_hu: Hibás konfigurációs fájl formátum. Felülírható?
ko: 잘못된 구성 파일 형식입니다. 덮어쓰겠습니까?
sv_se: Fel formatering av konfigurationsfil. Skriv över?

source: In this new version of ScummVM for Android, significant changes were made to the file access system to allow support for modern versions of the Android Operating System. If you find that your existing added games or custom paths no longer work, please edit those paths: 1. From the Launcher, go to **Game Options > Paths**. Select **Game Path** or **Extra Path**, as appropriate. 2. Inside the ScummVM file browser, select **Go Up** until you reach the root folder which has the **<Add a new folder>** option. 3. Double-tap **<Add a new folder>**. In your device's file browser, navigate to the folder containing all your game folders. For example, **SD Card > ScummVMgames** 4. Select **Use this folder**. 5. Select **Allow** to give ScummVM permission to access the folder. 6. In the ScummVM file browser, double-tap to browse through your added folder. Select the folder containing the game's files, then tap **Choose**. Repeat steps 1 and 6 for each game.
hu_hu: Az Android-os ScummVM új verziójában jelentős fájl hozzáférési rendszer változások kerültek beiktatásra annak érdekébe, hogy támogassa a modern verziójú Android rendszereket is. Ha azt veszi észre, hogy a korábban hozzáadott játékok vagy egyéni elérési utak nem működnek, kérjük szerkessze át ennek megfelelően ezeket: 1. Az Indítóban lépjen be a **Játék Opciók > Elérési utak** vagy **Extra elérési utak** menük valamelyikébe. 2. A ScummVM fájlkezelőn belül nyomjon mindig a **Fel**-re, egészen addig amíg el nem éri a gyökeret, amely már csak **<Új mappa hozzáadása>** opciót tartalmaz. 3. Nyomjon duplán az **<Új mappa hozzáadása>** menüre, majd navigáljon a játékait tartalmazó mappába. Például **SD Kártya > ScummVMjatekok** 4. Válassza a **Mappa használata** menüt. 5. Válassza az **Engedélyez** menüt, hogy hozzáférést biztosítson a ScummVM számára a mappához. 6. A ScummVM fájlkezelőben használjon dupla érintést a hozzáadott mappák közötti böngészéshez. Válassza ki a játék fájljait tartalmazó mappát, majd nyomjon a **Kiválaszt** gombra. Ismételje meg mind a hat lépést az összes játéknál.
ko: 안드로이드용 ScummVM의 이 새 버전에서는 최신 버전의 안드로이드 운영 체제를 지원하기 위해 파일 접속 시스템에 상당한 변경이 이루어졌습니다. 기존에 추가한 게임이나 커스텀 경로가 더 이상 작동하지 않는 경우 해당 경로 편집: 1. 런처에서 **게임 옵션 > 경로**로 이동합니다. 필요에 따라 **게임 경로** 또는 **추가 경로**를 선택합니다. 2. ScummVM 파일 브라우저에서 **<새 폴더 추가>** 옵션이 있는 루트 폴더에 도달할 때까지 **위로 이동**을 선택합니다. 3. **<새 폴더 추가>**를 두 번 탭합니다. 장치의 파일 브라우저에서, 모든 게임 폴더가 들어 있는 폴더로 이동합니다. 예를 들어, **SD 카드 > ScummVMgames** 4. **이 폴더 사용**을 선택합니다. 5. **허용**을 선택하여 ScummVM에 폴더에 대한 접속 권한을 부여합니다. 6. ScummVM 파일 브라우저에서, 두 번 탭하여 추가한 폴더를 탐색. 게임 파일이 있는 폴더를 선택한 다음 **선택**을 탭합니다. 각 게임에 대해 1~6 단계를 반복합니다.
sv_se: I den här nya versionen av ScummVM för Android har betydande ändringar gjorts i filåtkomstsystemet för att möjliggöra stöd för moderna versioner av Android-operativsystemet. Om du upptäcker att dina befintliga tillagda spel eller anpassade sökvägar inte längre fungerar, redigera dessa sökvägar: 1. Från spelstartaren, gå till **Spelalternativ &gt; Sökvägar**. Välj **Spelsökväg** eller **Extra sökväg**, beroende på vad som är lämpligt. 2. I ScummVM:s filbläddrare väljer du **Gå upp** tills du når rotmappen som har alternativet **<Lägg till en ny mapp>**. 3. Dubbelklicka på **<Lägg till en ny mapp>**. I din enhets filbläddrare navigerar du till mappen som innehåller alla dina spelmappar. Till exempel, **SD-kort &gt; ScummVM-spel** 4. Välj **Använd den här mappen**. 5. Välj **Tillåt** för att ge ScummVM behörighet att komma åt mappen. 6. I ScummVM:s filbläddrare dubbelklickar du för att bläddra igenom din tillagda mapp. Välj den mapp som innehåller spelets filer och tryck sedan på **Välj**. Upprepa steg 1 och 6 för varje spel.

source: Read Later
hu_hu: Elolvasás később
ko: 나중에 읽기
sv_se: Läs senare

source: In this new version of ScummVM for Android, significant changes were made to the file access system to allow support for modern versions of the Android Operating System. To add a game: 1. Select **Add Game...** from the launcher. 2. Inside the ScummVM file browser, select **Go Up** until you reach the root folder which has the **<Add a new folder>** option. 3. Double-tap **<Add a new folder>**. In your device's file browser, navigate to the folder containing all your game folders. For example, **SD Card > ScummVMgames** 4. Select **Use this folder**. 5. Select **Allow** to give ScummVM permission to access the folder. 6. In the ScummVM file browser, double-tap to browse through your added folder. Select the sub-folder containing the game's files, then tap **Choose**. Repeat steps 1 and 6 for each game.
hu_hu: Az Android-os ScummVM új verziójában jelentős fájl hozzáférési rendszer változások kerültek beiktatásra annak érdekébe, hogy támogassa a modern verziójú Android rendszereket is. Játék hozzáadása:: 1. Az Indítóban válassza a **Játék Hozzáadása...** gombot. 2. A ScummVM fájlkezelőn belül nyomjon mindig a **Fel**-re, egészen addig amíg el nem éri a gyökeret, amely már csak **<Új mappa hozzáadása>** opciót tartalmaz. 3. Nyomjon duplán az **<Új mappa hozzáadása>** menüre, majd navigáljon a játékait tartalmazó mappába. Például **SD Kártya > ScummVMjatekok** 4. Válassza a **Mappa használata** menüt. 5. Válassza az **Engedélyez** menüt, hogy hozzáférést biztosítson a ScummVM számára a mappához. 6. A ScummVM fájlkezelőben használjon dupla érintést a hozzáadott mappák közötti böngészéshez. Válassza ki a játék fájljait tartalmazó mappát, majd nyomjon a **Kiválaszt** gombra. Ismételje meg mind a hat lépést az összes játéknál.
ko: 안드로이드용 ScummVM의 이 새 버전에서는 최신 버전의 안드로이드 운영 체제를 지원할 수 있도록 파일 접속 시스템에 상당한 변경이 이루어졌습니다. 게임을 추가하려면: 1.런처에서 **게임 추가...**를 선택합니다. 2. ScummVM 파일 브라우저에서 **<새 폴더 추가>** 옵션이 있는 루트 폴더에 도달할 때까지 **위로 이동**을 선택합니다. 3. **<새 폴더 추가>**를 두 번 탭합니다. 장치의 파일 브라우저에서 모든 게임 폴더가 있는 폴더로 이동합니다. 예를 들어, **SD 카드 > ScummVMgames** 4. **이 폴더 사용**을 선택합니다. 5. **허용**을 선택하여 ScummVM에 폴더에 대한 액세스 권한을 부여합니다. 6. ScummVM 파일 브라우저에서 두 번 탭하여 추가한 폴더를 탐색합니다. 게임 파일이 들어 있는 하위 폴더를 선택한 다음 **선택**을 탭합니다. 각 게임마다 1~ 6 단계를 반복합니다.
sv_se: I den här nya versionen av ScummVM för Android gjordes betydande ändringar i filåtkomstsystemet för att möjliggöra stöd för moderna versioner av Android-operativsystemet. För att lägga till ett spel: 1. Välj **Lägg till spel...** från spelstartaren. 2. I ScummVM:s filbläddrare väljer du **Gå upp** tills du kommer till rotmappen som har alternativet **<Lägg till en ny mapp>**. 3. Dubbelklicka på **<Lägg till en ny mapp>**. I din enhets filbläddrare navigerar du till mappen som innehåller alla dina spelmappar. Till exempel, **SD-kort &gt; ScummVM-spel** 4. Välj **Använd den här mappen**. 5. Välj **Tillåt** för att ge ScummVM tillåtelse att komma åt mappen. 6. I ScummVM:s filbläddrare dubbelklickar du för att bläddra igenom din tillagda mapp. Välj den undermapp som innehåller spelets filer och tryck sedan på **Välj**. Upprepa steg 1 och 6 för varje spel.

source: Error running game:
hu_hu: Hiba a játék futtatásakor:
ko: 게임 실행 중 오류:
sv_se: Fel under körning av spel:

source: Could not locate engine data %s
hu_hu: Nem található %s motor adat
ko: 엔진 데이터 %s을(를) 찾을 수 없음
sv_se: Kunde inte hitta spelmotordata %s

source: Out of date engine data. Expected %d.%d, but got version %d.%d
hu_hu: Elavult motoradat. Az elvárt %d.%d helyett %d.%d dátumú
ko: 오래된 엔진 데이터 입니다. 필요한 버전: %d.%d, 실제 버전: %d.%d
sv_se: Gammal spelmotordata hittades. Version %d.%d krävs, hittade %d.%d

source: No error
hu_hu: Nincs hiba
ko: 오류 없음
sv_se: Inget fel

source: Game data not found
hu_hu: Játék adat nem található
ko: 게임 데이터를 찾을 수 없음
sv_se: Kunde inte hitta speldata

source: Game id not supported
hu_hu: Nem támogatott játék azonosító
ko: 게임 ID가 지원되지 않음
sv_se: Detta spel-id stöds inte

source: Unsupported color mode
hu_hu: Nem támogatott színmód
ko: 지원되지 않는 색상 모드
sv_se: Färgläget stöds inte

source: Audio device initialization failed
hu_hu: Sikertelen hang eszköz inicializálás
ko: 오디오 장치 초기화에 실패함
sv_se: Initialiseringen av ljudenheten misslyckades

source: Read permission denied
hu_hu: Olvasás hozzáférés megtagadva
ko: 읽기 권한이 거부되었음
sv_se: Läsbehörighet nekades

source: Write permission denied
hu_hu: Írás hozzáférés megtagadva
ko: 쓰기 권한이 거부되었음
sv_se: Skrivbehörighet nekades

source: Path does not exist
hu_hu: Elérési út nem létezik
ko: 경로가 존재하지 않음
sv_se: Sökvägen finns inte

source: Path not a directory
hu_hu: Elérési út nem könyvtárra mutat
ko: 경로가 디렉터리가 아님
sv_se: Sökvägen är inte en katalog

source: Path not a file
hu_hu: Elérési út nem fájlra mutat
ko: 경로가 파일이 아님
sv_se: Sökvägen är inte en fil

source: Cannot create file
hu_hu: Fájl nem hozható létre
ko: 파일을 만들 수 없음
sv_se: Kan inte skapa fil

source: Reading data failed
hu_hu: Hiba az olvasás közben
ko: 데이터 읽기에 실패함
sv_se: Inläsning av data misslyckades

source: Writing data failed
hu_hu: Hiba az írás közben
ko: 데이터 쓰기에 실패함
sv_se: Skrivning av data misslyckades

source: Could not find suitable engine plugin
hu_hu: Nem található alkalmas motor plugin
ko: 적합한 엔진 플러그인을 찾을 수 없음
sv_se: Kunde inte hitta lämpligt motortillägg

source: Engine plugin does not support saved games
hu_hu: A motor plugin nem támogatja a játékállás mentését
ko: 엔진 플러그인은 저장된 게임을 지원하지 않음
sv_se: Motorns tillägg saknar stöd för sparade spel

source: User canceled
hu_hu: Felhasználói megszakítás
ko: 사용자가 취소함
sv_se: Avbruten av användaren

source: Unknown error
hu_hu: Ismeretlen hiba
ko: 알 수 없는 오류
sv_se: Okänt fel

source: Hercules Green
hu_hu: Hercules Zöld
ko: 허큘리스 녹색
sv_se: Herkules-grön

source: Hercules Amber
hu_hu: Hercules Sárga
ko: 허큘리스 등색
sv_se: Herkules-bärnsten

source: PC-9821 (256 Colors)
hu_hu: PC-9821 (256 Szín)
ko: PC-9821 (256 색)
sv_se: PC-9821 (256 färger)

source: PC-9801 (16 Colors)
hu_hu: PC-9801 (16 Szín)
ko: PC-9801 (16 색)
sv_se: PC-9801 (16 färger)

source: PC-9801 (8 Colors)
hu_hu: PC-9801 (8 Szín)
ko: PC-9801 (8 색)
sv_se: PC-9801 (8 färger)

source: Macintosh b/w
hu_hu: Macintosh f/f
ko: 매킨토시 흑백
sv_se: Macintosh s/v

source: VGA Grey Scale
hu_hu: VGA Szürke-árnyalatos
ko: VGA 회색 스케일
sv_se: VGA-gråskala

source: Windows (256 Colors)
hu_hu: Windows (256 Szín)
ko: 윈도우 (256 색)
sv_se: Windows (256 färger)

source: Windows (16 Colors)
hu_hu: Windows (16 Szín)
ko: 윈도우 (16 색)
sv_se: Windows (16 färger)

# lowres
source: Hercules Green
hu_hu: Hercules Zöld
ko: 허큘리스 녹색
sv_se: Herkules-grön

# lowres
source: Hercules Amber
hu_hu: Hercules Sárga
ko: 허큘리스 등색
sv_se: Herkules-bärnsten

source: No rotation
hu_hu: Nincs forgatás
ko: 회전 없음
sv_se: Ingen rotering

source: Clockwise
hu_hu: Óra járással megfelelő
ko: 시계 방향
sv_se: Medurs

source: 180 degrees
hu_hu: 180 fok
sv_se: 180 grader

source: Counter-clockwise
hu_hu: Óra járással ellentétes
ko: 반시계 방향
sv_se: Moturs

source: Daily
hu_hu: Naponta
ko: 매일
sv_se: Dagligen

source: Weekly
hu_hu: Hetente
ko: 매주
sv_se: Varje vecka

source: Monthly
hu_hu: Havonta
ko: 매달
sv_se: Varje månad

source: <Bad value>
hu_hu: <Rossz érték>
ko: <잘못된 값>
sv_se: <Felaktigt värde>

source: Bitmap Image File
hu_hu: Bitmap képfájl
ko: 비트맵 이미지 파일
sv_se: Bitmap-bildfil

source: PNG Image File
hu_hu: PNG képfájl
ko: PNG 이미지 파일
sv_se: PNG-bildfil

source: JPEG Image File
hu_hu: JPEG képfájl
ko: JPEG 이미지 파일
sv_se: JPEG-bildfil

source: QuickDraw PICT Image File
hu_hu: QuickDraw PICT képfájl
ko: 퀵드로우 PICT 이미지 파일
sv_se: QuickDraw PICT-bildfil

source: Data File
hu_hu: Adatfájl
ko: 데이터 파일
sv_se: Datafil

source: ScummVM (debug)
ko: ScummVM (디버그)
sv_se: ScummVM (felsökning)

source: Graphic adventure game engine
hu_hu: Grafikus kalandjáték motor
ko: 그래픽 고급 게임 엔진
sv_se: Grafisk äventyrsspelmotor

source: Quit
hu_hu: Kilépés
ko: 종료
sv_se: Avsluta

source: Log File Error
hu_hu: Napló Fájl Hiba
ko: 로그 파일 오류
sv_se: Loggfilsfel

source: Unable to read ScummVM log file or create a new one!
hu_hu: Nem olvasható a ScummVM napló fájl, és nem is készíthető új!
ko: ScummVM 로그 파일을 읽을 수 없거나 새 로그 파일을 만들 수 없습니다!
sv_se: Kan inte läsa ScummVM-loggfil eller skapa en ny!

source: Config File Error
hu_hu: Konfigurációs fájl hiba
ko: 구성 파일 오류
sv_se: Fel i konfigurationsfil

source: Unable to read ScummVM config file or create a new one!
hu_hu: Nem olvasható a ScummVM konfigurációs fájl, és nem is készíthető új!
ko: ScummVM 구성 파일을 읽거나 새 파일을 만들 수 없습니다!
sv_se: Kan inte läsa konfigurationsfilen för ScummVM eller skapa en ny!

source: Save Path Error
hu_hu: Mentési Útvonal Hiba
ko: 저장 경로 오류
sv_se: Fel i sparningssökväg

source: Unable to create or access default save path!
hu_hu: Nem lehet létrehozni vagy hozzáférni az alapértelmezett mentési útvonalat!
ko: 기본 저장 경로를 만들거나 접근할 수 없습니다!
sv_se: Kan inte skapa eller komma åt standardsökväg för sparningar!

source: Icons Path Error
hu_hu: Ikon Útvonal Hiba
ko: 아이콘 경로 오류
sv_se: Fel i ikonsökväg

source: Unable to create or access default icons and shaders path!
hu_hu: Nem lehet létrehozni vagy hozzáférni az alapértelmezett ikonok és shaderek elérési útját!
ko: 기본 아이콘과 셰이더 경로를 만들거나 접근할 수 없습니다!
sv_se: Kan inte skapa eller komma åt standardsökväg för ikoner och shaders!
