Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: Show objects to interact
hu_hu: Interaktív tárgyak megjelenítése
ko: 상호 작용할 개체 표시
sv_se: Visa objekt för att interagera

source: Toggle background sounds on / off
sv_se: Växla bakgrundsljud på/av

source: Switch characters
hu_hu: Karakterek cseréje
ko: 캐릭터 전환
sv_se: Växla karaktärer

source: Toggle hitbox names on / off
sv_se: Växla hitbox-namn på/av

source: Switches between speech only and combined speech and subtitles
hu_hu: Csak beszéd valamint beszéd és felirat mód közötti váltás
ko: 음성만 또는 음성과 자막을 합친 것을 전환
sv_se: Växlar mellan endast tal och kombinerat tal och undertexter

source: Switches between subtitles only and combined speech and subtitles
hu_hu: Csak felirat valamint beszéd és felirat mód közötti váltás
ko: 자막만 또는 음성과 자막을 합친 형태로 전환
sv_se: Växlar mellan endast undertexter och kombinerat tal och undertexter

source: High speed mode on/off in Swampy Adventures
hu_hu: Gyors sebességű mód be/ki a Swampy Adentures-ben
ko: Swampy Adventures에서 고속 모드 켜기/끄기
sv_se: Högt hastighetsläge på/av i Swampy Adventures

source: Press "Yes" key
hu_hu: Noymja meg az "Igen" gombot
ko: "예" 키를 누름
sv_se: Tryck på "Ja"-tangenten

source: Press "No" key
hu_hu: Nyomja meg a "Nem" gombot
ko: "아니오" 키를 누름
sv_se: Tryck på "Nej"-tangenten

source: You appear to be using a General MIDI device, but your game only supports Roland MT32 MIDI. We try to map the Roland MT32 instruments to General MIDI ones. It is still possible that some tracks sound incorrect.
hu_hu: Úgy tűnik, egy General MIDI eszközt használ, de a játék csak Roland MT32 MIDI eszközt támogat. Megpróbáljuk helyettesíteni a Roland MT32 hangszereket General MIDI-vel. Továbbra is lehetséges hogy néhány hangsáv helytelenül kerül lejátszásra.
ko: 일반 미디 장치를 사용하는 것 같지만, 게임은 롤랜드 MT32 미디만 지원합니다. 롤랜드 MT32 악기를 일반 미디 악기에 매핑하려고 합니다. 일부 트랙 사운드가 잘못 들릴 가능성도 있습니다.
sv_se: Du verkar använda en General MIDI-enhet, men ditt spel stöder endast Roland MT32 MIDI. Vi försöker kartlägga Roland MT32-instrumenten till General MIDI-instrument. Det kan trots allt hända att ett fåtal ljudspår inte spelas korrekt.

source: Could not find AdLib instrument definition file %s. Without this file, the music will not sound the same as the original game.
hu_hu: Nem található AdLib hangszerdefiníciós %s fájl. A fájl nélkül, a zene nem olyan, mint az eredeti játékban.
ko: 애드립 악기 정의 파일 %s을(를) 찾을 수 없습니다. 이 파일들이 없다면, 음악이 원래 게임과 같은 사운드가 나오지 않습니다.
sv_se: Kunde inte hitta AdLib-definitionsfilen för instrument %s. Utan den här filen, låter musiken inte på samma sätt som i originalspelet.

source: Could not find AdLib instrument definition file %s. Without this file, the sound effects will not sound the same as the original game.
hu_hu: Nem található AdLib hangszerdefiníciós %s fájl. A fájl nélkül, a hangeffektek nem olyanok, mint az eredeti játékban.
ko: 애드립 악기 정의 파일 %s을(를) 찾을 수 없습니다. 이 파일들이 없다면, 사운드 효과가 원래 게임과 동일하게 들리지 않습니다.
sv_se: Kunde inte hitta AdLib-definitionsfilen för instrument %s. Utan den här filen, kan inte ljudeffekterna låta på samma sätt som i originalspelet.

source: Could not find AdLib instrument definition file %s or %s. Without one of these files, the music will not sound the same as the original game.
hu_hu: Nem található egyik AdLib %s vagy %s hangszerdefiníciós fájl sem. A fájlok nélkül, a zene nem olyan, mint az eredeti játékban.
ko: 애드립 악기 정의 파일 %s 또는 %s을(를) 찾을 수 없습니다. 이 파일 중 하나가 없으면, 음악이 원래 게임과 같은 사운드가 나오지 않습니다.
sv_se: Kunde inte hitta AdLib-definitionsfilen för instrument %s eller %s. Utan någon av dessa filer, låter musiken inte på samma sätt som i originalspelet.

source: Quick load or save game isn't supported in this location
hu_hu: A játék gyors töltése vagy mentése nem támogatott ezen a helyen
ko: 이 위치에서는 빠른 게임 불러오기 또는 저장이 지원되지 않음
sv_se: Snabbinläsning eller sparning av spel stöds inte på denna plats

source: Failed to load saved game from file: %s
hu_hu: Sikertelen a mentás betöltése: %s
ko: 파일에서 저장된 게임을 불러오는 데 실패함: %s
sv_se: Kunde inte läsa spardata från filen: %s

source: Failed to save game to file: %s
hu_hu: Sikertelen a játékmenet mentése: %s
ko: 게임을 파일에 저장하는 데 실패함: %s
sv_se: Kunde inte spara spelet till fil: %s

source: Successfully saved game in file: %s
hu_hu: Sikeres játék mentés a következő fájlba: %s
ko: 게임을 파일에 성공적으로 저장함: %s
sv_se: Sparade spardata i filen: %s

source: The selected game uses a pre-2.5 version of the AGS engine, which is not supported.
hu_hu: A választott játék az AGS motor 2.5-ös előtti verzióját használja, amely már nem támogatott.
ko: 선택한 게임은 지원되지 않는 AGS 엔진 2.5 이전 버전을 사용합니다.
sv_se: Det valda spelet använder en version av AGS-motorn som är äldre än 2.5 och som inte stöds.

source: The selected game uses version 4 of the AGS engine, which is not supported.
sv_se: Det valda spelet använder version 4 av AGS-motorn som inte stöds.

source: The selected game has a data file greater than 2Gb, which isn't supported by your version of ScummVM yet.
hu_hu: A kiválasztott játék 2 Gb -nál nagyobb adatfájlt tartalmaz, amelyet a ScummVM verziója még nem támogat.
ko: 선택한 게임의 데이터 파일이 2GB보다 크며, 해당 버전은 아직 ScummVM에서 지원하지 않습니다.
sv_se: Det valda spelet har en datafil som är större än 2 GB, vilket inte stöds av din version av ScummVM ännu.

source: To preserve the original experience, this game should be loaded using the in-game interface. You can, however, override this setting in Game Options.
hu_hu: Az eredeti élmény érdekében a mentést az eredeti felületen belül érdemes betölteni. Habár ezt felülírhatja a Játék opciókban.
ko: 원래 경험을 보존하려면, 이 게임은 게임 내 인터페이스를 사용하여 불러와야 합니다. 그러나, 게임 옵션에서 이 설정을 재정의할 수 있습니다.
sv_se: För att bevara den ursprungliga upplevelsen bör det här spelet läsas in med hjälp av gränssnittet i spelet. Du kan dock åsidosätta den här inställningen i Spelalternativ.

source: To preserve the original experience, this game should be saved using the in-game interface. You can, however, override this setting in Game Options.
hu_hu: Az eredeti élmény érdekében a mentést az eredeti felületen belül érdemes lementeni. Habár ezt felülírhatja a Játék opciókban.
ko: 원래 경험을 보존하려면, 이 게임은 게임 내 인터페이스를 사용하여 저장해야 합니다. 그러나, 게임 옵션에서 이 설정을 재정의할 수 있습니다.
sv_se: För att bevara den ursprungliga upplevelsen bör detta spel sparas med hjälp av gränssnittet i spelet. Du kan dock åsidosätta den här inställningen i Spelalternativ.

source: Game language:
hu_hu: Játék nyelve:
ko: 게임 언어:
sv_se: Spelspråk:

source: Language to use for multilingual games
hu_hu: A többnyelvű játékokhoz használt nyelv
ko: 다중 언어 게임에서 사용할 언어
sv_se: Språk att använda för flerspråkiga spel

source: Enable ScummVM save management
hu_hu: A ScummVM mentés kezelés bekapcsolása
ko: ScummVM 저장 관리 활성화
sv_se: Aktivera ScummVMs sparningshantering

source: Never disable ScummVM save management and autosaves. NOTE: This could cause save duplication and other oddities
hu_hu: Soha nem kapcsolja ki a ScummVM mentés kezelőt és az automatamentést. MEGJEGYZÉS: Ez mentés duplázáshoz és más fura dologhoz vezethet
ko: ScummVM 저장 관리 및 자동 저장을 비활성화하지 마십시오. 참고: 이로 인해 저장 중복 및 기타 이상한 현상이 발생할 수 있음
sv_se: Inaktivera aldrig ScummVM:s sparhantering och autospar. OBS: Detta kan orsaka dubblering av sparande och andra konstigheter

source: Force antialiased text
hu_hu: Élsimított szöveg erőltetése
ko: 강제 안티에일리어싱된 텍스트
sv_se: Tvinga kantutjämnad text

source: Use antialiasing to draw text even if the game does not ask for it
hu_hu: Használjon élsimítást a szöveg rajzolásához, akkor is ha a játék nem kéri
ko: 게임에서 요청하지 않더라도 안티에일리어싱을 사용하여 텍스트를 그림
sv_se: Använd kantutjämning för att rita text även om spelet inte frågar efter det

source: Show FPS
hu_hu: FPS mutatása
ko: FPS 표시
sv_se: Visa bilder/s

source: Show the current FPS-rate, while you play.
hu_hu: Mutassa az aktuális FPS-t játék közben.
ko: 플레이 중 현재 FPS를 표시합니다.
sv_se: Visa den aktuella bildfrekvensen medan du spelar.

source: The game will now list characters exported from the Sierra games that can be imported: 1. Save files named qfg1*.sav or qfg1vga*.sav inside ScummVM save directory, or 2. Any .sav file inside the QfG2 Remake game directory
hu_hu: A játék kilistázza azon kiexportált karaktereket, amiket importálni is lehet: 1. Mentse a fájlokat qfg1*.sav vagy qfg1vga*.sav néven a ScummVM mentés könyvtáron belül, vagy 2. Bármely .sav fájl a QfG2 Remake játék könyvtáron belül
ko: 이제 게임은 시에라 게임에서 내보낸 캐릭터를 나열하여 가져올 수 있습니다. 1. ScummVM 저장 디렉터리 내에 qfg1*.sav 또는 qfg1vga*.sav라는 이름의 저장 파일, 또는 2. QfG2 리메이크 게임 디렉터리 내의 모든 .sav 파일
sv_se: Spelet kommer nu att lista karaktärer som exporterats från Sierra-spelen som kan importeras: 1. Spara filer med namnet qfg1*.sav eller qfg1vga*.sav i ScummVM:s sparkatalog, eller 2. Alla .sav-filer i spelkatalogen för QfG2 Remake

source: Old OpenGL detected, some graphical errors will occur.
sv_se: Gammal OpenGL har upptäckts, vissa grafiska fel kommer att uppstå.

source: High Quality
sv_se: Hög kvalitet

source: Toggles some optional graphical effects
sv_se: Växlar några valfria grafiska effekter

source: 32 Bits
sv_se: 32-bitars

source: Whether to render the game in 16-bit color
sv_se: Huruvida spelet ska renderas i 16-bitars färg

source: Activate
hu_hu: Aktivál
ko: 활성화
sv_se: Aktivera

source: Look at
hu_hu: Megnéz
ko: 보기
sv_se: Titta på

source: Use lower quality single speed CD-ROM video
sv_se: Använd CD-ROM-video med lägre kvalitet och hastighet

source: These videos are of lower quality, the default version uses double speed CD-ROM videos which are of better quality
sv_se: Dessa videor är av lägre kvalitet. Standardversionen använder CD-ROM-videor med dubbel hastighet, som är av bättre kvalitet

source: Show version
hu_hu: Verzió megjelenítése
ko: 버전 표시
sv_se: Visa version

source: Quick load
hu_hu: Gyorstöltés
ko: 빠른 불러오기
sv_se: Snabbinläsning

source: Quick save
hu_hu: Gyorsmentés
ko: 빠른 저장
sv_se: Snabbsparning

source: Switch to Sarah
hu_hu: Átvált Sarah-ra
ko: Sarah로 전환
sv_se: Växla till Sarah

source: Switch to Grimwall
hu_hu: Átvált Grimwall-ra
ko: Grimwall로 전환
sv_se: Växla till Grimwall

source: Switch to Olmec
hu_hu: Átvált Olmec-re
ko: Olmec으로 전환
sv_se: Växla till Olmec

source: Bring up the In-Game Menu
hu_hu: Játékon belüli menü előhívása
ko: 게임 내 메뉴 불러오기
sv_se: Ta fram menyn i spelet

source: Open character inventory
hu_hu: Karakter-felszerelés megnyitása
ko: 캐릭터 인벤토리 열기
sv_se: Öppna karaktärsöversikt

source: Toggle animation on / off
sv_se: Växla animering på/av

source: Return to gameplay
hu_hu: Visszatérés a játékmenetbe
ko: 게임 플레이로 돌아가기
sv_se: Återgå till spelet

source: Previous resource
hu_hu: Előző forrás
ko: 이전 리소스
sv_se: Föregående resurs

source: Next resource
hu_hu: Következő forrás
ko: 다음 리소스
sv_se: Nästa resurs

source: Previous palette
hu_hu: Előző paletta
ko: 이전 팔레트
sv_se: Föregående palett

source: Next palette
hu_hu: Következő paletta
ko: 다음 팔레트
sv_se: Nästa palett

source: WARNING: Attempt to load saved game from a previous version: Version %s / Build %d
hu_hu: FIGYELEM: Kísérlet a mentett játék betöltésére egy korábbi verzióból: Verzió %s / Build %d
ko: 경고: 이전 버전에서 저장한 게임을 불러오려고 시도함: 버전 %s / 빌드 %d
sv_se: VARNING: Försök att läsa in ett sparat spel från en tidigare version: Version %s / Byggversion %d

source: Load anyway
hu_hu: Betöltés mindenképp
ko: 무시하고 불러오기
sv_se: Läs in ändå

source: Enable title and copy protection screens (if present)
sv_se: Aktivera skärmar för titel och kopieringsskydd (om det finns)

source: Displays title and copy protection screens that would otherwise be bypassed by default.
sv_se: Aktivera skärmar för titel och kopieringsskydd som annars skulle ha hoppats över som standard.

source: Select/Kick/Run
sv_se: Välj/Sparka/Spring

source: Jump
hu_hu: Ugrás
ko: 점프
sv_se: Hoppa

source: Enter Level Code
sv_se: Ange nivåkod

source: Game Keys
hu_hu: Játék Gombok
ko: 게임 키
sv_se: Speltangenter

source: Wait
hu_hu: Várjon
ko: 대기
sv_se: Vänta

source: Soldier 714 Eye Cheat
hu_hu: Soldier 714 Szem Csalás
ko: Soldier 714 Eye 치트
sv_se: Soldier 714 ögonfusk

source: Page Up
sv_se: Sida upp

source: Page Down
sv_se: Sida ner

source: Home
sv_se: Hem

source: General Keys
hu_hu: Általános Gombok
ko: 일반 키
sv_se: Allmänna tangenter

source: Minimal Keys
sv_se: Minimala tangenter

source: Escape keymappings
hu_hu: Kilépési kiosztások
ko: Escape 키맵핑
sv_se: Escape-kortkommandon

source: Open inventory
hu_hu: Felszerelés megnyitása
ko: 인벤토리 열기
sv_se: Öppna översikt

source: Failed to initialize resources
hu_hu: Nem sikerült inicializálni az erõforrásokat
ko: 리소스 초기화에 실패함
sv_se: Misslyckades med att initiera resurser

source: A required game resource was not found
hu_hu: A szükséges játékforrás nem található
ko: 필요한 게임 리소스를 찾을 수 없음
sv_se: En nödvändig spelresurs hittades inte

source: WARNING: This game was saved in Restored Cut Content mode, but you are playing in Original Content mode. The mode will be adjusted to Restored Cut Content for this session until you completely Quit the game.
hu_hu: FIGYELEM: A játékállás Visszaállított Vágott Tartalom módban került mentésre, de Eredeti Tartalom módban játszik. Az üzemmód a Visszaállított Vágott Tartalomhoz igazodik, amíg teljesen ki nem lép a játékból.
ko: 경고: 이 게임은 복원된 컷 콘텐츠 모드로 저장되었지만, 오리지널 콘텐츠 모드로 플레이하고 있습니다. 이 모드는 게임을 완전히 종료할 때까지 이 세션에 대해 복원된 컷 콘텐츠로 조정됩니다.
sv_se: VARNING: Det här spelet sparades i läget Restored Cut Content, men du spelar i läget Original Content. Läget kommer att justeras till Restored Cut Content för den här sessionen tills du avslutar spelet helt och hållet.

source: WARNING: This game was saved in Original Content mode, but you are playing in Restored Cut Content mode. The mode will be adjusted to Original Content mode for this session until you completely Quit the game.
hu_hu: FIGYELEM: A játékállás Eredeti Tartalom módban került mentésre, de Visszaállított Vágott Tartalom módban játszik. Az üzemmód az Eredeti Tartalomhoz igazodik, amíg teljesen ki nem lép a játékból.
ko: 경고: 이 게임은 오리지널 콘텐츠 모드로 저장되었지만, 복원된 잘라낸 콘텐츠 모드로 플레이하고 있습니다. 게임을 완전히 종료할 때까지 이 세션의 모드는 오리지널 콘텐츠 모드로 조정됩니다.
sv_se: VARNING: Det här spelet sparades i läget Original Content, men du spelar i läget Restored Cut Content. Läget kommer att justeras till Original Content-läget för den här sessionen tills du avslutar spelet helt och hållet.

source: Continue
hu_hu: Folytatás
ko: 계속
sv_se: Fortsätt

source: The fan translator does not wish his translation to be incorporated into ScummVM.
hu_hu: A rajongói fordító nem kívánja, hogy fordítását beépítsék a ScummVM-be.
ko: 팬 번역가는 자신의 번역이 ScummVM에 통합되는 것을 원하지 않습니다.
sv_se: Fan-översättaren önskar att hans översättning inte inkluderas i ScummVM.

source: Enhanced Edition not supported. Please, use the original files which are part of the release.
hu_hu: A Bővített Kiadás nem támogatott. Kérem használja az eredeti fájlokat, melyek a kiadás részei.
ko: 강화판은 지원되지 않습니다. 릴리스의 일부인 원본 파일을 사용하세요.
sv_se: Enhanced Edition stöds inte. Använd originalfilerna som är en del av utgåvan.

source: Sitcom mode
hu_hu: Sitcom mód
ko: 시트콤 모드
sv_se: Sitcom-läge

source: Game will add laughter after actor's line or narration
hu_hu: A játék nevetést játszik be a színész vagy narrátor sorai után
ko: 게임은 배우의 대사나 내레이션 이후에 웃음을 더해줌
sv_se: Spelet kommer att lägga till skratt efter skådespelarens replik eller berättelse

source: Shorty mode
hu_hu: Rövid mód
ko: 쇼티 모드
sv_se: Kortväxt läge

source: Game will shrink the actors and make their voices high pitched
hu_hu: A játék lezsugorítja a színészeket, és megemeli hangszintjüket
ko: 게임에서는 배우들이 작아지고 목소리가 높아짐
sv_se: Spelet krymper skådespelarna och gör deras röster högfrekventa

source: Frame limiter high performance mode
hu_hu: Képkocka korlátozó magas teljesítményű mód
ko: 프레임 제한 고성능 모드
sv_se: Bildfrekvensgräns i högprestandaläget

source: This mode may result in high CPU usage! It avoids use of delayMillis() function.
hu_hu: Az üzemmód magas CPU-használatot eredményezhet! Kerüli a delayMillis() funkció használatát.
ko: 이 모드는 CPU 사용량이 높아질 수 있습니다! delayMillis() 함수 사용을 피합니다.
sv_se: Detta läge kan resultera i hög CPU-användning! Det undviker användningen av delayMillis()-funktionen.

source: Max frames per second limit
hu_hu: Maximum képkocka másodpercenként
ko: 초당 최대 프레임 제한
sv_se: Maximal gräns för bildrutor per sekund

source: This mode targets a maximum of 120 fps. When disabled, the game targets 60 fps
hu_hu: Ez az üzemmód legfeljebb 120 kép/mp értéket céloz meg. Kikapcsolása esetén 60-at
ko: 이 모드는 최대 120fps를 목표로 합니다. 비활성화하면 게임은 60fps를 목표로 함
sv_se: Detta läge siktar på maximalt 120 bilder/s. När det är inaktiverat siktar spelet på 60 bilder/s

source: Disable McCoy's quick stamina drain
hu_hu: McCoy gyors stamina apadásának kikapcsolása
ko: McCoy의 빠른 스태미나 감소를 비활성화
sv_se: Inaktivera McCoys snabba uthållighetsförlust

source: When running, McCoy won't start slowing down as soon as the player stops clicking the mouse
hu_hu: Futás közben McCoy nem lassul le ha a játékos nem kattint az egérrel
ko: 실행 중 플레이어가 마우스 클릭을 멈추더라도 McCoy의 속도가 느려지지 않음
sv_se: Under springturer kommer McCoy inte att börja sakta ner så snart spelaren slutar klicka på musen

source: Show subtitles during text crawl
hu_hu: Feliratok megjelenítése szöveg becsúszás közben
ko: 텍스트 크롤링 중 자막 표시
sv_se: Visa undertexter under textkrypning

source: During the intro cutscene, show subtitles during the text crawl
hu_hu: A bevezető alatt becsúszó szöveg felett jelenítse meg a feliratokat
ko: 인트로 컷씬 중 텍스트 크롤링 중에 자막을 표시
sv_se: Under introns mellansekvens, visa undertexter under textkrypningen

source: Fix credits for voice actors
hu_hu: Szinkronszínész stáblista javítás
ko: 성우들의 크레딧 수정
sv_se: Korrigera eftertexter för röstskådespelare

source: Updates the end credits with corrected credits for the Spanish voice actors
hu_hu: Frissíti a stáblistát a Spanyol szinkronszínészek javított listájával
ko: 스페인어 성우들의 수정된 크레딧으로 엔딩 크레딧을 업데이트
sv_se: Uppdaterar eftertexterna med korrigerade eftertexter för de spanska röstskådespelarna

source: common shortcuts
hu_hu: gyakori gyorsbillentyűk
ko: 공통 단축키
sv_se: vanliga genvägar

source: main game shortcuts
hu_hu: fő játék gyorsbillentyűk
ko: 메인 게임 단축키
sv_se: genvägar för huvudspelet

source: KIA only shortcuts
hu_hu: csak KIA gyorsbillentyűk
ko: KIA 전용 단축키
sv_se: Genvägar endast för KIA

source: Walk / Look / Talk / Select / Shoot
hu_hu: Megy / Néz / Beszél / Választ / Lő
ko: 걷기 / 보기 / 말하기 / 선택하기 / 쏘기
sv_se: Gå / Titta / Prata / Välj / Skjut

source: Toggle combat
sv_se: Växla strid

source: Skip cutscene
hu_hu: Átvezető átugrása
ko: 컷씬 건너뛰기
sv_se: Hoppa över mellansekvens

source: Skip dialog
sv_se: Hoppa över dialog

source: Game options
sv_se: Spelalternativ

source: Open KIA database
sv_se: Öppna KIA-databas

source: Delete selected saved game
sv_se: Ta bort markerat sparat spel

source: Scroll up
hu_hu: Görgetés FEL
ko: 위로 스크롤
sv_se: Bläddra uppåt

source: Scroll down
hu_hu: Görgetés LE
ko: 아래로 스크롤
sv_se: Bläddra nedåt

source: Toggle clue privacy
sv_se: Växla sekretess för ledtrådar

source: Save game
hu_hu: Játék mentés
ko: 게임 저장
sv_se: Spara spel

source: Load game
hu_hu: Játék betöltés
ko: 게임 불러오기
sv_se: Läs in spel

source: Crime scene database
sv_se: Databas för brottsplats

source: Suspect database
sv_se: Databas över misstänkta

source: Clue database
sv_se: Databas för ledtrådar

source: Quit game
hu_hu: Kilépés játékból
ko: 게임 종료
sv_se: Avsluta spel

source: Are you sure you want to quit?
hu_hu: Biztosan ki szeretne lépni?
ko: 정말 종료하겠습니까?
sv_se: Är du säker på att du vill avsluta?

source: Your game is now Paused. Click OK to continue.
hu_hu: A játékmenet jelenleg áll. Nyomjon az OK-ra a folytatáshoz.
ko: 이제 게임이 일시 중지되었습니다. 계속하려면 확인을 클릭하세요.
sv_se: Ditt spel är nu pausat. Tryck OK för att fortsätta.

source: Skip support
hu_hu: Átugrás támogatás
ko: 지원 건너뛰기
sv_se: Stöd för att hoppa över

source: Allow cutscenes to be skipped
hu_hu: Átvezetők átugrásának támogatása
ko: 컷씬 건너뛰기 허용
sv_se: Tillåt att mellansekvenser hoppas över

source: Cutscene keymappings
sv_se: Kortkommandon för mellansekvens

source: Main menu keymappings
sv_se: Kortkommandon för huvudmeny

source: Inventory keymappings
sv_se: Kortkommandon för inventarier

source: Select / Interact
sv_se: Välj / Interagera

source: Control key
sv_se: Control-tangent

source: Quit to main menu
sv_se: Avsluta till huvudmenyn

source: Look up
hu_hu: Felfelé néz
ko: 위를 보기
sv_se: Titta upp

source: Look down
hu_hu: Lefelé néz
ko: 아래를 보기
sv_se: Titta ner

source: Look left
sv_se: Titta åt vänster

source: Look right
sv_se: Titta åt höger

source: Move forward
hu_hu: Menj tovább
sv_se: Flytta framåt

source: Replay last AI comment
sv_se: Spela upp senaste AI-kommentaren igen

source: Biochip blank
sv_se: Biochip tom

source: Biochip evidence
sv_se: Biochip bevis

source: Biochip files
sv_se: Biochip filer

source: Biochip interface
sv_se: Biochip gränssnitt

source: Biochip jump
sv_se: Biochip hoppa

source: Biochip translate
sv_se: Biochip översätt

source: Show points
sv_se: Visa punkter

source: ScummVM found that you have saved games that should be converted from the original saved game format. The original saved game format is no longer supported directly, so you will not be able to load your games if you don't convert them. Press OK to convert them now, otherwise you will be asked again the next time you start the game.
hu_hu: A ScummVM olyan játékmentést talált, amelyet át kell alakítani az eredeti mentett játékformátumból. Az eredeti játékmentés formátum már közvetlenül nem támogatott, ezért a játékmentés nem töltődik be ha nem konvertálja azt. Nyomjon az OK-ra a konvertáláshoz most, különben a rendszer a játék következő indításakor újra megkérdezi.
ko: ScummVM에서 원래 저장된 게임 형식에서 변환해야 하는 게임이 저장되어 있음을 발견했습니다. 원래 저장된 게임 형식은 더 이상 직접 지원되지 않으므로 변환하지 않으면 게임을 불러올 수 없습니다. 확인을 눌러 지금 변환하세요. 그렇지 않으면 다음에 게임을 시작할 때 다시 묻습니다.
sv_se: ScummVM upptäckte att du har gamla spardata för Drascula som borde konverteras. Det gamla spardataformatet stöds inte längre, så du kommer inte kunna läsa in dina spel om du inte konverterar dem. Tryck på OK för att konvertera dem nu, annars kommer du tillfrågas igen nästa gång du startar spelet.

source: Saved game was created with a newer version of ScummVM. Unable to load.
hu_hu: A mentett játék a ScummVM egy újabb verziójával készült. Nem tölthető be.
ko: 저장된 게임은 최신 버전의 ScummVM으로 생성되었습니다. 불러올 수 없습니다.
sv_se: Sparat spel skapades med en nyare version av ScummVM. Kunde inte läsa in.

source: Color Blind Mode
hu_hu: Színvak Mód
ko: 색맹 모드
sv_se: Färgblint läge

source: Enable Color Blind Mode by default
hu_hu: Szinvak mód bekapcsolása alapértelmezettként
ko: 기본적으로 색맹 모드 활성화
sv_se: Aktivera färgblint läge som standard

source: Game Keymappings
hu_hu: Játék Gombkiosztás
ko: 게임 키맵핑
sv_se: Kortkommandon för spel

source: Exit / Skip
sv_se: Avsluta/Hoppa över

source: Game info
sv_se: Spelinformation

source: Quit prompt
sv_se: Avslutningsfråga

source: ALTered Item
hu_hu: MegvALToztatott Tárgy
ko: ALTered 아이템
sv_se: Ändrat (ALT) föremål

source: Inventory Item 1 (Select / Deselect)
sv_se: Inventarieobjekt 1 (Välj/avmarkera)

source: Inventory Item 2 (Select / Deselect)
sv_se: Inventarieobjekt 2 (Välj/avmarkera)

source: Inventory Item 3 (Select / Deselect)
sv_se: Inventarieobjekt 3 (Välj/avmarkera)

source: Inventory Item 4 (Select / Deselect)
sv_se: Inventarieobjekt 4 (Välj/avmarkera)

source: Inventory Item 5 (Select / Deselect)
sv_se: Inventarieobjekt 5 (Välj/avmarkera)

source: Inventory Item 6 (Select / Deselect)
sv_se: Inventarieobjekt 6 (Välj/avmarkera)

source: Inventory Item 7 (Select / Deselect)
sv_se: Inventarieobjekt 7 (Välj/avmarkera)

source: Inventory Item 8 (Select / Deselect)
sv_se: Inventarieobjekt 8 (Välj/avmarkera)

source: DEBUG: Access to location 1
sv_se: FELSÖK: Åtkomst till Plats 1

source: DEBUG: Access to locations 1-8
sv_se: FELSÖK: Åtkomst till Platserna 1-8

source: DEBUG: Access to locations 1-16
sv_se: FELSÖK: Åtkomst till Platserna 1-16

source: DEBUG: Access to locations 1-23
sv_se: FELSÖK: Åtkomst till Platserna 1-23
