Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: The 'fonts' folder is required to experience the text style as it was designed. The Steam release is known to be missing it. You can get the fonts from the demo version of the game.
hu_hu: A 'fonts' mappa szükséges, hogy az eredeti szöveg kinézetet tudja megjeleníteni. A Steam-es verzió hírhedt arról, hogy nem tartalmazza ezeket. A fontok beszerezhetőek a demo verzióból.
ko: 'fonts' 폴더는 디자인된 대로 텍스트 스타일을 경험하는 데 필요합니다. 스팀 버전에는 없는 것으로 알려져 있습니다. 게임의 데모 버전에서 글꼴을 얻을 수 있습니다.
sv_se: 'fonts'-mappen krävs för att uppleva textstilen så som den designades. Det är känt att Steam-versionen saknar detta. Du kan hämta typsnitten från demoversionen av spelet.

source: 'gui.ini' is recommended to get proper font settings for the game localization.
hu_hu: A 'gui.ini' szükséges a megfelelő lefordított betű megjelenítéshez.
ko: 게임 현지화에 적합한 글꼴 설정을 얻으려면 'gui.ini'를 사용하는 것이 좋습니다.
sv_se: 'gui.ini' är rekommenderad för att få korrekta typsnittsinställningar för spelöversättningen.

source: 'language.ini' is recommended to get localized confirmation dialogs.
hu_hu: A 'language.ini' ajánlott a lefordított megerősítő párbeszédpanelekhez.
ko: 현지화된 확인 대화 상자를 얻으려면 'language.ini'를 사용하는 것이 좋습니다.
sv_se: 'language.ini' rekommenderas för att få översatta bekräftelsedialoger.

source: 'game.exe' is recommended to get styled confirmation dialogs.
hu_hu: A 'game.exe' ajánlott a stilizált megerősítő párbeszédpanelekhez.
ko: 스타일이 적용된 확인 대화 상자를 얻으려면 'game.exe'를 사용하는 것이 좋습니다.
sv_se: 'game.exe' rekommenderas för att få bekräftelsedialoger med stilar.

source: Unable to locate the text for %s language in engine data file.
hu_hu: Nem sikerült megtalálni a %s nyelvet a motor adatfájlban.
ko: 엔진 데이터 파일에서 %s 언어에 대한 텍스트를 찾을 수 없습니다.
sv_se: Kunde inte hitta texten för språket %s i spelmotorns datafil.

source: Incorrect version of the '%s' engine data file found. Expected %d but got %d.
hu_hu: Hibás verziójú '%s' motor adatfájl. Az elvárt %d helyett ez %d található.
ko: '%s' 엔진 데이터 파일 버전이 잘못되었습니다. 필요한 버전:%d, 실제 버전: %d.
sv_se: Felaktig version av datafilen '%s' hittades. Version %d krävs, hittade %d.

source: Unable to find block for part %d
hu_hu: Nem található blokk a %d részhez
ko: %d 부분에 대한 블록을 찾을 수 없음
sv_se: Kunde inte hitta block för del %d

source: Unable to find '%s' in game folder or the engine data file.
hu_hu: Nem található '%s' a játék mappában vagy a motor adat fájlban.
ko: 게임 폴더나 엔진 데이터 파일에서 '%s'을(를) 찾을 수 없습니다.
sv_se: Kunde inte hitta '%s' i spelmappen eller spelmotorns datafil.

source: Failed to save temporary game state. Make sure your save game directory is set in ScummVM and that you can write to it.
hu_hu: Nem sikerült menteni az ideiglenes játékállást. Győződjön meg arról, hogy a játékmentési könyvtár a ScummVM-ben be van-e állítva, és van e írási joga.
ko: 임시 게임 상태 저장에 실패하였습니다. ScummVM에서 저장 게임 디렉터리가 설정되어 있고 여기에 쓸 수 있는지 확인하세요.
sv_se: Misslyckades med att spara temporärt speltillstånd. Säkerställ att din sparningskatalog är inställd i ScummVM och att du kan skriva till den.

source: Failed to load temporary game state.
hu_hu: Nem sikerült az ideiglenes játékállás betöltése.
ko: 임시 게임 상태를 불러오는 데 실패했습니다.
sv_se: Kunde inte läsa temporärt speltillstånd.

source: Improved mode
hu_hu: Továbbfejlesztett mód
ko: 개선된 모드
sv_se: Förbättrat läge

source: Removes some repetitive actions, adds possibility to change verbs by keyboard
hu_hu: Eltávolítja az ismétlődő műveleteket, lehetőséget ad az igék billentyűzettel történő megváltoztatására
ko: 일부 반복적인 작업을 제거하고,키보드로 버브를 변경할 수 있는 기능을 추가함
sv_se: Tar bort några repetitiva handlingar, lägger till möjlighet att ändra verb via tangentbordet

source: Improved mode keymappings
sv_se: Kortkommandon för förbättrat läge

source: Text reader keymappings
sv_se: Kortkommandon för textläsare

source: Computer keymappings
sv_se: Kortkommandon för dator

source: Perform default action
sv_se: Genomför standardhandling

source: Instructions
sv_se: Instruktioner

source: Text speed
sv_se: Texthastighet

source: Page up
sv_se: Sida upp

source: Page down
sv_se: Sida ner

source: Go
sv_se: Gå

source: Office manager
sv_se: Kontorschef

source: Phone
sv_se: Telefon

source: MPEG-2 cutscenes found but ScummVM has been built without MPEG-2 support
hu_hu: MPEG-2 átvezető található, de a ScummVM MPEG-2 támogatás nélkül lett lefordítva
ko: MPEG-2 컷씬이 발견되었지만 ScummVM은 MPEG-2 지원 없이 빌드되었음
sv_se: MPEG-2-mellansekvenser hittades men ScummVM har byggts utan stöd för MPEG-2

source: Cutscene '%s' not found
hu_hu: '%s' átvezető nem található
ko: '%s' 컷씬을 찾지 못 함
sv_se: Mellansekvensen '%s' hittades inte

source: ScummVM found that you have old saved games for Broken Sword 1 that should be converted. The old saved game format is no longer supported, so you will not be able to load your games if you don't convert them. Press OK to convert them now, otherwise you will be asked again the next time you start the game.
hu_hu: A ScummVM régi mentéseket talált a Broken Sword 1-hez, melyeket át kell konvertálni. A régi mentés formátuma már nem támogatott, így nem fogja tudni használni a régi mentéseket konvertálás nélkül. Nyomjon az OK-ra a konvertáláshoz, máskülönben a játék a következő indulásnál újra felteszi a kérdést.
ko: ScummVM에서 브로큰 소드 1에 대한 오래된 저장된 게임이 변환되어야 한다는 것을 발견했습니다. 오래된 저장된 게임 형식은 더 이상 지원되지 않으므로 변환하지 않으면 게임을 불러올 수 없습니다. 확인을 눌러 지금 변환하세요. 그렇지 않으면 다음에 게임을 시작할 때 다시 묻습니다.
sv_se: ScummVM upptäckte att du har gamla spardata för Broken Sword 1 som borde konverteras. Det gamla spardataformatet stöds inte längre, så du kommer inte kunna läsa in dina spel om du inte konverterar dem. Tryck på "OK" för att konvertera dem nu, annars kommer du tillfrågas igen nästa gång du startar spelet.

source: Target new saved game already exists! Would you like to keep the old saved game (%s) or the new one (%s)?
hu_hu: A választott játékmentés már létezik! Megtartja a régi játékmentést (%s) vagy kicseréli az újra (%s)?
ko: 새로 저장된 게임이 이미 존재합니다! 이전에 저장된 게임 (%s)와(과) 새 게임 (%s) 중 어느 것을 유지하겠습니까?
sv_se: Målet för det nya sparade spelet finns redan! Vill du behålla det gamla sparade spelet (%s) eller det nya (%s)?

source: Keep the old one
hu_hu: A régi megtartása
ko: 이전 것을 유지
sv_se: Behåll den gamla

source: Keep the new one
hu_hu: Az új megtartása
ko: 새 것을 유지
sv_se: Behåll den nya

source: This is the end of the Broken Sword 1 Demo
hu_hu: Ez a Broken Sword 1 Demo vége
ko: 이 브로큰 소드 1 데모는 끝났음
sv_se: Här slutar Broken Sword 1-demot

source: English
hu_hu: Angol
ko: 영어
sv_se: Engelska

source: German
hu_hu: Német
ko: 독일어
sv_se: Tyska

source: French
hu_hu: Francia
ko: 프랑스어
sv_se: Franska

source: Italian
hu_hu: Olasz
ko: 이탈리아어
sv_se: Italienska

source: Spanish
hu_hu: Spanyol
ko: 스페인어
sv_se: Spanska

source: Brazilian Portuguese
hu_hu: Brazil portugál
ko: 브라질 포르투갈어
sv_se: Braziliansk portugisiska

source: Czech
hu_hu: Cseh
ko: 체코어
sv_se: Tjeckiska

source: Text language:
hu_hu: Szöveg nyelve:
ko: 텍스트 언어:
sv_se: Textspråk:

source: Set the language for the subtitles. This will not affect voices.
hu_hu: Állítsa be a felirat nyelvét. Nincs hatással beszédhangokra.
ko: 자막 언어를 설정합니다. 음성에는 영향을 미치지 않습니다.
sv_se: Ställ in språket för undertexterna. Detta påverkar inte rösterna.

source: Simulate the audio engine from the Windows executable
hu_hu: A hangmotor szimulálása a Windows indítófájlból
ko: 윈도우 실행 파일에서 오디오 엔진 시뮬레이션
sv_se: Simulera ljudmotorn från den körbara Windows-filen

source: Makes the game use softer (logarithmic) audio curves, but removes fade-in and fade-out for sound effects, fade-in for music, and automatic music volume attenuation for when speech is playing
hu_hu: Finomabb (logaritmikus) hanggörbét fog használni használni, de eltávolítja a be- és kiúsztatás effekteket, beúszó zenét, valamint automatikus zene halkítást beszéd közben
ko: 게임에서 더 부드러운(대수적) 오디오 곡선을 사용하지만 사운드 효과의 페이드인 및 페이드아웃, 음악의 페이드인, 음성 재생 시 자동 음악 볼륨 감쇠 기능을 제거
sv_se: Spelet använder mjukare (logaritmiska) ljudkurvor, men tar bort intoning och uttoning för ljudeffekter, intoning för musik och automatisk dämpning av musikvolymen när tal spelas upp

source: Additional options:
hu_hu: Kiegészítő opciók:
ko: 추가 옵션:
sv_se: Ytterligare alternativ:

source: Main menu
sv_se: Huvudmeny

source: Remastered edition is not supported. Please, use the classic version
hu_hu: A Remastered kiadás nem támogatott. Kérem, használja a klasszikus verzót
ko: 리마스터 버전은 지원되지 않습니다. 클래식 버전 사용
sv_se: Remastrad utgåva stöds inte. Använd den klassiska versionen

source: Show object labels
hu_hu: Tárgy címkék láthatóak
ko: 개체 레이블 표시
sv_se: Visa objektetiketter

source: Show labels for objects on mouse hover
hu_hu: Mutassa a tárgyak címkéit ha fölé ér az egérrel
ko: 마우스 호버 시 개체 레이블을 표시
sv_se: Visar etiketter för objekten som musen pekar på

source: Use English speech
hu_hu: Angol beszédhang használata
ko: 영어 음성 사용
sv_se: Använd engelskt tal

source: Use English speech instead of German for every language other than German
hu_hu: Angol beszéd használata a Német helyett minden nyelven, a Németen kívül
ko: 독일어를 제외한 모든 언어에서는 독일어 대신 영어 음성을 사용
sv_se: Använd engelskt tal istället för tyska för alla språk utom tyska

source: Reveal all interactive hotspots (hold the key)
sv_se: Visa alla interaktiva hotspots (håll ned tangenten)

source: Move / Examine
sv_se: Flytta / Undersök

source: Close inventory
sv_se: Stäng inventarier

source: Run in interactive mode
sv_se: Kör i interaktionsläge

source: Correct movie aspect ratio
hu_hu: Megfelelő filmes képaránya
ko: 올바른 영화 화면비
sv_se: Korrigera bildförhållandet för film

source: Play Syberia cutscenes in 16:9, rather than stretching to full screen
hu_hu: Syberia átvezetők 16:9 képarányú lejátszása, teljes képernyőre nyújtás helyett
ko: 전체 화면으로 늘리는 대신, 16:9로 사이베리아 컷씬을 재생
sv_se: Spela upp Syberia-mellansekvenser i 16:9, snarare än att sträcka ut dem till helskärm

source: Restore missing scenes
hu_hu: Hiányzó jelenetek visszaállítása
ko: 누락된 장면 복원
sv_se: Återställ saknade scener

source: Restore some scenes originally in the Windows edition
hu_hu: A Windows kiadásban eredetileg megtalálható jelenetek visszaállítása
ko: 원래 윈도우즈 버전에서 일부 장면을 복원
sv_se: Återställ några scener som från början saknades i Windows-utgåvan

source: Saturn CD version is not yet supported
hu_hu: A Saturn CD verzió még nem támogatott
ko: 새턴 CD 버전은 아직 지원 안 함
sv_se: Saturn CD-version stöds inte än

source: Remove Black Bars
hu_hu: Fekete sávok eltávolítása
ko: 검은색 바 제거
sv_se: Ta bort svarta streck

source: The game originally renders at 640x432 which is then presented letterboxed at 640x480. Enabling this option removes the forced letterbox effect, so that the game fits better on screens with an aspect ratio wider than 4:3.
hu_hu: A játék eredetileg 640x432 felbontásban renderelődik, ami 640x480 felbontáson belül letterboxed formátumban középre van helyezve. Az opció bekapcsolásával megszűnteti ezt a letterboxed effektet, ezzel elősegítve a 4:3-asnál szélesebb képernyőkre való megfelelő illeszkedést.
ko: 게임은 원래 640x432로 렌더링한 다음 640x480으로 레터박스로 표시됩니다. 이 옵션을 활성화하면 강제 레터박스 효과가 제거되어 게임이 화면비가 4:3보다 넓은 화면에 더 잘 맞습니다.
sv_se: Spelet renderades från början i 640x432 vilket sedan visades i letterbox i 640x480. Om denna inställning aktiveras ta den påtvingade letterbox-effekten bort, så att spelet bättre passar på skärmar med ett bildförhållande bredare än 4:3.

source: Save/Load keymappings
hu_hu: Gombkiosztás Mentés/Betöltés
ko: 키맵핑 저장/불러오기
sv_se: Spara/Läs in kortkommandon

source: Page up in save / load menu
sv_se: Sida upp i spara/läs in-meny

source: Page down in save / load menu
sv_se: Sida ner i spara/läs in-meny

source: Go to start of save / load menu
sv_se: Gå till början av spara/läs in-meny

source: Go to end of save / load menu
sv_se: Gå till slutet av spara/läs in-meny

source: Discworld Noir needs ScummVM with TinyGL enabled
sv_se: Discworld Noir kräver ScummVM med TinyGL aktiverat

source: PET keymappings
sv_se: PET-kortkommandon

source: Real Life keymappings
sv_se: Kortkommandon för verkliga livet

source: Inventory shortcut
sv_se: Genväg för inventarier

source: Continue game dialogue keymappings
sv_se: Kortkommandon för fortsätt speldialog

source: Star Map keymappings
sv_se: Kortkommandon för Star Map

source: Movement keymappings
sv_se: Kortkommandon för förflyttning

source: Select / Interact / Move
sv_se: Välj / Interagera / Flytta

source: Select / Interact / Quick move
sv_se: Välj / Interagera / Snabb förflyttning

source: Cheat menu
sv_se: Fuskmeny

source: Conversation
sv_se: Konversation

source: Remote
sv_se: Fjärrkontroll

source: Rooms
sv_se: Rum

source: Real life
sv_se: Verkliga livet

source: Scroll up page
sv_se: Rulla upp sida

source: Scroll down page
sv_se: Rulla ner sida

source: Scroll to top
sv_se: Rulla överst

source: Scroll to bottom
sv_se: Rulla nederst

source: Translation
sv_se: Översättning

source: Toggle between Star Map and photo of your home
sv_se: Växla mellan Star Map och foto på ditt hem

source: Stop moving
sv_se: Stanna förflyttning

source: Lock coordinate
sv_se: Lås koordinat

source: Unlock coordinate
sv_se: Lås upp koordinat

source: View constellations
sv_se: Visa konstellationer

source: View boundaries
sv_se: Visa gränser

source: Move / Select
sv_se: Flytta / Välj

source: Move / Perform default action
sv_se: Flytta / Utför standardåtgärd

source: Skip ride
sv_se: Hoppa över åktur

source: Font variant not present in '%s' engine data file.
hu_hu: Betűtípus variáns nincs jelen a '%s' motor adatfájlban.
ko: '%s' 엔진 데이터 파일에 글꼴 변형이 없습니다.
sv_se: Typsnittsvarianten finns inte i datafilen '%s'.

source: Stop current voice
hu_hu: Aktuális hang leállítása
ko: 현재 음성 중지
sv_se: Stoppa aktuell röst

source: Mute music
hu_hu: Zene némítása
ko: 음악 음소거
sv_se: Ingen musik

source: Mute speech
hu_hu: Beszédhang némítása
ko: 말 음소거
sv_se: Inget tal

source: Mute sound effects
hu_hu: Hangeffektek némítása
ko: 사운드 효과 음소거
sv_se: Inga ljudeffektier

source: Saved game in slot #%d
hu_hu: Játék mentve a #%d slotba
ko: 슬롯 #%d에 게임 저장됨
sv_se: Sparade spel på plats #%d

source: Could not quick save into slot #%d
hu_hu: Gyorsmentés nem sikerült a #%d slotba
ko: 슬롯 #%d에 빠른 저장하지 못함
sv_se: Det gick inte att snabbspara på plats #%d

source: Saved game #%d quick loaded
hu_hu: A #%d mentés gyorsbetöltésre került
ko: 저장된 게임 #%d 빠르게 불러옴
sv_se: Sparat speldata #%d snabbinlästes

source: Could not quick load the saved game #%d
hu_hu: A #%d mentést nem lehetett gyorstölteni
ko: 저장된 게임 #%d 빠르게 불러올 수 없음
sv_se: Det gick inte att snabbinläsa sparat spel #%d

source: Are you sure you want to exit?
hu_hu: Biztosan ki akar lépni?
ko: 정말 종료하겠습니까?
sv_se: Är du säker på att du vill avsluta?

source: Unable to locate the '%s' data file.
hu_hu: Nem található a '%s' adatfájl.
ko: '%s' 데이터 파일을 찾을 수 없습니다.
sv_se: Kunde inte hitta datafilen '%s'.

source: Copy protection
sv_se: Kopieringsskydd

source: Disable scene transitions
sv_se: Inaktivera scenövergångar

source: Disable original transition effects between scenes
sv_se: Inaktivera ursprungliga övergångseffekter mellan scener

source: Original save/load dialog
sv_se: Ursprunglig dialog för spara / läsa in

source: Use original save and load dialogs
sv_se: Använd originaldialoger för spara/läsa in

source: Default action
sv_se: Standardhandling

source: Save and load game
sv_se: Spara och läs in spel

source: Main menu/Exit
sv_se: Huvudmeny/Avsluta

source: Skip sequence / open quit dialog
sv_se: Hoppa över sekvens/öppna avslutningsdialog

source: Enable fast walk
hu_hu: Gyors séta bekapcsolása
ko: 빠른 걷기 활성화
sv_se: Aktivera snabb gång

source: Disable fast walk
hu_hu: Gyors séta kikapcsolása
ko: 빠른 걷기 비활성화
sv_se: Inaktivera snabb gång

source: Toggle between voice / text / text and voice
sv_se: Växla mellan röst/text/text och röst

source: Press "Yes" Key
hu_hu: "Igen" gomb megnyomása
ko: "예" 키를 누름
sv_se: Tryck på "Ja"-tangenten

source: Toggle fast walk
hu_hu: Gyors séta kapcsoló
ko: 빠른 대화 전환
sv_se: Växla snabb gång

source: Open system menu
hu_hu: Rendszer menü megnyitása
ko: 시스템 메뉴 열기
sv_se: Öppna systemmeny

source: View Help
hu_hu: Segítség megtekintése
ko: 도움말 보기
sv_se: Visa hjälp

source: Sound options
hu_hu: Hang opciók
ko: 사운드 옵션
sv_se: Ljudalternativ

source: Crawl North
hu_hu: Mászás Északra
ko: 북쪽으로 기어가기
sv_se: Kryp norrut

source: Crawl South
hu_hu: Mászás Délre
ko: 남쪽으로 기어가기
sv_se: Kryp söderut

source: Turn left / Crawl West
sv_se: Sväng vänster/kryp västerut

source: Turn right / Crawl East
sv_se: Sväng höger/kryp österut

source: Increase speed
hu_hu: Sebesség növelése
ko: 속도 증가
sv_se: Öka hastighet

source: Decrease speed
hu_hu: Sebesség csökkentése
ko: 속도 감소
sv_se: Sänk hastighet

source: Minimum speed
hu_hu: Alsó sebesség határ
ko: 최소 속도
sv_se: Minsta hastighet

source: Maximum speed
hu_hu: Felső sebesség határ
ko: 최대 속도
sv_se: Högsta hastighet

source: Low speed
hu_hu: Alacsony sebesség
ko: 낮은 속도
sv_se: Låg hastighet

source: Medium speed
hu_hu: Közepes sebesség
ko: 중간 속도
sv_se: Medelhastighet

source: Draw Cards
hu_hu: Kártya húzás
ko: 카드 뽑기
sv_se: Dra kort

source: Skip speech
hu_hu: Beszéd átugrás
ko: 말 건너뛰기
sv_se: Hoppa över tal

source: Toggle panel style
hu_hu: Ablak stílus kapcsoló
ko: 패널 스타일 전환
sv_se: Växla panelstil

source: Toggle text speech
hu_hu: Szöveg beszéd kapcsoló
ko: TTS
sv_se: Växla texttal

source: This version requires Giflib which was not compiled into ScummVM
hu_hu: Ehhez a verzióhoz Giflib szükséges, ami nincs befordítva a ScummVM-be
ko: 이 버전에는 ScummVM에 컴파일되지 않은 Giflib이 필요함
sv_se: Denna version kräver Giflib vilket inte kompilerats in i ScummVM

source: Enable wall collisions
hu_hu: Falba ütközések engedélyezése
ko: 벽 충돌 활성화
sv_se: Aktivera väggkollisioner

source: Enable the original wall collision damage
hu_hu: Engedélyezi az eredeti falütközési sérülést
ko: 벽 충돌시 받는 손상 활성화
sv_se: Aktivera originalskada från väggkollisioner

source: Disable save menu
hu_hu: Mentés menü letiltás
ko: 저장 메뉴 비활성화
sv_se: Inaktivera sparningsmeny

source: The original only had autosaves. This allows you to save whenever you want.
hu_hu: Az eredetiben csak automatikus mentés található. Ez lehetővé teszi, hogy mentsen amikor akar.
ko: 원본 게임에는 자동 저장만 존재했습니다. 이 옵션은 언제든 저장할 수 있게 해 줍니다.
sv_se: Originalet hade bara autosparningar. Detta låter dig spara när du vill.

source: Enable debug mode
hu_hu: Hibakereső mód engedélyezve
ko: 디버그 모드 활성화
sv_se: Aktivera felsökningsläge

source: Enable the debug mode
hu_hu: Hibakereső Mód engedélyezése
ko: 디버그 모드를 활성화
sv_se: Aktivera felsökningsläget

source: Enable sound
hu_hu: Hang engedélyezve
ko: 사운드 활성화
sv_se: Aktivera ljud

source: Enable the sound for the game
hu_hu: Engedélyezi a játék hangját
ko: 게임의 사운드를 활성화
sv_se: Aktivera ljudet för spelet

source: Enable text
hu_hu: Szöveg engedélyezése
ko: 텍스트 활성화
sv_se: Aktivera text

source: Enable the text for the game
hu_hu: Engedélyezi a játék feliratait
ko: 게임의 텍스트를 활성화
sv_se: Aktivera texten för spelet

source: Enable movies
hu_hu: Átvezetők engedélyezve
ko: 동영상 활성화
sv_se: Aktivera filmer

source: Enable the cutscenes for the game
hu_hu: Engedélyezi a játék átvezető jeleneteit
ko: 게임의 컷씬을 활성화
sv_se: Aktivera mellansekvenser för spelet

source: Enable mouse
hu_hu: Egér engedélyezve
ko: 마우스 활성화
sv_se: Aktivera mus

source: Enable the mouse for the UI
hu_hu: Engedélyezi az egér használatát a játékban
ko: UI에 마우스를 활성화
sv_se: Aktivera musen för gränssnittet

source: Use the USA version
hu_hu: USA verzió használata
ko: 미국 버전 사용
sv_se: Använd USA-versionen

source: Enable the USA specific version flags
hu_hu: Engedélyezi az USA-specifikus verziójelzőket
ko: 미국 특정 버전 플래그를 활성화
sv_se: Aktivera USA-specifika versionsflaggor

source: Enable high resolution
hu_hu: Nagy felbontás engedélyezése
ko: 고해상도 활성화
sv_se: Aktivera hög upplösning

source: Enable a higher resolution for the game
hu_hu: Nagyobb felbontás engedélyezése a játékhoz
ko: 게임의 고해상도 지원을 활성화
sv_se: Aktivera en högre upplösning för spelet

source: Debug grid camera up
sv_se: Felsökning: rutnätskamera uppåt

source: Debug grid camera down
sv_se: Felsökning: rutnätskamera nedåt

source: Debug grid camera left
sv_se: Felsökning: rutnätskamera vänster

source: Debug grid camera right
sv_se: Felsökning: rutnätskamera höger

source: Normal behavior
sv_se: Normalt beteende

source: Athletic behavior
sv_se: Atletiskt beteende

source: Aggressive behavior
sv_se: Aggressivt beteende

source: Discreet behavior
sv_se: Diskret beteende

source: Behavior action
sv_se: Beteendehandling

source: Change behavior
sv_se: Ändra beteende

source: Use selected object
sv_se: Använd valt objekt

source: Throw magic ball
sv_se: Kasta magisk boll

source: Use Protopack
hu_hu: Protopack használata
ko: 프로토팩을 사용
sv_se: Använd Protopack

source: Open Holomap
hu_hu: Holomap megnyitása
ko: 홀로맵을 열기
sv_se: Öppna Holokarta

source: Special action
sv_se: Specialhandling

source: Scenery zoom
sv_se: Landskapszoom

source: Previous location
hu_hu: Előző hely
ko: 이전 위치
sv_se: Föregående plats

source: Next location
hu_hu: Következő hely
ko: 다음 위치
sv_se: Nästa plats

source: Toilet paper over
hu_hu: Elfogyott wc-papír
ko: 용지 걸림 표시
sv_se: Toalettpapper över

source: The toilet paper in some toilets will be shown "over". It's a joke option that has no effects on the gameplay.
hu_hu: A wc-papír egyes helyeken "elfogyott" kiírást fog jelezni. Ez egy vicces opció, amely nincs hatással a játékmenetre.
ko: 일부 화장실의 종이가 "over"로 표시됩니다. 게임 플레이에 아무런 영향을 미치지 않는 농담 옵션입니다.
sv_se: Toalettpapperet i vissa toaletter kommer att visas "över". Det är ett skämtsamt alternativ som inte har någon effekt på spelet.

source: Annoying in-jokes
hu_hu: Idegesítő belső poénok
ko: 짜증나는 사적 농담
sv_se: Irriterande interna skämt

source: The game will include in-jokes and references to past adventure games, in the form of both dialogues and objects. There is a game achievement that can be obtained only if the in-jokes option is switched on.
hu_hu: A játékban meg fognak jelenni belső poénok és utalások korábbi kalandjátékokra dialógusok és tárgyak formájában. Van olyan játék teljesítmény, ami csak ennek a bekapcsolásával oldható fel.
ko: 이 게임에는 대화와 개체의 형태로 과거 어드벤처 게임에 대한 사적 농담과 참조가 포함됩니다. 사적 농담 옵션이 켜져 있어야만 얻을 수 있는 게임 도전과제가 있습니다.
sv_se: Spelet kommer att innehålla skämt och referenser till tidigare äventyrsspel, både i form av dialoger och föremål. Det finns en spelprestation som endast kan erhållas om alternativet med skämt är aktiverat.

source: Controls:
hu_hu: Irányitás:
ko: 제어:
sv_se: Kontroller:

source: Invert verb colors
hu_hu: Ige színek invertálása
ko: 버브 색상 반전
sv_se: Invertera verbfärger

source: Retro Fonts
hu_hu: Retró Betűtípusok
ko: 레트로 글꼴
sv_se: Retrotypsnitt

source: Retro Verbs
hu_hu: Retró Igék
ko: 레트로 버브
sv_se: Retroverb

source: Classic Sentence
hu_hu: Klasszikus Mondat
ko: 고전적인 문장
sv_se: Klassisk mening

source: Select highlighted verb
hu_hu: Kiemelt ige kiválasztása
ko: 강조된 버브를 선택
sv_se: Välj färgmarkerat verb

source: Go to previous object
hu_hu: Vissza az előző tárgyhoz
ko: 이전 개체로 이동
sv_se: Gå till föregående objekt

source: Go to next object
hu_hu: Tovább a következő tárgyhoz
ko: 다음 개체로 이동
sv_se: Gå till nästa objekt

source: Select verb / item left
sv_se: Välj verb/objekt vänster

source: Select verb / item right
sv_se: Välj verb/objekt höger

source: Select verb / item up
sv_se: Välj verb/objekt upp

source: Select verb / item down
sv_se: Välj verb/objekt ner

source: Select actor 1
sv_se: Välj skådespelare 1

source: Select actor 2
sv_se: Välj skådespelare 2

source: Select actor 3
sv_se: Välj skådespelare 3

source: Select actor 4
sv_se: Välj skådespelare 4

source: Select actor 5
sv_se: Välj skådespelare 5

source: Select choice 1
sv_se: Välj val 1

source: Select choice 2
sv_se: Välj val 2

source: Select choice 3
sv_se: Välj val 3

source: Select choice 4
sv_se: Välj val 4

source: Select choice 5
sv_se: Välj val 5

source: Select choice 6
sv_se: Välj val 6

source: Select next Actor
sv_se: Välj nästa skådespelare

source: Select previous actor
sv_se: Välj föregående skådespelare
