Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: Brighten the graphics to simulate a Macintosh monitor.
hu_hu: A Macintosh monitorhoz hasonló világos képet szimulál.
ko: 매킨토시 모니터를 시뮬레이션하기 위해 그래픽을 밝게 합니다.
sv_se: Ljusa upp grafiken för att simulera en Macintosh-skärm.

source: Simulate Sega colors
hu_hu: Sega színek szimulálása
ko: 세가 컬러 시뮬레이트
sv_se: Simulera Sega-färger

source: Instead of using the colors defined in the game, simulate colors used on actual Sega hardware. These are significantly darker, though it's unclear if that was intended or not.
hu_hu: A játék által definiált színek helyett, Sega hardver alapú szín emulációt használ. Ezek jelentősen sötétebbek, és nem teljesen egyértelmű, hogy ez szándékos-e.
ko: 게임에서 정의된 색상을 사용하는 대신 실제 세가 하드웨어에서 사용되는 색상을 시뮬레이션합니다. 이는 상당히 어둡지만 의도한 것인지 아닌지는 불분명합니다.
sv_se: Istället för att använda de färger som definieras i spelet, simulerar man färger som används på verklig Sega-hårdvara. Dessa är betydligt mörkare, men det är oklart om det var avsikten eller inte.

source: Overture Timing:
hu_hu: Nyitány időzítése:
ko: 서곡 타이밍:
sv_se: Timing för ouvertyr:

source: When using replacement music, this adjusts the time when the Overture changes to the scene with the Lucasfilm and Loom logotypes.
hu_hu: Hogy ha kicseréli az eredeti zenét, ez az érték fogja meghatározni, hogy pontosan mikor megy át a jelenet a Lucasarts és Loom logokhoz.
ko: 대체 음악을 사용할 경우, 서곡이 루카스필름과 룸 로고가 있는 장면으로 바뀌는 시간을 조정합니다.
sv_se: När du använder ersättningsmusik justerar detta tiden när ouvertyren ändras till scenen med logotyperna Lucasfilm och Loom.

source: Music Quality:
hu_hu: Zene Minőség:
ko: 음악 품질:
sv_se: Musikkvalitet:

source: Select music quality. The original lets you choose this from the Game menu.
hu_hu: Válassza ki a zene minőséget. Az eredeti lehetővé teszi ezt a játék menüből.
ko: 음악 품질을 선택하세요. 원본은 게임 메뉴에서 선택할 수 있습니다.
sv_se: Välj musikkvalitet. I originalet kan du välja detta från spelmenyn.

source: Select music quality. The original determines the basic setup by hardware detection and speed tests, but also allows changes through the Game menu to some degree.
hu_hu: Válassza ki a zene minőséget. Eredetileg ez egy hardveres vizsgálat alapján állítódott be, de ez bizonyos szintig játékon belül is állítható.
ko: 음악 품질을 선택합니다. 원본은 하드웨어 감지 및 속도 테스트를 통해 기본 설정을 결정하지만 게임 메뉴를 통해 어느 정도 변경할 수도 있습니다.
sv_se: Välj musikkvalitet. Originalet fastställer grundinställningarna genom hårdvaruidentifiering och hastighetstester, men tillåter också ändringar via spelmenyn i viss utsträckning.

source: auto
hu_hu: automata
ko: 자동
sv_se: automatiskt

source: Low
hu_hu: Alacsony
ko: 낮음
sv_se: Låg

source: Medium
hu_hu: Közepes
ko: 중간
sv_se: Medel

source: High
hu_hu: Magas
ko: 높은
sv_se: Hög

source: Good
hu_hu: Jó
ko: 좋음
sv_se: Bra

source: Better
hu_hu: Jobb
ko: 더 좋음
sv_se: Bättre

source: Hardware Rating: %s -
hu_hu: Hardver Érték: %s -
ko: 하드웨어 등급: %s -
sv_se: Hårdvarubetyg: %s -

source: Quality Selection: %s
hu_hu: Minőség Kiválasztása: %s
ko: 품질 선택: %s
sv_se: Kvalitetsval: %s

source: Playback Adjust:
hu_hu: Lejátszás hangolás:
ko: 재생 조정:
sv_se: Uppspelningsjustering:

source: When playing sound from the CD audio track, adjust the start position of the sound by this much. Use this if you often hear bits of the wrong sound.
hu_hu: Ha hangot játszik le a CD hangsávjáról, igazítsa át ennyivel a hang kezdőpozícióját. Használja ezt, ha gyakran nem megfelelő hangot hall.
ko: CD 오디오 트랙에서 사운드를 재생할 때, 사운드의 시작 위치를 이만큼 조정합니다. 잘못된 사운드의 비트를 자주 듣는 경우 이 옵션을 사용합니다.
sv_se: När du spelar upp ljud från cd-ljudspåret kan du justera ljudets startposition så här mycket. Använd detta om du ofta hör bitar av fel ljud.

source: Intro Adjust:
hu_hu: Bevezető hangolás:
ko: 인트로 조정:
sv_se: Introjustering:

source: When playing the intro track, play from this point in it. Use this if the music gets cut off prematurely, or if you are unhappy with the way the music syncs up with the intro.
hu_hu: A bevezető szám lejátszásakor kezdje a lejátszást ettől a ponttól. Használja ezt, ha a zene idő előtt megszakad, vagy ha elégedetlen azzal, ahogyan a zene illeszkedik a bevezetőhöz.
ko: 인트로 트랙을 재생할 때는 이 지점부터 재생합니다. 음악이 일찍 끊어지거나, 음악이 인트로와 동기화되는 방식에 만족하지 못하는 경우 이 옵션을 사용합니다.
sv_se: När du spelar upp introspåret, spela från denna punkt i det. Använd detta om musiken avbryts i förtid, eller om du inte är nöjd med hur musiken synkroniseras med introt.

source: Outlook Adjust:
hu_hu: Kilátás zene hangolás:
ko: 전망 조정:
sv_se: Utsiktsjustering:

source: The outlook music is part of the intro track. Adjust the position in the track at which it starts playing. Use this if the music is cut off, or if you hear part of the previous music.
hu_hu: A kilátás zene a bevezető dal része. Állítsa be a zeneszám pozícióját, ahol a lejátszás elkezdődik. Használja ezt, ha a zene vége levágásra kerül, vagy ha az előző zene még mindig hallatszik.
ko: 전망 음악은 인트로 트랙의 일부입니다. 트랙에서 재생이 시작되는 위치를 조정합니다. 음악이 끊어지거나 이전 음악의 일부가 들리는 경우 이 기능을 사용합니다.
sv_se: Utsiktsmusiken är en del av introspåret. Justera positionen i spåret där den börjar spelas. Använd detta om musiken avbryts eller om du hör en del av den föregående musiken.

source: Load modded audio
hu_hu: Módosított hang betöltése
ko: 개조된 오디오 불러오기
sv_se: Läs in modifierat ljud

source: Replace music, sound effects, and speech clips with modded audio files, if available.
hu_hu: Cserélje ki a zenét, az effektusokat és a beszédklipeket módosított hangfájlokra, ha rendelkezésre állnak.
ko: 가능하다면, 음악, 사운드 효과, 음성 클립을 수정된 오디오 파일로 교체하세요.
sv_se: Ersätt musik, ljudeffekter och talklipp med modifierade ljudfiler, om sådana finns tillgängliga.

source: Multiplayer Server:
hu_hu: Többjátékos Szerver:
ko: 멀티플레이어 서버:
sv_se: Flerspelarserver:

source: Address of the server to connect to for online play. It must start with either "https://" or "http://" schemas.
hu_hu: Annak a szervernek a címe, amelyhez online játékhoz csatlakozni kell. „https://” vagy „http://” sémával kell kezdődnie.
ko: 온라인 플레이를 위해 연결할 서버의 주소입니다. "https://" 또는 "http://" 스키마로 시작해야 합니다.
sv_se: Adress till den server som du ska ansluta till för onlinespel. Den måste börja med antingen "https://" eller "http://".

source: Enable online competitive mods
hu_hu: Online kompetitív módok engedélyezése
ko: 온라인 경쟁 개조 활성화
sv_se: Aktivera konkurrensmodifieringar online

source: Enables custom-made modifications intended for online competitive play.
hu_hu: Engedélyezi a kompetitív játékhoz készült külső modokat.
ko: 온라인 경쟁 플레이에 맞춰 맞춤형 수정이 가능합니다.
sv_se: Aktiverar skräddarsydda modifieringar avsedda för tävlingsspel online.

source: Enable connection to Multiplayer Server
hu_hu: Kapcsolódás engedélyezése a többjátékos szerverhez
ko: 멀티플레이어 서버 연결 활성화
sv_se: Aktivera anslutning till flerspelarserver

source: Toggles the connection to the server that allows hosting and joining online multiplayer games over the Internet.
hu_hu: Bekapcsolja a kapcsolatot a szerverrel, amely lehetővé teszi az online többjátékos játékok fogadását és csatlakozását az interneten keresztül.
ko: 인터넷을 통해 온라인 멀티플레이어 게임을 호스팅하고 참여할 수 있는 서버와의 연결을 전환합니다.
sv_se: Växlar anslutningen till den server som gör det möjligt att vara värd för och delta i online flerspelarspel över Internet.

source: Host games over LAN
hu_hu: Játékok hosztolása helyi hálózaton keresztül
ko: LAN을 통한 게임 호스팅
sv_se: Stå värd för spel över LAN

source: Allows the game sessions to be discovered over your local area network.
hu_hu: Lehetővé teszi a játékmenetek felfedezését a helyi hálózaton keresztül.
ko: 로컬 영역 네트워크를 통해 게임 세션을 검색할 수 있습니다.
sv_se: Gör att spelsessionerna kan upptäckas via ditt lokala nätverk.

source: Generate random maps
hu_hu: Véletlenszerű pályák generálása
ko: 무작위 지도 생성
sv_se: Generera slumpmässiga kartor

source: Allow random map generation (Based from Moonbase Console).
hu_hu: A véletlenszerű pályák generálásának engedélyezése (a Holdbázis Konzolon keresztül).
ko: 무작위 맵 생성을 허용합니다 (Moonbase 콘솔 기반).
sv_se: Tillåt slumpmässig kartgenerering (baserat på Moonbase Console).

source: Address of the server to connect to for hosting and joining online game sessions.
hu_hu: Azon szerver ip cím, amihez lehet csatlakozni hosztolás vagy belépés célból.
ko: 온라인 게임 세션을 호스팅하고 참여하기 위해 연결할 서버의 주소입니다.
sv_se: Adress till den server som du ska ansluta till för att vara värd för och delta i spelsessioner online.

source: Common keyboard commands:
hu_hu: Általános billentyű-parancsok:
ko: 공통적으로 사용되는 키보드 명령:
sv_se: Vanliga kortkommandon:

source: Save / Load dialog
hu_hu: Mentés / Betöltés párbeszéd
ko: 저장 / 불러오기 대화 상자
sv_se: Spara / Läs in-dialog

source: Selection screen
hu_hu: Kiválasztó képernyő
ko: 선택 화면
sv_se: Valskärm

source: Skip line of text
hu_hu: Szövegsor átugrása
ko: 대사 한 줄을 건너뜀
sv_se: Hoppa över textrad

source: Space
hu_hu: Szóköz
ko: Space 키
sv_se: Mellanslag

source: Load saved game 1-10
hu_hu: 1-10 Játékállás betöltése
ko: 저장된 게임 1-10 번에서 불러오기
sv_se: Läs in spardata 1-10

source: Save game 1-10
hu_hu: 1-10 Játékállás mentése
ko: 게임 1-10 번에 저장
sv_se: Spara spardata 1-10

source: Music volume up / down
hu_hu: Zene hangerő fel / le
ko: 음악 볼륨 높임 / 줄임
sv_se: Musikvolym höj / sänk

source: Text speed slower / faster
hu_hu: Szövegsebesség gyorsabb / lassabb
ko: 대사 속도 느리게 / 빠르게
sv_se: Texthastighet sänk / öka

source: Simulate left mouse button
hu_hu: Bal egérgomb szimuláció
ko: 왼쪽 마우스 버튼을 시뮬레이트
sv_se: Simulera vänster musknapp

source: Simulate right mouse button
hu_hu: Jobb egérgomb szimuláció
ko: 오른쪽 마우스 버튼을 시뮬레이트
sv_se: Simulera höger musknapp

source: Special keyboard commands:
hu_hu: Speciális billentyű-parancsok:
ko: 특수 키보드 명령:
sv_se: Speciella kortkommandon:

source: Show / Hide console
hu_hu: Konzol megjelenítés / elrejtés
ko: 콘솔을 보이기/숨기기
sv_se: Visa / dölj konsol

source: Start the debugger
hu_hu: Hibakereső indítása
ko: 디버거를 시작
sv_se: Starta felsökaren

source: Run in fast mode (*)
hu_hu: Futtatás gyors módban (*)
ko: 빠른 모드 (*)로 실행
sv_se: Kör i snabbläge (*)

source: Run in really fast mode (*)
hu_hu: Futtatás nagyon gyors módban (*)
ko: 매우 빠른 모드 (*)로 실행
sv_se: Kör i extra snabbt läge (*)

source: Cycle between graphics filters
hu_hu: Grafikus filterek közötti váltás
ko: 그래픽 필터 간 주기
sv_se: Växla mellan grafikfilter

source: Increase / Decrease scale factor
hu_hu: Lépték növelés / csökkentés
ko: 크기 조정 요소를 늘리기 / 줄이기
sv_se: Öka / sänk skalningsfaktor

source: Toggle aspect-ratio correction
hu_hu: Méretarány korrekció kapcsoló
ko: 화면비 교정 전환
sv_se: Växla korrigering av bildförhållande

source: * Note that using ctrl-f and
hu_hu: * Megjegyzés, a ctrl-f és
ko: * Ctrl+F와 Ctrl+G는 충돌이나
sv_se: * Observera att användning av ctrl-f

source: ctrl-g are not recommended
hu_hu: ctrl-g használata nem javasolt
ko: 게임 작동에 문제를 일으킬 수
sv_se: och ctrl-g inte rekommenderas

source: since they may cause crashes
hu_hu: mert rendszerösszeomlást vagy
ko: 사용하지 않는 것이
sv_se: då detta kan orsaka krascher

source: or incorrect game behavior.
hu_hu: vagy hibás játékműködést eredményez.
ko: 좋습니다.
sv_se: eller felaktigt spelbeteende.

source: Spinning drafts on the keyboard:
hu_hu: Forgó hangjegyek a billentyűzeten:
ko: 키보드에서 초안을 회전:
sv_se: Väva melodier med tangentbordet:

source: Main game controls:
hu_hu: Fő játékvezérlők:
ko: 메인 게임 조작:
sv_se: Huvudkontroller:

source: Pull
hu_hu: Húz
ko: 당기기
sv_se: Dra

source: Go to
hu_hu: Menj
ko: 가기
sv_se: Gå till

source: Read
hu_hu: Olvas
ko: 읽기
sv_se: Läs

source: New kid
hu_hu: Új gyerek
ko: 새 캐릭터
sv_se: Ny unge

source: Turn on
hu_hu: Bekapcsol
ko: 켜기
sv_se: Sätt på

source: Turn off
hu_hu: Kikapcsol
ko: 끄기
sv_se: Stäng av

source: What is
hu_hu: Mi ez
ko: 조사하기
sv_se: Vad är

source: Put on
hu_hu: Felvesz
ko: 쓰기
sv_se: Ta på

source: Take off
hu_hu: Letesz
ko: 벗기
sv_se: Ta av

source: Fix
hu_hu: Javít
ko: 고치기
sv_se: Laga

source: Switch
hu_hu: Kapcsol
ko: 전환하기
sv_se: Byt

source: To Henry / To Indy
hu_hu: Henrynek / Indynek
ko: 헨리에게 / 인디에게
sv_se: Till Henry / Till Indy

source: play C minor on distaff
hu_hu: C moll a guzsalyon
ko: 실패로 C 단조를 연주
sv_se: spela C-moll på staven

source: play D on distaff
hu_hu: D hang a guzsalyon
ko: 실패로 D를 연주
sv_se: spela D på staven

source: play E on distaff
hu_hu: E hang a guzsalyon
ko: 실패로 E를 연주
sv_se: spela E på staven

source: play F on distaff
hu_hu: F hang a guzsalyon
ko: 실패로 F를 연주
sv_se: spela F på staven

source: play G on distaff
hu_hu: G hang a guzsalyon
ko: 실패로 G를 연주
sv_se: spela G på staven

source: play A on distaff
hu_hu: A hang a guzsalyon
ko: 실패로 A를 연주
sv_se: spela A på staven

source: play B on distaff
hu_hu: B hang a guzsalyon
ko: 실패로 B를 연주
sv_se: spela H på staven

source: play C major on distaff
hu_hu: C dúr a guzsalyon
ko: 실패로 C 장조를 연주
sv_se: spela C-dur på staven

source: Shows the drafts inventory
hu_hu: A hangjegy felszerelés megjelenítése
ko: 임시 인벤토리를 표시
sv_se: Visar utkastöversikten

source: puSh
hu_hu: Megtol
ko: 밀기
sv_se: Tryck

source: pull (Yank)
hu_hu: húz (Ránt)
ko: 당기기 (잡아당김)
sv_se: Dra (ryck)

source: turn oN
hu_hu: Bekapcsol
ko: 켜기
sv_se: sätt På

source: turn oFf
hu_hu: Kikapcsol
ko: 끄기
sv_se: stäng Av

source: KeyUp
hu_hu: JegyzetFel
ko: ↑ 키
sv_se: Piltangent upp

source: Highlight prev dialogue
hu_hu: Előző dialógus kiemelése
ko: 이전 대화를 강조
sv_se: Markera föreg. dialog

source: KeyDown
hu_hu: JegyzetLe
ko: ↓ 키
sv_se: Piltangent ned

source: Highlight next dialogue
hu_hu: Következő dialógus kiemelése
ko: 다음 대화를 강조
sv_se: Markera nästa dialog

source: Object
hu_hu: Tárgy
ko: 개체
sv_se: Objekt

source: Black and White / Color
hu_hu: Fekete fehér / Színes
ko: 흑백 / 컬러
sv_se: Svartvitt / Färg

source: Eyes
hu_hu: Szemek
ko: 눈
sv_se: Ögon

source: Tongue
hu_hu: Nyelv
ko: 혀
sv_se: Tunga

source: Punch
hu_hu: Megüt
ko: 펀치
sv_se: Slå

source: Kick
hu_hu: Rúg
ko: 킥
sv_se: Sparka

source: Regular cursor
hu_hu: Hagyományos kurzor
ko: 일반 커서
sv_se: Vanlig pekare

source: Save / Load / Options
hu_hu: Ment / Tölt / Opciók
ko: 저장 / 불러오기 / 옵션
sv_se: Spara / Läs in / Alternativ

source: Other game controls:
hu_hu: Egyéb játékvezérlők:
ko: 다른 게임 조작:
sv_se: Övriga spelkontroller:

source: Inventory:
hu_hu: Felszerelés:
ko: 인벤토리:
sv_se: Inventarie:

source: Scroll list up
hu_hu: Lista felfelé görgetés
ko: 목록 위로 스크롤
sv_se: Bläddra listan uppåt

source: Scroll list down
hu_hu: Lista lefelé görgetése
ko: 목록 아래로 스크롤
sv_se: Bläddra listan nedåt

source: Upper left item
hu_hu: Bal felső tárgy
ko: 왼쪽 상단 아이템
sv_se: Övre vänstra föremålet

source: Lower left item
hu_hu: Bal alsó tárgy
ko: 왼쪽 하단 아이템
sv_se: Nedre vänstra föremålet

source: Upper right item
hu_hu: Jobb felső tárgy
ko: 오른쪽 상단 아이템
sv_se: Övre högra föremålet

source: Lower right item
hu_hu: Jobb alsó tárgy
ko: 오른쪽 하단 아이템
sv_se: Nedre högra föremålet

source: Middle left item
hu_hu: Bal középső tárgy
ko: 왼쪽 중간 아이템
sv_se: Mellersta vänstra föremålet

source: Middle right item
hu_hu: Jobb középső tárgy
ko: 오른쪽 중간 아이템
sv_se: Mellersta högra föremålet

source: Switching characters:
hu_hu: Váltás karakterek között:
ko: 캐릭터 전환:
sv_se: Byta karaktärer:

source: Second kid
hu_hu: Második gyerek
ko: 두 번째 캐릭터
sv_se: Andra ungen

source: Third kid
hu_hu: Harmadik gyerek
ko: 세 번째 캐릭터
sv_se: Tredje ungen

source: Toggle Inventory/IQ Points display
hu_hu: Felszerelés / IQ pont kijelző kapcsoló
ko: 인벤토리/IQ 포인트 표시를 전환
sv_se: Visa översikt/IQ-poäng

source: Toggle Keyboard/Mouse Fighting (*)
hu_hu: Billentyűzet/Egér harc kapcsoló (*)
ko: 격투게임 키보드/마우스 전환 (*)
sv_se: Växla slagsmål med tangentbord/mus (*)

source: * Keyboard Fighting is always on,
hu_hu: * Billentyűzetes harc mindig aktív,
ko: * 키보드 싸움은 항상 켜져 있으므로,
sv_se: (*) Slagsmål med tangentbord är alltid på,

source: so despite the in-game message this
hu_hu: így a játékon belüli üzenet ellenére, ez
ko: 게임 내 메시지와 상관없이
sv_se: så trots meddelandet i spelet

source: actually toggles Mouse Fighting Off/On
hu_hu: egérrel harcolás mód átkapcsolás Be/Ki
ko: 실제로 마우스 싸움 끄기/켜기 전환
sv_se: aktiverar det här endast slagsmål med mus

source: Fighting controls (numpad):
hu_hu: Verekedés vezérlők (numpad):
ko: 격투게임 조작 (숫자 패드):
sv_se: Slagsmålskontroller (nr. tangenter):

source: Step back
hu_hu: Hátralép
ko: 물러서기
sv_se: Steg bakåt

source: Block high
hu_hu: Felső védés
ko: 상단 막기
sv_se: Blockera högt

source: Block middle
hu_hu: Védés középen
ko: 중단 막기
sv_se: Blockera midjehöjd

source: Block low
hu_hu: Alsó védés
ko: 하단 막기
sv_se: Blockera lågt

source: Punch high
hu_hu: Felső ütés
ko: 상단 펀치
sv_se: Slå högt

source: Punch middle
hu_hu: Ütés középen
ko: 중단 펀치
sv_se: Slå midjehöjd

source: Punch low
hu_hu: Alsó ütés
ko: 하단 펀치
sv_se: Slå lågt

source: Sucker punch
hu_hu: Váratlan ütés
ko: 써커 펀치
sv_se: Smocka

source: These are for Indy on left.
hu_hu: Indy-től balra levő.
ko: 인디가 왼쪽에 있을 때 기준입니다.
sv_se: Gäller när Indy står till vänster.

source: When Indy is on the right,
hu_hu: Indy-től jobbra levő,
ko: 인디가 오른쪽에 있을 경우,
sv_se: När Indy står till höger byter

source: 7, 4, and 1 are switched with
hu_hu: 7, 4, és 1 átkapcsolja
ko: 7, 4, 1이
sv_se: 7, 4 och 1 byts med

source: 9, 6, and 3, respectively.
hu_hu: 9, 6, és 3-ra, egyenként.
ko: 9, 6, 3과 서로 바뀌게 됩니다.
sv_se: 9, 6 och 3 respektive.

source: Biplane controls (numpad):
hu_hu: Kétfedelű repülő vezérlők (numpad):
ko: 비행기 조작 (숫자 패드):
sv_se: Biplanskontroller (nr. tangenter):

source: Fly to upper left
hu_hu: Balra fel repülés
ko: 왼쪽 상단 비행
sv_se: Flyg åt övre vänster

source: Fly to left
hu_hu: Balra repülés
ko: 왼쪽으로 비행
sv_se: Flyg åt vänster

source: Fly to lower left
hu_hu: Balra le repülés
ko: 왼쪽 하단 비행
sv_se: Flyg åt nedre vänster

source: Fly upwards
hu_hu: Repülés fel
ko: 위로 비행
sv_se: Flyg uppåt

source: Fly straight
hu_hu: Repülés előre
ko: 정면으로 비행
sv_se: Flyg rakt fram

source: Fly down
hu_hu: Repülés le
ko: 아래로 비행
sv_se: Flyg nedåt

source: Fly to upper right
hu_hu: Jobbra fel repülés
ko: 오른쪽 상단 비행
sv_se: Flyg åt övre höger

source: Fly to right
hu_hu: Jobbra repülés
ko: 오른쪽으로 비행
sv_se: Flyg åt höger

source: Fly to lower right
hu_hu: Jobbra le repülés
ko: 오른쪽 하단 비행
sv_se: Flyg åt nedre höger

source: Snap scroll on
hu_hu: Finomgörgetés be
ko: 스냅 스크롤 켜기
sv_se: Snäpprullning på

source: Snap scroll off
hu_hu: Finomgörgetés ki
ko: 스냅 스크롤 끄기
sv_se: Snäpprullning av

source: Music volume:
hu_hu: Zene hangerő:
ko: 음악 볼륨:
sv_se: Musikvolym:

source: Subtitle speed:
hu_hu: Felirat sebesség:
ko: 자막 속도:
sv_se: Undertexthastighet:

source: This fan-made translation is not supported, because it is known to contain corrupted resources that might make it crash or seriously misbehave.
sv_se: Denna fan-skapade översättning stöds inte därför att den är känd att innehålla skadade resurser som kan göra att spelet kraschar eller uppträder felaktigt.

source: The Lite version of Putt-Putt Saves the Zoo iOS is not supported to avoid piracy. The full version is available for purchase from the iTunes Store.
hu_hu: A Putt-Putt Saves the Zoo iOS Lite verziója nem támogatott a kalózkodás megelőzése miatt. A teljes változat elérhető az iTunes Áruházban.
ko: Putt-Putt Saves the Zoo iOS의 Lite 버전은 불법 복제를 방지하기 위해 지원되지 않습니다. 풀 버전은 아이튠즈 스토어에서 구매할 수 있습니다.
sv_se: Lite-versionen av Putt-Putt Saves the Zoo iOS stöds inte av upphovsrättsliga skäl. Den fullständiga versionen går att köpa på iTunes Store.

source: Warning: this re-release version contains patched game scripts, and therefore it might crash or not work properly for the time being.
hu_hu: Figyelem: Ez az újra kiadott verzió tartalmaz javított játék szkripteket is, emiatt lehet hogy kifagy, vagy nem fog megfelelően működni egyelőre.
ko: 경고: 이 다시 출시된 버전에는 패치된 게임 스크립트가 포함되어 있으므로, 당장은 충돌이 발생하거나 제대로 작동하지 않을 수 있습니다.
sv_se: Varning: denna återutgivna version innehåller patchade spelskript, och därför kan den krascha eller inte fungera korrekt för tillfället.

source: HE v71+ support is not compiled in
hu_hu: HE v71+ támogatás nincs lefordítva
ko: HE v71+ 지원이 컴파일 되지 않았음
sv_se: Stöd för HE v71+ har inte kompilerats in

source: SCUMM v7-8 support is not compiled in
hu_hu: SCUMM v7-8 támogatás nincs lefordítva
ko: SCUMM v7-8 지원이 컴파일 되지 않았음
sv_se: Stöd för SCUMM v7-8 har inte kompilerats in

source: Show Object Line
hu_hu: Céltárgy sor megjelenítése
ko: 개체 줄 표시
sv_se: Visa objektrad

source: Show the names of objects at the bottom of the screen
hu_hu: Tárgyak neveinek megjelenítése a képernyő alján
ko: 개체의 이름을 화면 하단에 표시
sv_se: Visa namnen på objekt på botten av skärmen

source: Use NES Classic Palette
hu_hu: NES klasszikus paletta használata
ko: NES 클래식 팔레트
sv_se: Använd klassisk NES-palett

source: Use a more neutral color palette that closely emulates the NES Classic
hu_hu: Semlegesebb színpaletta használata, amely emulálja a NES Classic-ot
ko: NES 클래식 버전을 재현하는 더 자연스러운 컬러 팔레트를 사용
sv_se: Använd en mer neutral färgpalett som nära emulerar NES Classic

source: Trim FM-TOWNS games to 200 pixels height
hu_hu: FM-TOWNS játékok vágása 200 pixel magasságig
ko: FM-TOWNS 게임을 200 픽셀 높이로 잘라냄
sv_se: Beskär FM-TOWNS-spel till 200 bildpunkters höjd

source: Cut the extra 40 pixels at the bottom of the screen, to make it standard 200 pixels height, allowing using 'aspect ratio correction'
hu_hu: Levágja az extra 40 képpontot a képernyő alján, hogy 200 pixel magasságú legyen, lehetővé téve a 'képarány korrekció' használatát
ko: 화면 하단의 추가 40 픽셀을 잘라내어 일반 높이인 200 픽셀로 만들고, '화면비 교정'을 사용할 수 있도록 함
sv_se: Klipp bort de extra 40 bildpunkterna längst ner på skärmen, så att den blir 200 bildpunkter hög som standard, med hjälp av "korrigering av bildförhållande"

source: Run in original 640 x 480 resolution
hu_hu: Futtatás az eredeti 640 x 480 felbontásban
ko: 원본 640 x 480 해상도로 실행
sv_se: Kör i originalupplösning 640 x 480

source: This allows more accurate pause/restart banners, but might impact performance or shader/scaler usage.
hu_hu: Ez az opció lehetővé teszi a pontosabb szünet/újraindítás bannereket, de hatással lehet a játék teljesítményére és shader/skálázó használatra.
ko: 이를 통해 더 정확한 일시 정지/재시작 배너가 가능하지만 성능이나 셰이더/스케일러 사용에 영향을 미칠 수 있습니다.
sv_se: Detta ger mer exakta banners för paus/omstart, men kan påverka prestanda eller användning av shader/skalning.

source: Play simplified music
hu_hu: Egyszerűsített zene lejátszása
ko: 단순화된 음악을 재생
sv_se: Spela upp förenklad musik

source: This music was intended for low-end Macs, and uses only one channel.
hu_hu: Ezt a zenét gyengébb Mac-ekhez szánták, és csak egy csatornát használ.
ko: 이 음악은 저사양 Mac용으로 제작되었으며, 한 채널만 사용합니다.
sv_se: Denna musik var avsedd för lågprestanda Mac:ar, och använder endast en kanal.

source: Enable smooth scrolling
hu_hu: Finom görgetés engedélyezése
ko: 부드러운 스크롤 활성화
sv_se: Aktivera mjuk skärmrullning

source: (instead of the normal 8-pixels steps scrolling)
hu_hu: (a normál 8 képpontos lépés görgetés helyett)
ko: (일반적인 8 픽셀 단계 스크롤 대신)
sv_se: (istället för de normala rullningsstegen om 8-pixlar)

source: Allow semi-smooth scrolling
hu_hu: Fél-simított görgetés engedélyezése
ko: 약간 부드러운 스크롤을 허용
sv_se: Aktivera halvmjuk skärmrullning

source: Allow scrolling to be less smooth during the fast camera movement in the intro.
hu_hu: A görgetés kevésbé lesz zökkenőmentes a gyors kameramozgás során a bevezetőben.
ko: 인트로에서 카메라가 빠르게 움직이는 동안 스크롤이 덜 부드럽도록 허용합니다.
sv_se: Låter rullning vara mindre mjuk under den snabba kamerarörelsen i inledningen.

source: Enable low latency audio mode
hu_hu: Alacsony késleltetésű hangmód bekapcsolása
ko: 저지연 오디오 모드 활성화
sv_se: Aktivera ljudläge med låg latens

source: Allows the game to use low latency audio, at the cost of sound accuracy. It is recommended to enable this feature only if you incur in audio latency issues during normal gameplay.
hu_hu: Bekapcsolja a játékban az alacsony késleltetésű hangot a pontos hang rovására. Ajánlott a használata ha hang késéseket észlel normális játékmenet során.
ko: 게임에서 저지연 오디오를 사용할 수 있게 하지만, 사운드 정확도는 떨어집니다. 일반 게임 플레이 중에 오디오 지연 문제가 발생하는 경우에만 이 기능을 활성화하는 것이 좋습니다.
sv_se: Gör att spelet kan använda ljud med låg latens, på bekostnad av ljudets noggrannhet. Vi rekommenderar att du aktiverar den här funktionen endast om du har problem med ljudfördröjning under normalt spelande.
