Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: Select to start of line
hu_hu: Válassza ki a sor elejéig
ko: 줄의 시작을 선택
sv_se: Markera till radstart

source: Go to start of line
hu_hu: Ugrás a sor elejére
ko: 줄의 시작으로 이동
sv_se: Gå till radstart

source: Cut
hu_hu: Kivág
ko: 잘라내기
sv_se: Klipp ut

source: Copy
hu_hu: Másol
ko: 복사하기
sv_se: Kopiera

source: General
hu_hu: Általános
ko: 일반
sv_se: Allmänt

source: ## ScummVM at a Glance ScummVM is a modern reimplementation of various game engines. Once you transfer the original game data to your device, it endeavors to use it to faithfully recreate the original gaming experience. ScummVM isn't your typical emulator of DOS, Windows, or some console. Rather than a one-size-fits-all approach, it takes a meticulous route, implementing the precise game logic for each specific title or engine it supports. ScummVM will not work with game engines it does not support. ScummVM is developed by a team of volunteers and is free software. We lack an extensive testing team, possess only a limited range of devices, and cannot always address every request. We also do not run advertisements or sell you anything. Please be mindful of this when you submit a complaint or a bug report. ## Where to get the games Visit [our Wiki](https://wiki.scummvm.org/index.php?title=Where_to_get_the_games) for a detailed list of supported games and where to purchase them. Alternatively, you can download a variety of [freeware games](https://scummvm.org/games) and [demos](https://www.scummvm.org/demos/) directly from our website. The ScummVM team does not endorse any specific game supplier. However, the project receives a commission from every purchase made on [ZOOM-Platform](https://www.zoom-platform.com/?affiliate=c049516c-9c4c-42d6-8649-92ed870e8b53) through affiliate referral links. Additionally, games not available on ZOOM-Platform can be found on other suppliers such as GOG.com and Steam. For other (out-of-print) games, consider checking platforms like Amazon, eBay, Game Trading Zone, or other auction sites. Be cautious of faulty games and illegal game copies.
hu_hu: ## ScummVM dióhéjban A ScummVM számos régi játékmotor modern implementációja. Az eszközére felrakott játékfájlok segítségével igyekszik pontosan létrehozni az eredeti játékélményt. A ScummVM nem egy tipikus Dos-, Windows-, esetleg konzolos emulátor. Ahelyett, hogy mindenre egyféle megoldást húzna rá, aprólékosan próbál egyéni megoldást implementálni játék és motor specifikusan, hogy elérje a pontos játék "logikát". A ScummVm nem fog működni nem támogatott motorokkal. A ScummVM egy ingyenes szoftver, melyet önkéntesek fejlesztenek. Nem rendelkezünk kiterjedt tesztelő csapattal, csak limitált mennyiségű eszköz áll rendelkezésre, és nem áll módunkban minden kérést kivizsgálni. Emellett nem használunk reklámokat, és nem árulunk semmilyen saját terméket. Ezeket vegye figyelembe bug vagy más egyéb panasz bejelentése esetén. ## Hol találom meg a játékokat Keresse fel [Wiki-nket](https://wiki.scummvm.org/index.php?title=Where_to_get_the_games), ahol megtudhatja milyen játékokat támogatunk, és hol szerezheti be őket. Másik lehetőség, hogy körbenéz a letölthető [freeware játékok](https://scummvm.org/games) és [demók](https://www.scummvm.org/demos/) között, melyek közvetlenül elérhetőek az oldalunkon. A ScummVM csapata nem támogat egyetlen platformot sem. Azonban a projekt jutalékban részesül minden a [ZOOM-Platform](https://www.zoom-platform.com/?affiliate=c049516c-9c4c-42d6-8649-92ed870e8b53) oldalán történt vásárlás után partner linkelésen keresztül. Esetlegesen a meg nem talált játékok elérhetőek lehetnek a GOG.com és a Steam platformján. Minden más nem elérhető játék esetén érdemes körbenézni Amazon-on, eBay-en, Game Trading ZOne-on, vagy más digitális piactéren. Azonban legyen óvatos, mert előfordulhatnak hibás vagy illegális másolatok is.
ko: ## ScummVM 개요 ScummVM은 다양한 게임 엔진을 현대적으로 재구현한 것입니다. 원래 게임 데이터를 기기로 전송하면, 원래 게임 경험을 충실하게 재현하기 위해 이를 사용합니다. ScummVM은 일반적인 DOS, Windows 또는 일부 콘솔 에뮬레이터가 아닙니다. 모든 것에 맞는 단일 방식이 아니라, 지원하는 각 특정 타이틀이나 엔진에 대한 정확한 게임 로직을 구현하는 세심한 경로를 취합니다. ScummVM은 지원하지 않는 게임 엔진에서는 작동하지 않습니다. ScummVM은 자원봉사자 팀에서 개발했으며 무료 소프트웨어입니다. 광범위한 테스트 팀이 없고, 제한된 범위의 기기만 보유하고 있으며, 항상 모든 요청을 처리할 수는 없습니다. 또한 광고를 게재하거나 아무것도 판매하지 않습니다. 불만이나 버그 보고서를 제출할 때 이 점을 유의하십시오. ## 게임 구입처 지원되는 게임의 자세한 목록과 구입처는 [위키](https://wiki.scummvm.org/index.php?title=Where_to_get_the_games)에서 확인하세요. 대체로, 다양한 [프리웨어 게임](https://scummvm.org/games)과 [데모](https://www.scummvm.org/demos/)를 우리 웹사이트에서 직접 다운로드할 수 있습니다. ScummVM 팀은 특정 게임 공급업체를 지지하지 않습니다. 그러나 이 프로젝트는 제휴 추천 링크를 통해 [ZOOM-Platform](https://www.zoom-platform.com/?affiliate=c049516c-9c4c-42d6-8649-92ed870e8b53)에서 이루어지는 모든 구매에 대해 수수료를 받습니다. 추가적으로, ZOOM-Platform에서 이용할 수 없는 게임은 GOG.com 및 스팀과 같은 다른 공급업체에서 찾을 수 있습니다. 다른 (절판된) 게임의 경우 아마존, 이베이, 게임 트레이딩 존 또는 기타 경매 사이트와 같은 플랫폼을 확인하는 것을 고려하세요. 결함이 있는 게임과 불법 게임 사본에 주의하세요.
sv_se: ## ScummVM i en överblick ScummVM är en modern reimplementering av olika spelmotorer. När du överför originalspeldata till din enhet försöker den använda den för att troget återskapa den ursprungliga spelupplevelsen. ScummVM är inte din typiska emulator för DOS, Windows eller någon konsol. Snarare än ett tillvägagångssätt som passar alla, tar det en noggrann väg och implementerar den exakta spellogiken för varje specifik titel eller motor som den stöder. ScummVM kommer inte att fungera med spelmotorer som den inte stöder. ScummVM är utvecklat av ett team av frivilliga och är fri programvara. Vi saknar ett omfattande testteam, har endast ett begränsat utbud av enheter och kan inte alltid tillgodose alla önskemål. Vi kör inte heller annonser eller säljer något till dig. Tänk på detta när du skickar in ett klagomål eller en felrapport. ## Var kan man få tag på spelen Besök [vår Wiki](https://wiki.scummvm.org/index.php?title=Where_to_get_the_games) för en detaljerad lista över spel som stöds och var du kan köpa dem. Alternativt kan du hämta ner en mängd olika [freeware-spel](https://scummvm.org/games) och [demos](https://www.scummvm.org/demos/) direkt från vår webbplats. ScummVM-teamet stödjer inte någon specifik spelleverantör. Projektet får dock en provision från varje köp som görs på [ZOOM-Platform](https://www.zoom-platform.com/?affiliate=c049516c-9c4c-42d6-8649-92ed870e8b53) genom affilierade referenslänkar. Dessutom kan spel som inte finns tillgängliga på ZOOM-plattformen hittas på andra leverantörer som GOG.com och Steam. För andra (out-of-print) spel kan du överväga att kontrollera plattformar som Amazon, eBay, Game Trading Zone eller andra auktionswebbplatser. Var försiktig med felaktiga spel och olagliga spelkopior.

source: Cloud
hu_hu: Felhő
ko: 클라우드
sv_se: Moln

source: ## Connecting a cloud service - Quick mode 1. From the Launcher, select **Global Options** and then select the **Cloud** tab. 2. Select your preferred cloud storage service from the **Active storage** dropdown, then select **Connect**. ![Select cloud service](choose_storage.png "Select cloud service"){w=70%} 3. Select **Quick mode**. ![Quick mode](quick_mode.png "Quick mode"){w=70%} 4. Select **Run server** and then select **Next** ![Run server](run_server.png "Run server"){w=70%} ![Next step](server_next.png "Next step"){w=70%} 5. Open the link. ![Open the link](open_link.png "Open the link"){w=70%} 6. In the browser window that opens, select the cloud service to connect. ![Choose the cloud service](cloud_browser.png "Choose the cloud service"){w=70%} 7. Sign in to the chosen cloud service. Once completed, return to ScummVM. 8. On the success screen, select **Finish** to exit. ![Success](cloud_success.png "Success"){w=70%} 9. Back on the main Cloud tab, select **Enable storage**. ![Enable storage](enable_storage.png "Enable storage"){w=70%} 10. You're ready to go! Use the cloud functionality to sync saved games or game files between your devices. ![Cloud functionality](cloud_functions.png "Cloud functionality"){w=70%} For more information, including how to use the manual connection wizard, see our [Cloud documentation](https://docs.scummvm.org/en/latest/use_scummvm/connect_cloud.html)
hu_hu: ## Csatlakozás egy felhő szolgáltatóhoz - Gyors mód 1. Az indítópultból válassza ki az **Átfogó Opciók** aztán válassza a **Felhő** fület. 2. Válassza ki a kívánt felhő szolgáltatót az **Aktív tároló** legördülő menüből, majd válassza a **Csatlakozás**-t. ![Felhő szolgáltató kiválasztása](choose_storage.png "Felhő szolgáltató kiválasztása"){w=70%} 3. **Gyors mód** választása. ![Gyors mód](quick_mode.png "Gyors mód"){w=70%} 4. Válassza a **Szerver futtatása** majd a **Következő**-t ![Szerver futtatása](run_server.png "Szerver futtatása"){w=70%} ![Következő lépés](server_next.png "Következő lépés"){w=70%} 5. Hivatkozás megnyitása. ![Hivatkozás megnyitása](open_link.png "Hivatkozás megnyitása"){w=70%} 6. A megnyíló ablakban válassza a kívánt felhő szolgáltatót. ![Felhő szolgáltató kiválasztása](cloud_browser.png "Felhő szolgáltató kiválasztása"){w=70%} 7. Bejelentkezés a kívánt felhőbe. Befejezés után lépjen vissza a ScummVM-be. 8. A sikeres oldalon nyomjon a **Befejezés** gombra. ![Siker](cloud_success.png "Siker"){w=70%} 9. A Felhő fülön válassza a **Tárhely bekapcsolása** opciót. ![Tárhely bekapcsolása](enable_storage.png "Tárhely bekapcsolása"){w=70%} 10. Kész is van! Használja a felhőt funkciót a mentések vagy játék fájlok szinkronizálásához az eszközei között. ![Felhő funkcionalitás](cloud_functions.png "Felhő funkcionalitás"){w=70%} További információért, többek között a manuális kapcsolat varázslóról, keresse fel a [Felhő dokumentációnkat](https://docs.scummvm.org/en/latest/use_scummvm/connect_cloud.html)
ko: ## 클라우드 서비스 연결 - 빠른 모드 1. 런처에서, **글로벌 옵션**을 선택한 다음 **클라우드** 탭을 선택합니다. 2. **활성 저장소** 드롭다운에서 선호하는 클라우드 저장소 서비스를 선택한 다음 **연결**을 선택합니다. ![클라우드 서비스 선택](choose_storage.png "클라우드 서비스 선택"){w=70%} 3. **빠른 모드**를 선택합니다. ![빠른 모드](quick_mode.png "빠른 모드"){w=70%} 4. **서버 실행**을 선택한 후 **다음**을 선택 ![서버 실행](run_server.png "서버 실행"){w=70%} ![다음 단계](server_next.png "다음 단계"){w=70%} 5. 링크를 엽니다. ![링크 열기](open_link.png "링크 열기"){w=70%} 6. 열리는 브라우저 창에서 연결할 클라우드 서비스를 선택합니다. ![클라우드 서비스 선택](cloud_browser.png "클라우드 서비스 선택"){w=70%} 7. 선택한 클라우드 서비스에 로그인합니다. 완료되면, ScummVM.xt**로 돌아갑니다. 8. 성공 화면에서 **마침**을 선택하여 종료합니다. ![성공](cloud_success.png "성공"){w=70%} 9. 메인 클라우드 탭으로 돌아가서 **저장소 사용**을 선택합니다. ![저장소 활성화](enable_storage.png "저장소 활성화"){w=70%} 10. 이제 시작할 준비가 되었습니다! 클라우드 기능을 사용하여 저장된 게임이나 게임 파일을 기기 간에 동기화하세요. ![클라우드 기능](cloud_functions.png "클라우드 기능"){w=70%} 자세한 내용은, 수동 연결 마법사를 사용하는 방법을 포함하여 [클라우드 설명서](https://docs.scummvm.org/en/latest/use_scummvm/connect_cloud.html) 참조
sv_se: ## Ansluta en molntjänst - Snabbläge 1. Från spelstartaren väljer du **Globala inställningar** och sedan fliken **Moln**. 2. Välj önskad molnlagringstjänst i rullgardinsmenyn **Aktiv lagring** och välj sedan **Anslut**. ![Välj molntjänst](choose_storage.png "Välj molntjänst"){w=70%} 3. Välj **Snabbläge**. ![Snabbläge](quick_mode.png "Snabbläge"){w=70%} 4. Välj **Kör server** och välj sedan **Nästa** ![Kör server](run_server.png "Kör server"){w=70%} ![Nästa steg](server_next.png "Nästa steg"){w=70%} 5. Öppna länken. ![Öppna länken](open_link.png "Öppna länken"){w=70%} 6. I webbläsarfönstret som öppnas väljer du den molntjänst som du vill ansluta till. ![Välj molntjänst](cloud_browser.png "Välj molntjänst"){w=70%} 7. Logga in på den valda molntjänsten. När du är klar återvänder du till ScummVM. 8. På skärmen för framgång väljer du **Färdig** för att avsluta. ![Lyckades](cloud_success.png "Lyckades"){w=70%} 9. Tillbaka på huvudfliken Moln väljer du **Aktivera lagring**. ![Aktivera lagring](enable_storage.png "Aktivera lagring"){w=70%} 10. Nu är du redo att köra! Använd molnfunktionen för att synkronisera sparade spel eller spelfiler mellan dina enheter. ![Molnfunktionalitet](cloud_functions.png "Molnfunktionalitet"){w=70%} För mer information, inklusive hur du använder den manuella anslutningsguiden, se vår [Molndokumentation](https://docs.scummvm.org/en/latest/use_scummvm/connect_cloud.html)

source: Prev
hu_hu: Elő
ko: 이전
sv_se: Föreg

source: Save Image...
hu_hu: Kép mentése...
ko: 이미지 저장...
sv_se: Spara bild...

source: %u of %u
hu_hu: %u a %u-ból
ko: %u / %u
sv_se: %u av %u

source: Save Image
hu_hu: Kép mentése
ko: 이미지 저장
sv_se: Spara bild

# group
source: None
hu_hu: Egyik sem
ko: 없음
sv_se: Ingen

# group
source: First letter
hu_hu: Kezdőbetű
ko: 첫 글자
sv_se: Första bokstav

# group
source: Engine
hu_hu: Motor
ko: 엔진
sv_se: Motor

# group
source: Series
hu_hu: Sorozat
ko: 시리즈
sv_se: Serie

# group
source: Publisher
hu_hu: Kiadó
ko: 배급사
sv_se: Utgivare

# group
source: Language
hu_hu: Nyelv
ko: 언어
sv_se: Språk

# group
source: Platform
ko: 플랫폼
sv_se: Plattform

source: Year
hu_hu: Év
ko: 연도
sv_se: År

source: Select Group by
hu_hu: Csoportosítás kiválasztás
ko: 그룹 선택 기준
sv_se: Välj grupp efter

source: Group:
hu_hu: Csoport:
ko: 그룹:
sv_se: Grupp:

source: Select a criteria to group the entries
hu_hu: Válassz feltételeket a csoportosításhoz
ko: 항목을 그룹화할 기준을 선택
sv_se: Välj urvalskriterium för gruppering

source: Click here to see Help
hu_hu: Kattintson ide a Segítségért
ko: 도움말을 보려면 여기를 클릭
sv_se: Klicka här för att se hjälp

source: ~Q~uit
hu_hu: Kilépés
ko: 종료(~Q~)
sv_se: ~A~vsluta

source: Quit ScummVM
hu_hu: ScummVM bezárása
ko: ScummVM 종료
sv_se: Avsluta ScummVM

source: A~b~out
hu_hu: Névjegy
ko: 정보(~b~)
sv_se: ~O~m

source: About ScummVM
hu_hu: ScummVM névjegye
ko: ScummVM 정보
sv_se: Om ScummVM

source: Global ~O~ptions...
hu_hu: Átfogó ~O~pciók...
ko: 글로벌 옵션(~O~)...
sv_se: Globala a~l~ternativ...

source: Change global ScummVM options
hu_hu: Átfogó ScummVM opciók változtatása
ko: 글로벌 ScummVM 옵션 변경
sv_se: Redigera globala ScummVM-inställningar

# lowres
source: Global ~O~pts...
hu_hu: Átfogó ~O~pc...
ko: 글로벌 옵션(~O~)...
sv_se: Globala i~n~st...

source: Download Games
hu_hu: Játékok letöltése
ko: 게임 다운로드
sv_se: Hämta ner spel

source: Download freeware games for ScummVM
hu_hu: Freeware játékok letöltése ScummVM-hez
ko: ScummVM용 프리웨어 게임 다운로드
sv_se: Hämta ner freeware-spel till ScummVM

source: ~A~dd Game...
hu_hu: Játék hozzá~a~dás...
ko: 게임 추가(~A~)...
sv_se: Lägg ~t~ill spel...

source: Add games to the list
hu_hu: Játékok hozzáadása a listához
ko: 게임을 목록에 추가
sv_se: Lägg till spel till listan

# lowres
source: ~A~dd Game...
hu_hu: Játék hozzá~a~dás...
ko: 게임 추가(~A~)...
sv_se: Lä~g~g till spel...

source: ~R~emove Game
hu_hu: Játék tö~r~lése
ko: 게임 제거(~R~)
sv_se: ~T~a bort spel

source: Remove game from the list. The game data files stay intact
hu_hu: Törli a játékot a listáról. A játékfájlok megmaradnak
ko: 목록에서 게임을 제거합니다. 게임 데이터 파일은 남겨둠
sv_se: Ta bort spelet från listan. Spelets datafiler påverkas inte

# lowres
source: ~R~emove Game
hu_hu: Játék tö~r~lése
ko: 게임 제거(~R~)
sv_se: ~T~a bort spel

source: Mass Add...
hu_hu: Tömeges hozzáadás...
ko: 일괄 추가...
sv_se: Lägg till flera...

# lowres
source: Mass Add...
hu_hu: Tömeges hozzáadás...
ko: 일괄 추가...
sv_se: Lägg till flera...

source: Search in game list
hu_hu: Keresés a játéklistában
ko: 게임 목록에서 검색
sv_se: Sök i spellistan

source: Search:
hu_hu: Keresés:
ko: 검색:
sv_se: Sök:

source: Load game:
hu_hu: Mentés betöltése:
ko: 게임 불러오기:
sv_se: Läs in spel:

source: This directory cannot be used yet, it is being downloaded into!
hu_hu: Ez a mappa még nem áll rendelkezésre, folyamatban van a letöltés ide!
ko: 이 디렉터리는 아직 사용할 수 없고, 다운로드 중입니다!
sv_se: Den här katalogen kan inte användas än, eftersom något hämtas ner till den!

source: Do you really want to run the mass game detector? This could potentially add a huge number of games.
hu_hu: Biztosan futtatni akarja a tömeges játék felismerőt? Ez akár jelentős számú játékot is jelenthet.
ko: 정말 일괄 게임 탐지기를 실행하겠습니까? 이렇게 하면 엄청난 수의 게임이 추가될 가능성이 있습니다.
sv_se: Vill du verkligen använda denna funktion för att söka efter flera spel? Processen kan potentiellt lägga till ett enormt antal spel.

source: Do you really want to remove this game configuration?
hu_hu: Biztosan törölni akarja ezt a játék konfigurációt?
ko: 정말 이 게임 구성을 제거하겠습니까?
sv_se: Vill du verkligen ta bort den här spelkonfigurationen?

source: Do you want to load saved game?
hu_hu: Be akarja tölteni a játék mentést?
ko: 저장된 게임을 불러오겠습니까?
sv_se: Vill du läsa in sparat spel?

source: This game does not support loading games from the launcher.
hu_hu: Ez a játék nem támogatja az indítóból történő mentés betöltést.
ko: 이 게임은 런처에서 게임을 불러오는 것을 지원하지 않습니다.
sv_se: Det här spelet saknar stöd för inläsning av spel från spelstartaren.

source: ScummVM could not find any engine capable of running the selected game!
hu_hu: A ScummVM nem talált olyan motort a kijelölt játékhoz, amely tudná futtatni!
ko: ScummVM이 선택한 게임을 실행할 수 있는 엔진을 찾을 수 없습니다!
sv_se: ScummVM kunde inte hitta någon motor som kan köra det valda spelet!

source: Have you given ScummVM access rights to this directory? Press the help button [?] on the top for detailed instructions
hu_hu: Adott írás jogot a ScummVM számára ehhez a mappához? Nyomja meg fent a Segítség gombot [?] további részletekért
ko: 이 디렉터리에 ScummVM 접속 권한을 부여했습니까? 자세한 지침은 상단의 도움말 [?] 버튼을 누름
sv_se: Har du gett ScummVM åtkomstbehörighet för denna katalog? Tryck på hjälpknappen [?] i toppen för detaljerade instruktioner

source: ScummVM could not find any game in the specified directory!
hu_hu: A ScummVM nem talált egy játékot sem a választott mappában!
ko: ScummVM은 선택한 디렉터리에서 아무 게임도 찾지 못했습니다!
sv_se: ScummVM kunde inte hitta några spel i den valda katalogen!

source: Unknown variant
hu_hu: Ismeretlen változat
ko: 알 수 없는 변종 게임
sv_se: Okänd variant

source: List view
hu_hu: Lista nézet
ko: 목록 표시
sv_se: Listvy

source: Grid view
hu_hu: Rács nézet
ko: 격자 표시
sv_se: Rutnätsvy

source: ~S~tart
hu_hu: Indítá~s~
ko: 시작(~S~)
sv_se: ~S~tarta

source: Start selected game
hu_hu: A választott játék indítása
ko: 선택한 게임을 시작
sv_se: Starta det valda spelet

source: ~L~oad...
hu_hu: Betö~l~t...
ko: 불러오기(~L~)...
sv_se: ~L~äs in...

source: Load saved game for selected game
hu_hu: Mentett játék betöltése kiválasztott játéknál
ko: 선택된 게임의 저장된 게임을 불러옴
sv_se: Läs in sparat spel för det valda spelet

source: Record...
hu_hu: Felvétel...
ko: 녹화...
sv_se: Spela in...

source: ~G~ame Options...
hu_hu: Játék Opciók...
ko: 게임 옵션(~G~)...
sv_se: Spela~l~ternativ...

source: Change game options
hu_hu: Játék opciók megváltoztatása
ko: 게임 옵션 변경
sv_se: Redigera spelalternativen

# lowres
source: ~G~ame Opts...
hu_hu: Játék Opc...
ko: 게임 옵션(~G~)...
sv_se: Spela~l~ternativ...

source: Add-on
sv_se: Tillägg

source: Unknown Engine
hu_hu: Ismeretlen Motor
ko: 알 수 없는 엔진
sv_se: Okänd motor

source: Unknown Publisher
hu_hu: Ismeretlen Kiadó
ko: 알 수 없는 배급사
sv_se: Okänd utgivare

source: No Series
hu_hu: Nincs Sorozat
ko: 시리즈 없음
sv_se: Ingen serie

source: Language not detected
hu_hu: Nyelv nincs észlelve
ko: 언어가 감지되지 않았음
sv_se: Språk upptäcktes inte

source: Platform not detected
hu_hu: Platform nincs észlelve
ko: 플랫폼이 감지되지 않았음
sv_se: Plattform upptäcktes inte

source: Unknown Year
hu_hu: Ismeretlen Év
ko: 알 수 없는 연도
sv_se: Okänt år

source: Do you really want to remove the following game configurations?
sv_se: Vill du verkligen ta bort följande spelkonfigurationer?

source: All
hu_hu: Mind
ko: 모두
sv_se: Alt

source: Icons per row:
hu_hu: Soronkénti ikonok:
ko: 열당 아이콘:
sv_se: Ikoner per rad:

source: ... progress ...
hu_hu: ... folyamatban ...
ko: ... 진행 중 ...
sv_se: ... förlopp ...

source: Scan complete!
hu_hu: Vizsgálat kész!
ko: 스캔이 완료되었습니다!
sv_se: Genomsökningen är färdig!

source: Discovered %d new games, ignored %d previously added games.
hu_hu: %d új felismert játék, %d korábban hozzáadott játék mellőzése.
ko: 새로운 게임 %d 개를 발견하였고, 이전에 추가된 게임 %d 개를 무시했습니다.
sv_se: Upptäckte %d nya spel. Ignorerade %d tidigare tillagda spel.

source: Scanned %d directories ...
hu_hu: %d mappa átvizsgálva...
ko: %d 개의 디렉터리를 스캔했습니다...
sv_se: Sökte igenom %d kataloger ...

source: Discovered %d new games, ignored %d previously added games ...
hu_hu: %d új felismert játék, %d korábban hozzáadott játék mellőzése ...
ko: 새로운 게임 %d 개를 발견하였고, 이전에 추가된 게임 %d 개를 무시했습니다...
sv_se: Upptäckte %d nya spel, ignorerade %d tidigare tillagda spel ...

source: Stop
hu_hu: Leállít
ko: 중지
sv_se: Stoppa

source: Edit record description
hu_hu: Felvétel leírás szerkesztése
ko: 녹화 설명 편집
sv_se: Redigera beskrivning av inspelning

source: Switch to Game
hu_hu: Átváltás játékra
ko: 게임으로 전환
sv_se: Växla till spelet

source: Fast replay
hu_hu: Gyors visszajátszás
ko: 빠른 리플레이
sv_se: Snabb uppspelning

source: Never
hu_hu: Soha
ko: 사용하지 않음
sv_se: Aldrig

source: Every 5 mins
hu_hu: Minden 5 percben
ko: 5 분마다
sv_se: Var 5:e minut

source: Every 10 mins
hu_hu: Minden 10 percben
ko: 10 분마다
sv_se: Var 10:e minut

source: Every 15 mins
hu_hu: Minden 15 percben
ko: 15 분마다
sv_se: Var 15:e minut

source: Every 30 mins
hu_hu: Minden 30 percben
ko: 30 분마다
sv_se: Var 30:e minut

source: 200% - Extremely large
hu_hu: 200% - Extrém nagy
ko: 200% - 극도로 큼
sv_se: 200% - Extremt stort

source: 175% - Very large
hu_hu: 175% - Nagyon nagy
ko: 175% - 매우 큼
sv_se: 175% - Väldigt stort

source: 150% - Larger
hu_hu: 150% - Nagyobb
ko: 150% - 더 큼
sv_se: 150% - Större

source: 125% - Large
hu_hu: 125% - Nagy
ko: 125% - 큼
sv_se: 125% - Stort

source: 100% - Medium
hu_hu: 100% - Közepes
ko: 100% - 중간
sv_se: 100% - Medel

source: 75% - Small
hu_hu: 75% - Kicsi
ko: 75% - 작음
sv_se: 75% - Litet

source: 50% - Smaller
hu_hu: 50% - Kisebb
ko: 50% - 더 작음
sv_se: 50% - Mindre

source: 25% - Smallest
hu_hu: 25% - Legkisebb
ko: 25% - 매우 작음
sv_se: 25% - Minst

source: Failed to apply some of the graphic options changes:
hu_hu: Nem került alkalmazásra néhány grafikai opció változtatás:
ko: 일부 그래픽 옵션 변경 사항 적용에 실패함:
sv_se: Kunde inte tillämpa några av grafikinställningarna:

source: the video mode could not be changed
hu_hu: a videó mód nem változtatható meg
ko: 비디오 모드를 변경할 수 없음
sv_se: videoläget kunde inte ändras

source: the stretch mode could not be changed
hu_hu: a széthúzott mód nem változtatható meg
ko: 늘리기 모드를 변경할 수 없음
sv_se: utsträckningsläget kunde inte ändras

source: the aspect ratio setting could not be changed
hu_hu: a képméretarány beállítás nem változtatható meg
ko: 화면비 설정을 변경할 수 없음
sv_se: inställningen för bildförhållandet kunde inte ändras

source: the fullscreen setting could not be changed
hu_hu: a teljesképernyős beállítás nem változtatható meg
ko: 전체 화면 설정을 변경할 수 없음
sv_se: helskärmsinställningen kunde inte ändras

source: the filtering setting could not be changed
hu_hu: a szűrési beállítás nem változtatható meg
ko: 필터링 설정을 변경할 수 없음
sv_se: filterinställningen kunde inte ändras

source: the vsync setting could not be changed
hu_hu: a vsync beállítás nem változtatható meg
ko: 수직동기화 설정을 변경할 수 없음
sv_se: vsync-inställningen kunde inte ändras

source: the shader could not be changed
hu_hu: a shader nem változtatható meg
ko: 셰이더를 변경할 수 없음
sv_se: shadern kunde inte ändras

source: Touchpad mouse mode
hu_hu: Touchpad egér mód
ko: 터치패드 마우스 모드
sv_se: Touchpad-musläge

source: Pointer Speed:
hu_hu: Mutató Sebesség:
ko: 포인터 속도:
sv_se: Pekarhastighet:

source: Speed for keyboard/joystick mouse pointer control
hu_hu: Billentyűzet/joystick vezérelt mutató sebessége
ko: 키보드/조이스틱 마우스 포인터 컨트롤 속도
sv_se: Hastighet för kontroll av muspekare via tangentbord/styrspak

# lowres
source: Pointer Speed:
hu_hu: Mutató Sebesség:
ko: 포인터 속도:
sv_se: Pekarhastighet:

source: Joy Deadzone:
hu_hu: Joy Holtzóna:
ko: 조이스틱 데드존:
sv_se: Dödzon styrspak:

source: Analog joystick Deadzone
hu_hu: Analóg joystick Holtzóna
ko: 아날로그 조이스틱 데드존
sv_se: Dödzon för analog styrspak

# lowres
source: Joy Deadzone:
hu_hu: Joy Holtzóna:
ko: 조이스틱 데드존:
sv_se: Dödzon styrspak:

source: %d hidden achievements remaining
hu_hu: %d rejtett teljesítmény maradt
ko: 숨겨진 도전과제 %d 개 남음
sv_se: %d dolda prestationer återstår

source: Achievements unlocked: %d/%d
hu_hu: Megszerzett teljesítmény: %d/%d
ko: 잠금 해제된 도전과제: %d/%d
sv_se: Prestationer upplåsta: 1%d/2%d
