Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: Show hotspots
hu_hu: Forrópontok mutatása
ko: 핫스팟 표시
sv_se: Visa känsliga punkter

source: You selected Ransome *unbeeped* (DLC) but the DLC has not been detected!
hu_hu: Kiválasztotta a Váltságdíj *kisípolva* DLC-t, de a dlc nincs telepítve!
ko: 랜섬 *신호음 없음* (DLC)을 선택했었지만 DLC가 감지되지 않았습니다!
sv_se: Du valde Ransome *unbeeped* (DLC) men DLC:n har inte upptäckts!

source: This game requires OpenGL with shaders, which is not supported on your system
sv_se: Detta spel kräver OpenGL med shaders, vilket inte stöds på ditt system

source: This game requires OpenGL Framebuffer Objects, which are not supported on your system
sv_se: Detta spel kräver OpenGL Framebuffer Objects, som inte stöds av ditt system

source: Enable frame skipping
hu_hu: Képkocka kihagyás engedélyezése
ko: 프레임 건너뛰기 활성화
sv_se: Aktivera bildöverhoppning

source: Allow the game to skip animation frames when running too slow.
hu_hu: A játék kihagyhat képkockákat ha az animáció túl lassan fut le.
ko: 게임이 너무 느리게 실행될 때 애니메이션 프레임을 건너뛸 수 있도록 허용합니다.
sv_se: Tillkåt spelet att hoppa över animationsbilder när det kör för långsamt.

source: Enable frame limiting
hu_hu: Képkocka korlátozás engedélyezése
ko: 프레임 제한 활성화
sv_se: Aktivera bildbegränsning

source: Limits the speed of the game to prevent running too fast.
hu_hu: Korlátozza a játék képkockaszámát, megakadályozva azt, hogy túl gyorsan fusson.
ko: 게임 속도를 제한하여 너무 빨리 실행되는 것을 방지합니다.
sv_se: Begränsa spelets hastighet för att hindra det från att köra för snabbt.

source: Enable cheats
hu_hu: Csalások engedélyezése
ko: 치트 활성화
sv_se: Aktivera fusk

source: Allow cheats by commands and a menu when player is clicked.
hu_hu: Parancs alapú csalások, és a játékosra kattintva megjelenő menü engedélyezése.
ko: 플레이어를 클릭하면 명령어와 메뉴를 통한 치트를 허용합니다.
sv_se: Tillåt fusk genom kommandon och en meny när spelaren är vald.

source: Play foot step sounds
hu_hu: Lépés hangok lejátszása
ko: 발자국 사운드 재생
sv_se: Spela fotstegsljud

source: Plays sound when the player moves.
hu_hu: Hallható amikor a játékos mozog.
ko: 플레이어가 움직이면 사운드가 재생됩니다.
sv_se: Spelar upp ljud när spelaren rör sig.

source: Enable jump to mouse position
hu_hu: Engedélyezi az egér pozícióra ugrást
ko: 마우스 위치로 점프를 활성화
sv_se: Aktivera hopp till musposition

source: Jumping while not moving targets the mouse cursor rather than direction only.
hu_hu: Helyben ugrás esetén, az egér kurzor felé ugrik a hagyományos irányzék helyett.
ko: 이동 중이 아닐 때 점프하면 방향 뿐 아니라 마우스 커서를 타겟으로 합니다.
sv_se: Hoppa till musmarkör utan att flytta mål snarare än enbart riktning.

source: Enable font replacement
hu_hu: Betűtípus csere engedélyezése
ko: 대체 글꼴 사용
sv_se: Aktivera typsnittsersättning

source: Replaces game fonts with rendered fonts
hu_hu: A játék betűtípusait renderelt betűtípusokra cseréli
ko: 게임 글꼴을 렌더링된 글꼴로 대체
sv_se: Ersätter speltypsnitt med renderade typsnitt

source: Camera moves with Silencer
hu_hu: Kamera mozgatás hangtompítóval
ko: 카메라는 사일런서와 이동
sv_se: Kameran följer efter Silencer

source: Camera tracks the player movement rather than snapping to defined positions.
hu_hu: A kamera követi a játékos mozgását, ahelyett, hogy meghatározott helyekre ugrana.
ko: 카메라는 정의된 위치에 고정되지 않고 플레이어의 움직임을 추적합니다.
sv_se: Kameran följer spelarens rörelser snarare än att hoppa till definierade positioner.

source: Always enable Christmas easter-egg
hu_hu: Mindig engedélyezi a Karácsonyi easter-egg-et
ko: 항상 크리스마스 이스터 에그를 활성화
sv_se: Aktivera alltid julpåskägg

source: Enable the Christmas music at any time of year.
hu_hu: Engedélyezi a Karácsonyi zenét az év bármely szakában.
ko: 일 년 중 언제든지 크리스마스 음악을 활성화하세요.
sv_se: Aktivera julmusiken när som helst under året.

source: Could not find correct ultima.dat datafile
hu_hu: Nem található megfelelő ultima.dat adatfájl
ko: 올바른 ultima.dat 데이터 파일을 찾을 수 없음
sv_se: Kunde inte hitta den korrekta ultima.dat-datafilen

source: Swing
sv_se: Svinga

source: Throw
sv_se: Kasta

source: Food
sv_se: Mat

source: Rapier
sv_se: Värja

source: Axe
sv_se: Yxa

source: Shield
sv_se: Sköld

source: Bow & Arrow
sv_se: Båge och pil

source: Magic Amulet
sv_se: Magisk amulett

source: Amulet Option 1
sv_se: Amulettalternativ 1

source: Amulet Option 2
sv_se: Amulettalternativ 2

source: Amulet Option 3
sv_se: Amulettalternativ 3

source: Amulet Option 4
sv_se: Amulettalternativ 4

source: North
sv_se: Norrut

source: South
sv_se: Söderut

source: West
hu_hu: Nyugat
sv_se: Väst

source: East
hu_hu: Kelet
sv_se: Öst

source: Enter/Exit
sv_se: Gå in/ut

source: Pass/Wait
sv_se: Passera/Vänta

source: Minimap
sv_se: Minikarta

source: Move Forward
hu_hu: Mozgás előre
ko: 앞으로 이동
sv_se: Steg framåt

source: Turn Around
sv_se: Vänd om

source: Turn Left
hu_hu: Fordulás balra
ko: 왼쪽으로 회전
sv_se: Sväng vänster

source: Turn Right
hu_hu: Fordulás jobbra
ko: 오른쪽으로 회전
sv_se: Sväng höger

source: Basic Keys
sv_se: Grundläggande tangenter

source: Menu Keys
sv_se: Menytangenter

source: Overworld Keys
sv_se: Världstangenter

source: Dungeon Keys
sv_se: Fängelsehålstangenter

source: Abort action
sv_se: Avbryt handling

source: Board
sv_se: Borda

source: Descend
sv_se: Stig neråt

source: Get chest
sv_se: Hämta kista

source: Hole up & camp
sv_se: Göm dig och slå läger

source: Ignite
sv_se: Tänd

source: Locate position
sv_se: Hitta position

source: Mix reagents
sv_se: Blanda reagenser

source: New order
sv_se: Ny ordning

source: Open door
sv_se: Öppna dörr

source: Pass
sv_se: Lösenord

source: Quit and save
sv_se: Avsluta och spara

source: Ready weapon
sv_se: Klargör vapen

source: Stats
sv_se: Statistik

source: Wear armor
sv_se: Bär rustning

source: Yell
sv_se: Skrik

source: Speed up
sv_se: Öka hastighet

source: Speed down
sv_se: Sänk hastighet

source: Speed normal
sv_se: Normal hastighet

source: Combat speed up
sv_se: Öka stridshastighet

source: Combat speed down
sv_se: Sänk stridshastighet

source: Combat speed normal
sv_se: Normal stridshastighet

source: Party - None
sv_se: Grupp - Ingen

source: Party - Character #1
sv_se: Grupp - Karaktär #1

source: Party - Character #2
sv_se: Grupp - Karaktär #2

source: Party - Character #3
sv_se: Grupp - Karaktär #3

source: Party - Character #4
sv_se: Grupp - Karaktär #4

source: Party - Character #5
sv_se: Grupp - Karaktär #5

source: Party - Character #6
sv_se: Grupp - Karaktär #6

source: Party - Character #7
sv_se: Grupp - Karaktär #7

source: Party - Character #8
sv_se: Grupp - Karaktär #8

source: Destroy all creatures
sv_se: Förstör alla varelser

source: Toggle collision handling
sv_se: Växla kollisionshantering

source: Destroy object
sv_se: Förstör objekt

source: Full equipment
sv_se: Full utrustning

source: Flee combat
sv_se: Fly striden

source: Help - Teleport to Lord British
sv_se: Hjälp - Teleportera till Lord British

source: Give items
sv_se: Ge objekt

source: List karma
sv_se: Lista karma

source: Leave location
sv_se: Lämna plats

source: Give mixtures
sv_se: Ge mixturer

source: Combat encounters
sv_se: Stridande möten

source: Toggle overhead view
sv_se: Växla överblicksvy

source: Full party
sv_se: Fulltalig grupp

source: Give reagents
sv_se: Ge reagenser

source: Full stats
sv_se: Fullständig statistik

source: Create transport
sv_se: Skapa transport

source: Up level
sv_se: Upp nivå

source: Down level
sv_se: Ner nivå

source: Grant virtue
sv_se: Bevilja kraft

source: Change wind
sv_se: Ändra vind

source: loading quick save %d
hu_hu: %d gyors mentés betöltése
ko: 빠른 저장 %d 불러오기 중
sv_se: läser in snabbsparning %d

source: saving quick save %d
hu_hu: %d gyors játékállás mentése
ko: 빠른 저장 %d 저장 중
sv_se: sparar snabbsparning %d

source: Original Save
hu_hu: Eredeti mentés
ko: 원본 저장
sv_se: Originalsparning

source: Walk west
sv_se: Gå västerut

source: Walk east
sv_se: Gå österut

source: Walk north
sv_se: Gå norrut

source: Walk south
sv_se: Gå söderut

source: Walk north-east
sv_se: Gå mot nordost

source: Walk south-east
sv_se: Gå mot sydost

source: Walk north-west
sv_se: Gå mot nordväst

source: Walk south-west
sv_se: Gå mot sydväst

source: Multi-use
sv_se: Flera användningsområden

source: Select command bar
sv_se: Välj kommandorad

source: Select new command bar
sv_se: Välj ny kommandorad

source: Previous party member
sv_se: Förgående gruppmedlem

source: Next party member
sv_se: Nästa gruppmedlem

source: Home key
sv_se: Home-tangent

source: End key
sv_se: Sluttangent

source: Toggle between inventory and actor view
sv_se: Växla mellan inventarier och skådespelarvy

source: Party view
sv_se: Gruppvy

source: Party mode
sv_se: Gruppläge

source: Save menu
sv_se: Sparningsmeny

source: Load latest save
sv_se: Läs in senaste sparning

source: Show game menu; Cancel action if in middle of action
sv_se: Visa spelmeny; Avbryt handling om du är mitt i en handling

source: Toggle Cursor
sv_se: Växla markör

source: Toggle combat strategy
sv_se: Växla stridsstrategi

source: Toggle frames per second display
sv_se: Växla visning av bildfrekvens

source: Toggle audio
sv_se: Växla ljud

source: Toggle sfx
sv_se: Växla ljudeffekter

source: Toggle original style command bar
sv_se: Växla kommandofält i originalstil

source: Do action
sv_se: Gör handling

source: Cancel action
sv_se: Avbryt handling

source: Msg scroll up
sv_se: Bläddra uppåt i meddelanden

source: Msg scroll down
sv_se: Bläddra neråt i meddelanden

source: Show keys
sv_se: Visa tangenter

source: Decrease debug
sv_se: Sänk felsökning

source: Increase debug
sv_se: Öka felsökning

source: Close gumps
sv_se: Stäng gumps

source: Enter ALT code (hold)
sv_se: Ange ALT-kod (håll)

source: ALT code 0
sv_se: ALT-kod 0

source: ALT code 1
sv_se: ALT-kod 1

source: ALT code 2
sv_se: ALT-kod 2

source: ALT code 3
sv_se: ALT-kod 3

source: ALT code 4
sv_se: ALT-kod 4

source: ALT code 5
sv_se: ALT-kod 5

source: ALT code 6
sv_se: ALT-kod 6

source: ALT code 7
sv_se: ALT-kod 7

source: ALT code 8
sv_se: ALT-kod 8

source: ALT code 9
sv_se: ALT-kod 9

source: Open the asset viewer
sv_se: Öppna tillgångsvisaren

source: Show eggs
sv_se: Visa ägg

source: Toggle hack move
sv_se: Växla hack-rörelse

source: Toggle egg spawn
sv_se: Växla äggspawn

source: Toggle no darkness
sv_se: Växla inget mörker

source: Toggle pickpocket mode
sv_se: Växla ficktjuvsläge

source: Toggle god mode
sv_se: Växla gud-läge

source: Toggle ethereal mode
sv_se: Växla onaturligt läge

source: Toggle X-ray mode
sv_se: Växla röntgenläge

source: Heal party
sv_se: Läk gruppen

source: Teleport to cursor
sv_se: Teleportera till markör

source: Toggle cheats
sv_se: Växla fusk

source: Solo mode as Avatar
sv_se: Sololäge som Avatar

source: Solo mode as party member 2
sv_se: Sololäge som gruppmedlem 2

source: Solo mode as party member 3
sv_se: Sololäge som gruppmedlem 3

source: Solo mode as party member 4
sv_se: Sololäge som gruppmedlem 4

source: Solo mode as party member 5
sv_se: Sololäge som gruppmedlem 5

source: Solo mode as party member 6
sv_se: Sololäge som gruppmedlem 6

source: Solo mode as party member 7
sv_se: Sololäge som gruppmedlem 7

source: Solo mode as party member 8
sv_se: Sololäge som gruppmedlem 8

source: Solo mode as party member 9
sv_se: Sololäge som gruppmedlem 9

source: Show stats for Avatar
sv_se: Visa statistik för Avatar

source: Show stats for party member 2
sv_se: Visa statistik för gruppmedlem 2

source: Show stats for party member 3
sv_se: Visa statistik för gruppmedlem 3

source: Show stats for party member 4
sv_se: Visa statistik för gruppmedlem 4

source: Show stats for party member 5
sv_se: Visa statistik för gruppmedlem 5

source: Show stats for party member 6
sv_se: Visa statistik för gruppmedlem 6

source: Show stats for party member 7
sv_se: Visa statistik för gruppmedlem 7

source: Show stats for party member 8
sv_se: Visa statistik för gruppmedlem 8

source: Show stats for party member 9
sv_se: Visa statistik för gruppmedlem 9

source: Show inventory for Avatar
sv_se: Visa översikt för Avatar

source: Show inventory for party member 2
sv_se: Visa inventarier för gruppmedlem 2

source: Show inventory for party member 3
sv_se: Visa inventarier för gruppmedlem 3

source: Show inventory for party member 4
sv_se: Visa inventarier för gruppmedlem 4

source: Show inventory for party member 5
sv_se: Visa inventarier för gruppmedlem 5

source: Show inventory for party member 6
sv_se: Visa inventarier för gruppmedlem 6

source: Show inventory for party member 7
sv_se: Visa inventarier för gruppmedlem 7

source: Show inventory for party member 8
sv_se: Visa inventarier för gruppmedlem 8

source: Show inventory for party member 9
sv_se: Visa inventarier för gruppmedlem 9

source: Show doll gump for Avatar
sv_se: Visa doll gump för Avatar

source: Show doll gump for party member 2
sv_se: Visa doll gump för gruppmedlem 2

source: Show doll gump for party member 3
sv_se: Visa doll gump för gruppmedlem 3

source: Show doll gump for party member 4
sv_se: Visa doll gump för gruppmedlem 4

source: Show doll gump for party member 5
sv_se: Visa doll gump för gruppmedlem 5

source: Show doll gump for party member 6
sv_se: Visa doll gump för gruppmedlem 6

source: Show doll gump for party member 7
sv_se: Visa doll gump för gruppmedlem 7

source: Show doll gump for party member 8
sv_se: Visa doll gump för gruppmedlem 8

source: Show doll gump for party member 9
sv_se: Visa doll gump för gruppmedlem 9

source: Toggle unlimited casting
sv_se: Växla obegränsade besvärjelser

source: Transfer Character
hu_hu: Karakter átadása
ko: 캐릭터 전송
sv_se: Överför karaktär

source: Draw weapon / Combat
sv_se: Dra vapen / Strid

source: Move back
sv_se: Stega bakåt

source: Highlight items
sv_se: Markera objekt

source: Use bedroll
sv_se: Använd sovsäck

source: Open backpack
sv_se: Öppna ryggsäck

source: Use keyring
sv_se: Använd nyckelring

source: Open minimap
sv_se: Öppna minikarta

source: Use recall
sv_se: Använd återkallning

source: Open inventory & statistics
sv_se: Öppna inventarier och statistik

source: Close all displays
sv_se: Stäng alla skärmar

source: Jump (fake both-button-click)
sv_se: Hoppa (fejka båda-knappar-klick)

source: Careful step
sv_se: Försiktigt steg

source: Cycle through weapon inventory
sv_se: Bläddra genom vapeninventarier

source: Cycle through item inventory
sv_se: Bläddra genom objektinventarier

source: Use inventory item
sv_se: Använd inventarieobjekt

source: Use medikit
sv_se: Använd medicinlåda

source: Use energy cube
sv_se: Använd energikub

source: Detonate bomb
sv_se: Detonera bomb

source: Drop weapon
sv_se: Släpp vapen

source: Search / Select item
sv_se: Sök / Välj objekt

source: Use selection
sv_se: Använd val

source: Grab items
sv_se: Ta objekt

source: Fire weapon
sv_se: Avfyra vapen

source: Center screen on Silencer
sv_se: Centrera skärmen på Silencer

source: Jump / Roll / Crouch
sv_se: Hoppa / Rulla / Kryp

source: Short jump
sv_se: Kort hopp

source: Sidestep left
sv_se: Sidosteg åt vänster

source: Sidestep right
sv_se: Sidosteg åt höger

source: Step forward
sv_se: Stega framåt

source: Toggle crouch
sv_se: Växla krypning

source: Side step / Advance / Retreat
sv_se: Sidosteg / Avancera framåt / Retirera

source: Toggle clipping
sv_se: Växla klippning

source: Ascend
sv_se: Stig uppåt

source: Show touching items
sv_se: Visa rörande objekt

source: Show editor items
sv_se: Visa redigerarobjekt

source: Decrement map sort order
sv_se: Minska sorteringsordning på karta

source: Increment map sort order
sv_se: Öka sorteringsordning på karta

source: Toggle frame by frame
sv_se: Växla bildruta för bildruta

source: Advance frame
sv_se: Avancera bildruta

source: Toggle Avatar in stasis
sv_se: Växla avatar i stasis

source: Show shape viewer
sv_se: Visa formvisare

source: Ultima VIII Cheats
hu_hu: Ultima VIII Csalások
ko: 울티마 VIII 치트
sv_se: Ultima VIII-fusk

source: Ultima VIII Debug
hu_hu: Ultima VIII hibakereső
ko: 울티마 VIII 디버그
sv_se: Ultima VIII-felsökning

source: Crusader intro movie file missing - check that the FLICS and SOUND directories have been copied from the CD. More instructions are on the wiki: https://wiki.scummvm.org/index.php?title=Crusader:_No_Remorse.
hu_hu: A Crusader bevezető filmfájlja hiányzik – ellenőrizze, hogy a FLICS és a SOUND könyvtárak másolásra kerültek-e a CD-ről. További információkért forduljon a wikihez: https://wiki.scummvm.org/index.php?title=Crusader:_No_Remorse.
ko: 크루세이더 인트로 무비 파일이 없습니다. CD에서 FLICS 및 SOUND 디렉터리가 복사되었는지 확인하세요. 자세한 내용은 위키에 나와 있습니다: https://wiki.scummvm.org/index.php?title=Crusader:_No_Remorse
sv_se: Filmfil med Crusader-intro saknas - kontrollera tt FLICS- och SOUND-katalogerna har kopierats från cd-skivan. Mer instruktioner finns på wikisidan: https://wiki.scummvm.org/index.php?title=Crusader:_No_Remorse.

source: Missing Required File Starting a game requires SAVEGAME/U8SAVE.000 from an original installation. Please check you have copied all the files correctly.
hu_hu: Hiányzó kötelező fájl A játék indításához szükséges a SAVEGAME/U8SAVE.000 fájl az eredeti telepítésből. Ellenőrizze, hogy átmásolt e minden fájlt megfelelően.
ko: 필수 파일 누락 게임을 시작하려면 원래 설치에서 SAVEGAME/U8SAVE.000이 필요합니다. 모든 파일을 올바르게 복사했는지 확인하세요.
sv_se: Saknar nödvändig fil För att starta ett spel krävs SAVEGAME/U8SAVE.000 från en originalinstallation. Kontrollera att du har kopierat alla filer korrekt.

source: Improved click sensitivity
hu_hu: Továbbfejlesztett kattintásérzékenység
ko: 클릭 감도 개선
sv_se: Förbättrad klickkänslighet

source: Allows the mouse to be moved a short distance without cancelling click interactions. If this is off, any mouse movement while the mouse button is held cancels a click interaction.
hu_hu: Lehetővé teszi az egér kis távolságra történő mozgatását anélkül, hogy megszakítaná a kattintási interakciókat. Ha ez ki van kapcsolva, az egérgomb lenyomva tartása közben minden egérmozgás törli a kattintási interakciót.
ko: 클릭 상호작용을 취소하지 않고 마우스를 짧은 거리만큼 움직일 수 있게 합니다. 이 기능이 꺼져 있으면 마우스 버튼을 누른 상태에서 마우스를 움직이면 클릭 상호작용이 취소됩니다.
sv_se: Tillåter att musen flyttas en kort sträcka utan att avbryta klickningen. Om detta är av kommer alla musrörelse medan musknappen hålls ned att avbryta ett pågående klick.

source: Faster animations
hu_hu: Gyorsabb animációk
ko: 더 빠른 애니메이션
sv_se: Snabbare animeringar

source: Speeds up animations.
hu_hu: Animációk felgyorsítása.
ko: 애니메이션 속도가 빨라집니다.
sv_se: Snabbar upp animeringar.

source: Skip main menu
hu_hu: Fő menü átugrása
ko: 메인 메뉴 건너뛰기
sv_se: Hoppa över huvudmeny

source: Starts a new game upon launching instead of going to the main menu.
hu_hu: Indításkor új játékot indít, ahelyett hogy a fő menübe lépne.
ko: 게임을 실행하면 메인 메뉴로 이동하는 대신 새로운 게임이 시작됩니다.
sv_se: Startar ett nytt spel omedelbar istället för att gå till huvudmenyn.

source: Use 16-color graphics
hu_hu: 16 színű grafika alkalmazása
ko: 16 색 그래픽을 사용
sv_se: Använd 16-färgersgrafik

source: Uses 16-color graphics.
hu_hu: 16 színű grafika alkalmazása.
ko: 16 색 그래픽을 사용합니다.
sv_se: Använder 16-färgersgrafik.

source: Preload sounds
hu_hu: Hangok előtöltése
ko: 사전 불러오기 사운드
sv_se: Förinläs ljud

source: Preload sounds. May improve performance on slow hard drives.
hu_hu: Hangok előtöltése. Jobb teljesítményt eredményezhet lassabb merevlemezeknél.
ko: 사전 불러오기 사운드입니다. 느린 하드 드라이브에서 성능을 개선 시킬 수 있습니다.
sv_se: Förinläs ljud. Kan förbättra prestanda på långsamma hårddiskar.

source: Faster video decoder (lower quality)
hu_hu: Gyorsabb videó dekódolás (alacsonyabb minőség)
ko: 더 빠른 비디오 디코더 (낮은 품질)
sv_se: Snabbare videoavkodare (lägre kvalitet)

source: Reduce video decoding CPU usage at the cost of quality.
hu_hu: Csökkenti a processzor kihasználtságot videó dekódoláskor a minőség kárára.
ko: 품질을 낮추고 비디오 디코딩 CPU 사용량을 줄이세요.
sv_se: Minska CPU-användningen för videoavkodning på bekostnad av kvaliteten.

source: Display help screen
hu_hu: Segítség ablak megjelnítése
ko: 도움말 화면 표시
sv_se: Visa hjälpskärm

source: Open sound settings
hu_hu: Hang beállítások megnyitása
ko: 사운드 설정 열기
sv_se: Öppna ljudinställningar

source: Sound effect volume down
hu_hu: Hangeffekt hangerő LE
ko: 사운드 효과 볼륨 줄임
sv_se: Ljudeffektvolym ner

source: Sound effect volume up
hu_hu: Hangeffekt hangerő FEL
ko: 사운드 효과 볼륨 높임
sv_se: Ljudeffektvolym upp

source: Skip current animation
hu_hu: Az aktuális animáció átugrása
ko: 현재 애니메이션 건너뛰기
sv_se: Hoppa över aktuell animation

source: Cycle item in scene (debug cheat)
hu_hu: Jeleneten belül tárgy váltása (hibakereső csalás)
ko: 장면에서 아이템 순환 (디버그 치트)
sv_se: Cykla genom objekt i scenen (felsökningsfusk)

source: This game requires JPEG support, which was not compiled in.
hu_hu: Ez a játék JPEG-támogatást igényel, amely nem került lefordításra.
ko: 이 게임은 JPEG 지원이 필요하지만, 컴파일되지 않았습니다.
sv_se: Detta spel kräver JPEG-stöd, vilket inte kompilerats in.

source: Music for this game requires Ogg Vorbis support, which was not compiled in. The game will still play, but will not have any music.
hu_hu: Ehhez a játék zenéhez az Ogg Vorbis támogatása szükséges, amely nem került lefordításra. A játék továbbra is játszható, de nem lesz benne zene.
ko: 이 게임의 음악은 Ogg Vorbis 지원이 필요하지만, 컴파일되지 않았습니다. 게임은 계속 플레이되지만, 음악은 없습니다.
sv_se: Musik för detta spel kräver Ogg Vorbis-stöd, vilket inte kompilerats in. Spelet kommer fortfarande att fungera, men utan musik.

source: Music for this game requires MP3 support, which was not compiled in. The game will still play, but will not have any music.
hu_hu: A játék zenéjéhez MP3-támogatás szükséges, ami nem került lefordításra. A játék továbbra is játszható, de nem lesz benne zene.
ko: 이 게임의 음악은 MP3 지원이 필요하지만, 컴파일되지 않았습니다. 게임은 계속 플레이되지만, 음악은 없습니다.
sv_se: Musik för detta spel kräver MP3-stöd, vilket inte kompilerats in. Spelet kommer fortfarande att fungera, men utan musik.

source: Failed to load save, the save data appears to be damaged.
hu_hu: Nem sikerült betölteni a mentést, úgy tűnik, hogy a mentési adatok sérültek.
ko: 저장 데이터를 불러오는 데 실패했습니다, 저장 데이터가 손상된 것 같습니다.
sv_se: Misslyckades med att läsa in sparning, spardatan verkar vara skadad.

source: Failed to read version information from save file.
hu_hu: Nem sikerült verzió információt kinyerni a mentésből.
ko: 저장 파일에서 버전 정보를 읽는데 실패하였습니다.
sv_se: Kunde inte läsa versionsinformation från sparfil.

source: An unknown error occurred while attempting to load the saved game.
hu_hu: Ismeretlen hiba történt a mentett játék betöltése során.
ko: 저장된 게임을 불러오는 동안 알 수 없는 오류가 발생했습니다.
sv_se: Ett okänt fel inträffade vid inläsning av sparat spel.

source: Enable lockout system
hu_hu: Kizáró rendszer bekapcsolása
ko: 잠금 시스템 활성화
sv_se: Aktivera låssystem

source: Require a lockout code to start the game.
hu_hu: Egy kizárási kód szükséges a játék elindításához.
ko: 게임을 시작하려면 잠금 코드가 필요합니다.
sv_se: Kräv en låskod för att starta spelet.

source: Room keymappings
sv_se: Kortkommandon för rum

source: Camera keymappings
sv_se: Kortkommandon för kamera

source: Skip scene
sv_se: Hoppa över scen

source: View evidence
sv_se: Visa bevis

source: Exit / Put away evidence
sv_se: Avsluta / Lägg undan bevis

source: Enter room
sv_se: Gå in i rum

source: Show FPS-counter
hu_hu: Képkocka számláló megjelenítése
ko: FPS 카운터 표시
sv_se: Visa bildfrekvens

source: Show the current number of frames per second in the upper left corner
hu_hu: A jelenlegi másodpercenkénti képkocka szám kijelzése a bal felső sarokban
ko: 왼쪽 상단 모서리에 초당 현재 프레임 수를 표시
sv_se: Visar det aktuella antalet bildrutor per sekund i det övre vänstra hörnet

source: Sprite bilinear filtering (SLOW)
hu_hu: Sprite függvényes filterezése (LASSÚ)
ko: 스프라이트 이중선형 필터링 (느림)
sv_se: Bilinjär filtrering av sprite (LÅNGSAM)

source: Apply bilinear filtering to individual sprites
hu_hu: Függvényes filterezés alkalmazása egyes sprite-okon
ko: 개별 스프라이트에 이중선형 필터링을 적용
sv_se: Tillämpa bilinjär filtrering för individuella sprites

source: Force to use 2D renderer (2D games only)
hu_hu: 2D renderer használatának kényszerítése (csak 2D játékok)
ko: 2D 렌더러 사용 강제 (2D 게임에만)
sv_se: Tvinga användning av 2D-renderare (endast 2D-spel)
