Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: Clicking Disabled
hu_hu: Kattintás tiltva
ko: 클릭 비활성됨
sv_se: Klickning inaktiverad

source: Touchscreen 'Tap Mode' - Left Click
hu_hu: Érintőképernyő 'Tapi Mód' - Bal kattintás
ko: 터치스크린 '탭 모드' - 왼쪽 클릭
sv_se: Pekskärm "Tap-läge" - Vänsterklick

source: Touchscreen 'Tap Mode' - Right Click
hu_hu: Érintőképernyő 'Tapi Mód' - Jobb kattintás
ko: 터치스크린 '탭 모드' - 오른쪽 클릭
sv_se: Pekskärm "Tap-läge" - Högerklick

source: Touchscreen 'Tap Mode' - Hover (No Click)
hu_hu: Érintőképernyő 'Tapi Mód' - Lebegő (Nincs kattintás)
ko: 터치스크린 '탭 모드' - 호버 (클릭 아님)
sv_se: Pekskärm"Tap-läge" - Hover (utan klick)

source: Touchscreen 'Tap Mode' - Hover (DPad Clicks)
hu_hu: Érintőképernyő 'Tapi mód' - Lebegő (DPad kattintás)
ko: 터치스크린 '탭 모드' - 호버 (십자 패드 클릭)
sv_se: Pekskärm'Tap-läge' - Hover (DPad-klick)

source: Add a new folder
hu_hu: Új mappa
ko: 새 폴더 추가
sv_se: Lägg till en ny mapp

source: Choose a new folder
hu_hu: Új mappa kiválasztása
ko: 새 폴더를 선택
sv_se: Välj en ny mapp

source: Toggle aspect ratio correction
hu_hu: Képarány korrekció váltása
ko: 화면비 교정 전환
sv_se: Växla korrigering av bildförhållande

source: Center
hu_hu: Közép
ko: 중앙
sv_se: Centrera

source: Pixel-perfect scaling
hu_hu: Ideális-pixel méretezés
ko: 픽셀 단위의 완벽한 크기 조정
sv_se: Pixelperfekt skalning

source: Even pixels scaling
hu_hu: Egyenletes pixel méretezés
ko: 픽셀 크기 조정
sv_se: Jämn bildpunktsskalning

source: Fit to window
hu_hu: Ablak szintű nagyítás
ko: 창 크기에 맞춤
sv_se: Anpassa till fönster

source: Stretch to window
hu_hu: Ablak szintű nyújtás
ko: 창에 맞게 늘리기
sv_se: Sträck ut till fönsterstorlek

source: Fit to window (4:3)
hu_hu: Ablak szintű nagyítás (4:3)
ko: 창 크기에 맞춤 (4:3)
sv_se: Anpassa till fönster (4:3)

source: Resolution: %dx%d
hu_hu: Felbontás: %dx%d
ko: 해상도: %dx%d
sv_se: Upplösning: %dx%d

source: Active graphics filter:
hu_hu: Aktív grafikus filterek:
ko: 활성 그래픽 필터:
sv_se: Aktivt grafikfilter:

source: Enabled aspect ratio correction
hu_hu: Méretarány korrekció engedélyezve
ko: 화면비 교정 활성화
sv_se: Aktiverade korrigering av bildförhållande

source: Disabled aspect ratio correction
hu_hu: Méretarány korrekció kikapcsolva
ko: 화면비 교정 비활성화
sv_se: Inaktiverade korrigering av bildförhållande

source: Filtering enabled
hu_hu: Filter-ezés engedélyezve
ko: 필터링 활성화
sv_se: Filtrering aktiverad

source: Filtering disabled
hu_hu: Filter-ezés kikapcsolva
ko: 필터링 비활성화
sv_se: Filtrering inaktiverad

source: Stretch mode
hu_hu: Nyújtás mód
ko: 늘리기 모드
sv_se: Utdraget läge

source: SDL Surface (forced 8bpp mode)
hu_hu: SDL Felület (kényszerített 8bpp mód)
ko: SDL 표면 (강제 8bpp 모드)
sv_se: SDL Surface (tvingat 8bpp-läge)

source: Saved screenshot '%s'
hu_hu: '%s' képernyőkép mentve
ko: '%s' 스크린샷 저장되었음
sv_se: Sparade skärmbilden '%s'

source: Could not save screenshot
hu_hu: Sikertelen képernyőkép mentés
ko: 스크린샷을 저장할 수 없음
sv_se: Kunde inte spara skärmbild

source: Windowed mode
hu_hu: Ablakos mód
ko: 창 모드
sv_se: Fönsterläge

source: Toggle fullscreen
hu_hu: Teljesképernyős kapcsoló
ko: 전체화면 전환
sv_se: Växla helskärmsläge

source: Toggle mouse capture
hu_hu: Egér rögzítés kapcsoló
ko: 마우스 캡처 전환
sv_se: Växla musfångst

source: Toggle resizable window
hu_hu: Újra-méretezhető ablak bekapcsolása
ko: 크기 조절 가능한 창 전환
sv_se: Växla storleksändringsbart fönster

source: Save screenshot
hu_hu: Képernyőkép mentése
ko: 스크린샷 저장
sv_se: Spara skärmbild

source: Toggle linear filtered scaling
hu_hu: Lineáris filter méretezés kapcsoló
ko: 선형 필터 크기 조정 전환
sv_se: Växla linjärt filtrerad skalning

source: Cycle through stretch modes
hu_hu: Kinyújtási módok közötti váltás
ko: 늘리기 모드간 순환
sv_se: Byt till nästa utsträckningsläge

source: Increase the scale factor
hu_hu: Méretező tényező növelése
ko: 확대/축소 비율 증가
sv_se: Öka skalningsfaktorn

source: Decrease the scale factor
hu_hu: Méretező tényező csökkentése
ko: 확대/축소 비율 감소
sv_se: Minska skalningsfaktorn

source: Switch to the next scaler
hu_hu: Váltás a következő skálázóra
ko: 다음 크기 조정 전환
sv_se: Byt till nästa skalare

source: Switch to the previous scaler
hu_hu: Váltás az előző skálázóra
ko: 이전 크기 조정 전환
sv_se: Byt till föregående skalare

source: Left mouse button
hu_hu: Bal egérgomb
sv_se: Vänster musknapp

source: Right mouse button
hu_hu: Jobb egérgomb
sv_se: Höger musknapp

source: Middle mouse button
sv_se: Mittenmusknapp

source: Mouse wheel up
sv_se: Rullningshjul upp

source: Mouse wheel down
sv_se: Rullningshjul ned

source: X1 mouse button
sv_se: X1-musknapp

source: X2 mouse button
sv_se: X2-musknapp

source: Left stick
sv_se: Vänsterspak

source: Right stick
sv_se: Högerspak

source: Left shoulder
sv_se: Vänster axelknapp

source: Right shoulder
sv_se: Höger axelknapp

source: D-pad up
sv_se: Riktningsknapp upp

source: D-pad down
sv_se: Riktningsknapp ner

source: D-pad left
sv_se: Riktningsknapp vänster

source: D-pad right
sv_se: Riktningsknapp höger

source: D-pad center
sv_se: Riktningsknapp center

source: Left trigger
sv_se: Vänster avtryckare

source: Right trigger
sv_se: Höger avtryckare

source: Left stick X
sv_se: Vänsterspak X

source: Left stick Y
sv_se: Vänsterspak Y

source: Right stick X
sv_se: Högerspak X

source: Right stick Y
sv_se: Högerspak Y

source: Hat X
hu_hu: Kalap X
ko: 햇 X
sv_se: Ministick X

source: Hat Y
hu_hu: Kalap Y
ko: 햇 Y
sv_se: Ministick Y

source: Reset to defaults
hu_hu: Visszaállítás alapértelmezettre
ko: 기본값으로 재설정
sv_se: Återställ standard

source: Clear mapping
hu_hu: Mapping törlése
ko: 맵핑 지우기
sv_se: Töm mappning

source: Virtual mouse up
hu_hu: Virtuális egér fel
ko: 가상 마우스 위쪽
sv_se: Virtuell mus upp

source: Virtual mouse down
hu_hu: Virtuális egér le
ko: 가상 마우스 아래쪽
sv_se: Virtuell mus ned

source: Virtual mouse left
hu_hu: Virtuális egér balra
ko: 가상 마우스 왼쪽
sv_se: Virtuell mus vänster

source: Virtual mouse right
hu_hu: Virtuális egér jobbra
ko: 가상 마우스 오른쪽
sv_se: Virtuell mus höger

source: Slow down virtual mouse
hu_hu: Virtuális egér lassítása
ko: 가상 마우스 속도 감소
sv_se: Sakta ner virtuell mus

source: Can't create directory here!
hu_hu: Itt nem hozható létre könyvtár!
ko: 여기에 디렉터리를 만들 수 없습니다!
sv_se: Kan inte skapa katalog här!

source: Invalid path!
hu_hu: Érvénytelen útvonal!
ko: 잘못된 경로입니다!
sv_se: Ogiltig sökväg!

source: Parent directory doesn't exists!
hu_hu: A szülő könyvtár nem létezik!
ko: 상위 디렉터리가 존재하지 않습니다!
sv_se: Överliggande katalog finns inte!

source: Can't create a directory within a file!
hu_hu: Nem hozhat létre könyvtárat fájlon belül!
ko: 파일 내에 디렉터리를 만들 수 없습니다!
sv_se: Kan inte skapa katalog inuti en fil!

source: There is a file with that name in the parent directory!
hu_hu: Már van egy ilyen nevű fájl a szülő könyvtárban!
ko: 상위 디렉터리에 해당 이름의 파일이 있습니다!
sv_se: En fil med det namnet finns redan på samma plats!

source: Failed to create the directory!
hu_hu: Nem sikerült létrehozni a könyvtárat!
ko: 디렉터리 만들기에 실패했습니다!
sv_se: Kunde inte skapa katalogen!

source: Directory created successfully!
hu_hu: A könyvtár sikeresen létrehozva!
ko: 디렉터리 만들기에 성공했습니다!
sv_se: Katalog skapades!

source: Back to parent directory
hu_hu: Vissza a szülő könyvtárba
ko: 상위 디렉터리로 돌아가기
sv_se: Tillbaka till överliggande katalog

source: The file doesn't exist!
hu_hu: A fájl nem létezik!
ko: 파일이 존재하지 않습니다!
sv_se: Filen finns inte!

source: Can't download a directory!
hu_hu: Nem lehet letölteni egy könyvtárat!
ko: 디렉터리를 다운로드할 수 없습니다!
sv_se: Kan inte hämta ner en katalog!

source: Failed to read the file!
hu_hu: A fájl nem olvasható!
ko: 파일 읽기에 실패했습니다!
sv_se: Kunde inte läsa filen!

source: The page is not available without the resources. Make sure file wwwroot.zip from ScummVM distribution is available in 'themepath'.
hu_hu: Az oldal források nélkül nem érhető el. Győződjön meg arról, hogy a ScummVM tárolóból származó wwwroot.zip fájl elérhető a 'themepath'-ban.
ko: 이 페이지는 리소스 없이 사용할 수 없습니다. ScummVM 배포판의 파일 wwwroot.zip이 'themepath'에서 사용 가능한지 확인하세요.
sv_se: Sidan är inte tillgänglig utan resursfilerna. Kontrollera att den medföljande filen wwwroot.zip ligger i 'themepath'.

source: Create directory
hu_hu: Új mappa létrehozása
ko: 디렉터리 만들기
sv_se: Skapa katalog

source: Upload files
hu_hu: Fájlok feltöltése
ko: 파일 업로드
sv_se: Skicka upp filer

source: Type new directory name:
hu_hu: Adja meg az új könyvtár nevét:
ko: 새로운 디렉터리 이름을 입력:
sv_se: Ange nytt katalognamn:

source: Select a file to upload:
hu_hu: Válassza ki a feltöltendő fájlt:
ko: 업로드할 파일을 선택:
sv_se: Välj en fil att skicka upp:

source: Or select a directory (works in Chrome only):
hu_hu: Vagy válasszon egy mappát (csak Chrome-ban működik):
ko: 또는 디렉터리를 선택 (크롬에서만 작동):
sv_se: Eller välj en katalog (fungerar endast i Chrome):

source: Index of
hu_hu: Indexe
ko: 다음의 색인
sv_se: Index för

source: Error occurred
hu_hu: Hiba lépett fel
ko: 오류 발생함
sv_se: Fel inträffade

source: File system root
hu_hu: Fájlrendszer gyökér
ko: 파일 시스템 루트
sv_se: Filsystemsrot

source: Saved games
hu_hu: Mentett játékok
ko: 저장된 게임
sv_se: Sparade spel

source: Parent directory
hu_hu: Szülő könyvtár
ko: 상위 디렉터리
sv_se: Överliggande katalog

source: ScummVM couldn't list the directory you specified.
hu_hu: A ScummVM nem tudta listázni a megadott könyvtárat.
ko: ScummVM이 지정한 디렉터리를 나열할 수 없습니다.
sv_se: ScummVM kunde inte lista katalogen du angav.

source: Index of
hu_hu: indexe
ko: 다음의 색인
sv_se: Index för

source: This is a local webserver index page.
hu_hu: Ez egy helyi webszerver index oldala.
ko: 이것은 로컬 웹서버 색인 페이지입니다.
sv_se: Det här är en indexsida från en lokal webbserver.

source: Open Files manager
hu_hu: Fájlkezelő megnyitása
ko: 파일 관리자 열기
sv_se: Öppna filhanteraren

source: The parent directory doesn't exist!
hu_hu: Nem létező szülő könyvtár!
ko: 상위 디렉터리가 존재하지 않습니다!
sv_se: Överliggande katalog finns inte!

source: Can't upload into a file!
hu_hu: Nem lehet fájlba feltölteni!
ko: 파일을 업로드할 수 없습니다!
sv_se: Kan inte skicka upp till en fil!

source: Back to the files manager
hu_hu: Vissza a Fájlkezelőhöz
ko: 파일 관리자로 돌아가기
sv_se: Tillbaka till filhanteraren

source: Failed to start local webserver. Check whether selected port is not used by another application and try again.
hu_hu: Nem sikerült elindítani a helyi webszervert. Ellenőrizze, hogy a kiválasztott portot nem használja-e egy másik program, és próbálja újra.
ko: 로컬 웹서버를 시작하는데 실패했습니다. 선택한 포트를 다른 애플리케이션이 사용하고 있는지 확인 후 다시 시도해 주세요.
sv_se: Misslyckades att starta lokal webbserver. Kontrollera att vald port inte används av en annan applikation och försök igen.

source: Invalid request: headers are too long!
hu_hu: Érvénytelen kérés: a fejlécek túl hosszúak!
ko: 잘못된 요청: 헤더가 너무 깁니다!
sv_se: Ogiltig förfrågan: headers är för långa!

source: Failed to upload the file!
hu_hu: Nem sikerült feltölteni a fájlt!
ko: 파일 업로드에 실패했습니다!
sv_se: Kunde inte skicka upp filen!

source: No file was passed!
hu_hu: Fájl nem került átadásra!
ko: 파일이 전달되지 않았습니다!
sv_se: Ingen fil skickades!

source: Uploaded successfully!
hu_hu: Sikeresen feltöltés!
ko: 성공적으로 업로드되었습니다!
sv_se: Sändningen lyckades!

source: Show mouse cursor
hu_hu: Egérkurzor mutatása
ko: 마우스 커서 표시
sv_se: Visa muspekare

source: Snap to edges
hu_hu: Élekhez igazítás
ko: 가장자리에 스냅
sv_se: Fäst till kanter

source: Stretch to fit
hu_hu: Nyújtás margóig
ko: 화면에 맞게 늘림
sv_se: Sträck ut för att passa

source: Use Screen:
hu_hu: Ezen képernyő használata:
ko: 화면 사용:
sv_se: Använd skärm:

# 3ds-screen
source: Top
hu_hu: Legfelső
ko: 위쪽
sv_se: Topp

# 3ds-screen
source: Bottom
hu_hu: Legalsó
ko: 아래쪽
sv_se: Botten

# 3ds-screen
source: Both
hu_hu: Mindkettő
ko: 둘 다
sv_se: Båda

source: Select
hu_hu: Megtekintés gomb
ko: 선택 버튼
sv_se: Välj

source: Start
hu_hu: Menü Gomb
ko: 시작 버튼
sv_se: Starta

source: D-pad Up
hu_hu: Irányválasztó Fel
ko: 십자 패드 위쪽
sv_se: Riktningsknapp upp

source: D-pad Down
hu_hu: Irányválasztó Le
ko: 십자 패드 아래쪽
sv_se: Riktningsknapp ner

source: D-pad Left
hu_hu: Irányválasztó Bal
ko: 십자 패드 왼쪽
sv_se: Riktningsknapp vänster

source: D-pad Right
hu_hu: Irányválasztó Jobb
ko: 십자 패드 오른쪽
sv_se: Riktningsknapp höger

source: Touch
hu_hu: Érintés
ko: 터치
sv_se: Peka

source: Toggle Drag Mode
hu_hu: Húzási mód váltó
ko: 드래그 모드 전환
sv_se: Växla dragläge

source: Toggle Magnify Mode
hu_hu: Nagyítás Mód váltó
ko: 돋보기 모드 전환
sv_se: Växla förstoringsläge

source: Magnify Mode Off. Reactivating Drag Mode. Returning to Launcher...
hu_hu: Nagyítás mód Ki. Húzás mód újra aktiválása. Visszatérés az Indítóba...
ko: 돋보기 모드 끔. 드래그 모드를 재활성화합니다. 런처로 돌아가는 중...
sv_se: Förstoringsläge av. Återaktiverar dragläge. Återvänder till spelstartaren...

source: Magnify Mode Off. Returning to Launcher...
hu_hu: Nagyítás mód Ki. Visszatérés az Indítóba...
ko: 돋보기 모드 끔. 런처로 돌아가는 중...
sv_se: Förstoringsläge av. Återvänder till spelstartaren...

source: Hover Mode
hu_hu: Lebegő mód
ko: 호버 모드
sv_se: Hovringsläge

source: Drag Mode
hu_hu: Húzás mód
ko: 드래그 모드
sv_se: Dragläge

source: Cannot Switch to Drag Mode while Magnify Mode is On
hu_hu: Nem válthat Húzás módba, amíg a Nagyítás aktív
ko: 돋보기 모드가 켜져있는 동안에는 드래그 모드로 전환할 수 없음
sv_se: Kan inte växla till dragläge medan förstoringsläge är på

source: Magnify Mode cannot be activated in menus.
hu_hu: A Nagyítás mód nem aktiválható a menükben.
ko: 돋보기 모드는 메뉴에서 활성화할 수 없습니다.
sv_se: Förstoringsläge kan inte aktiveras i menyerna.

source: Magnify Mode can only be activated when both screens are enabled.
hu_hu: A Nagyítás mód csak akkor aktiválható, ha mindkét képernyő engedélyezve van.
ko: 두 화면이 모두 활성화된 경우에만 돋보기 모드가 활성화될 수 있습니다.
sv_se: Förstoringsläge kan endast aktiveras när båda skärmarna är aktiverade.

source: In-game resolution too small to magnify.
hu_hu: A játékon belüli felbontás túl kicsi a nagyításhoz.
ko: 돋보기를 사용하기에는 게임 내 해상도가 너무 작습니다.
sv_se: Upplösning i spelet är för liten för att förstoras.

source: Magnify Mode On. Switching to Hover Mode...
hu_hu: Nagyítás mód be. Váltás lebegő módra...
ko: 돋보기 모드 켬. 호버 모드로 전환 중...
sv_se: Förstoringsläge på. Växlar till hovringsläge...

source: Magnify Mode On
hu_hu: Nagyítás mód Be
ko: 돋보기 모드 켬
sv_se: Förstoringsläge på

source: Magnify Mode Off. Reactivating Drag Mode...
hu_hu: Nagyítás mód ki. Húzás Mód újra aktiválása...
ko: 돋보기 모드 끔. 드래그 모드를 재활성화 중...
sv_se: Förstoringsläge av. Återaktiverar dragläge...

source: Magnify Mode Off
hu_hu: Nagyítás Mód Ki
ko: 돋보기 모드 끔
sv_se: Förstoringsläge av

source: Getting help
hu_hu: Segítség kérése
ko: 도움 받기
sv_se: Be om hjälp

source: ## Help, I'm lost! First, make sure you have the games and necessary game files ready. Check the **Where to Get the Games** section under the **General** tab. Once obtained, follow the steps outlined in the **Adding Games** tab to finish adding them on this device. Take a moment to review this process carefully, as some users encountered challenges here owing to recent Android changes. Need more help? Refer to our [online documentation for Android](https://docs.scummvm.org/en/latest/other_platforms/android.html). Got questions? Swing by our [support forums](https://forums.scummvm.org/viewforum.php?f=17) or hop on our [Discord server](https://discord.gg/4cDsMNtcpG), which includes an [Android support channel](https://discord.com/channels/581224060529148060/1135579923185139862). Oh, and heads up, many of our supported games are intentionally tricky, sometimes mind-bogglingly so. If you're stuck in a game, think about checking out a game walkthrough. Good luck!
hu_hu: ## Segítség, elvesztem! Első körben győződjön meg, hogy rendelkezésre áll a játék és annak fájljai. Tekintse át a **Honnan szerezzem be a játékokat** szekciót az **Általános** fül alatt. Beszerzést követően kövesse a kiemelt lépéseket a **Játékok hozzáadása**. Figyelmesen tekintse át, mert visszajelzések szerint az új Android változások miatt sokan futott bele hibákba. Szüksége van még további segítségre? Tanulmányozza az [Android-os online dokumentációnkat](https://docs.scummvm.org/en/latest/other_platforms/android.html). Kérdése van? Nézzen be a [támogatói fórumunkra](https://forums.scummvm.org/viewforum.php?f=17) vagy nézzen fel a [Discord szerverünkre](https://discord.gg/4cDsMNtcpG), ahol található egy dedikált [Android támogatói alcsatorna](https://discord.com/channels/581224060529148060/1135579923185139862). Azonban maguk a támogatott játékok szándékosan furmányosak, néma már majdnem észveszejtő szinten. Ha végleg el van akadva egy játékban, érdemes megtekinteni egy végigjátszást. Sok sikert!
ko: ## 도와주세요, 길을 잃었어요! 먼저 게임과 필요한 게임 파일을 준비했는지 확인하세요. **일반** 탭 아래의 **게임을 얻는 곳** 섹션을 확인하세요. 게임을 얻으면 **게임 추가** 탭에 설명된 단계에 따라 이 기기에 게임을 추가하는 것을 완료하세요. 최근 안드로이드 변경 사항으로 인해 일부 사용자가 여기에서 문제에 직면했으므로 이 프로세스를 주의 깊게 검토하는 데 잠시 시간을 내세요. 더 많은 도움이 필요한가요? [안드로이드용 온라인 설명서](https://docs.scummvm.org/en/latest/other_platforms/android.html)를 참조하세요. 질문이 있나요? [지원 포럼](https://forums.scummvm.org/viewforum.php?f=17)에 들러보거나 [안드로이드 지원 채널](https://discord.com/channels/581224060529148060/1135579923185139862)이 포함된 [디스코드 서버](https://discord.com/channels/581224060529148060/1135579923185139862)에 접속해 보세요. 아, 그리고 주의하세요. 지원하는 게임 중 다수는 의도적으로 까다롭고, 때로는 정신이 아찔할 정도로 까다롭습니다. 게임에 막혔다면 게임 연습을 확인해 보세요. 행운을 빕니다!
sv_se: ## Hjälp, vad gör jag nu! Först måste du se till att du har spelen och de nödvändiga spelfilerna redo. Se avsnittet **Var får jag tag på spelen** under fliken **Allmänt**. När du har skaffat spelen följer du stegen på fliken **Lägga till spel** för att lägga till dem på den här enheten. Ta en stund att granska denna process noggrant, eftersom vissa användare stötte på utmaningar här på grund av de senaste Android-förändringarna. Behöver du mer hjälp? Se vår [online-dokumentation för Android](https://docs.scummvm.org/en/latest/other_platforms/android.html). Har du några frågor? Besök våra [supportforum](https://forums.scummvm.org/viewforum.php?f=17) eller hoppa in på vår [Discord-server](https://discord.gg/4cDsMNtcpG), som har en [Android-supportkanal](https://discord.com/channels/581224060529148060/1135579923185139862). Många av de spel som vi stöder är avsiktligt svåra, ibland helt förbluffande svåra. Om du fastnar i ett spel, fundera på att kolla in en spelgenomgång. Vi önskar dig lycka till!

source: Touch Controls
hu_hu: Érintő irányítás
ko: 터치 조작
sv_se: Pekkontroller
