Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: You're missing a Riven executable. The Windows executable is 'riven.exe' or 'rivendmo.exe'.
hu_hu: Hiányzik a Riven futtató fájlja. A Windows futtató fájl neve 'riven.exe' vagy 'rivendmo.exe'.
ko: Riven 실행 파일이 없습니다. 윈도우즈용 실행 파일은 'riven.exe' 또는 'rivendmo.exe'입니다.
sv_se: Du saknar en körbar Riven-fil. Den körbara filen för Windows är ”riven.exe” eller ”rivendmo.exe”.

source: Using the 'arcriven.z' installer file also works. In addition, you can use the Mac 'Riven' executable.
hu_hu: Az 'arcriven.z' telepítő fájl is használható. Ezen felül használható még a 'Riven' Mac indítófájl.
ko: 'arcriven.z' 설치 프로그램 파일을 사용하는 것도 효과적입니다. 추가로 맥용 'Riven' 실행 파일을 사용할 수 있습니다.
sv_se: Det går även bra med installationsfilen 'arcriven.z', eller Macintoshprogrammet 'Riven'.

source: You're missing 'extras.mhk'. Using the 'arcriven.z' installer file also works.
hu_hu: Hiányzik az 'extras.mhk'. A telepítő 'arcriven.z' fájlja is használható.
ko: 'extras.mhk' 파일이 없습니다. 'arcriven.z' 설치 프로그램 파일을 사용해도 됩니다.
sv_se: Du saknar filen 'extras.mhk'. Det går även bra att använda installationsfilen 'arcriven.z' i stället.

source: You are missing the following required Riven data files:
hu_hu: A következő szükséges Riven adatfájlok hiányoznak:
ko: 다음의 필수 Riven 데이터 파일이 없습니다:
sv_se: Du saknar följande nödvändiga datafiler för Riven:

source: Move forward left
hu_hu: Mozgás bal-előre
ko: 왼쪽 앞으로 이동
sv_se: Flytta framåt till vänster

source: Move forward right
hu_hu: Mozgás jobb-előre
ko: 오른쪽 앞으로 이동
sv_se: Flytta framåt till höger

source: Play intro videos
hu_hu: Bevezető videók lejátszása
ko: 인트로 비디오 재생
sv_se: Spela upp introvideor

source: Exploration beyond this point available only within the full version of the game.
hu_hu: A további felderítés ezen a ponton túl csak a játék teljes verziójával elérhető.
ko: 현 시점 이후의 탐험은 정식 버전의 게임에서만 가능합니다.
sv_se: För fortsatt utforskande efter denna punkten krävs den fullständiga versionen av spelet.

source: At this point, the Riven Demo would ask if you would like to open a web browser to bring you to the Red Orb store to buy the game. ScummVM cannot do that and the site no longer exists.
hu_hu: Ennél a pontnál a Riven demója rákérdez, hogy meg akarja-e nyitni a böngészőjében a Red Orb boltját, hogy megvegye a játékot. A ScummVM nem teszi ezt meg, legfőképp mivel az oldal már nem létezik.
ko: 현 시점에서 Riven 데모는 게임을 구매하기 위해 웹 브라우저를 열어 Red Orb 스토어로 이동할지 묻습니다. ScummVM은 이를 수행할 수 없으며 해당 사이트는 더 이상 존재하지 않습니다.
sv_se: Här skulle Riven-demon ha frågat om du vill öppna en webbläsare för att gå in på Red Orb-butiken och köpa spelet. Det här går inte i ScummVM, och sidan i fråga finns inte längre.

source: 16:9 widescreen mod
hu_hu: 16:9 szélesvásznú mód
ko: 16:9 와이드스크린 개조
sv_se: 16:9 bredbildsmodifiering

source: Removes letterboxing and moves some display elements, improving coverage on widescreen displays
hu_hu: Eltávolítja a képlevágásokat és áthelyez egyes elemeket, ezzel jobban kitöltve a szélesvásznú képet
ko: 레터박싱을 제거하고 일부 디스플레이 요소를 이동하여 와이드스크린 디스플레이의 적용 범위를 개선함
sv_se: Tar bort letterboxing och flyttar vissa skärmelement, vilket förbättrar täckningen på bredbildsskärmar

source: Improved music mixing
hu_hu: Továbbfejlesztett zenekeverés
ko: 개선된 음악 믹싱
sv_se: Förbättrad musikmixning

source: Enables dynamic MIDI mixer, improving quality, but behaving less like mTropolis Player.
hu_hu: Lehetővé teszi a dinamikus MIDI keverőt, javítva a minőséget, de kevésbé viselkedik úgy, mint az mTropolis Player.
ko: 다이내믹 미디 믹서를 활성화하여, 품질을 향상시키지만, mTropolis 플레이어와는 다르게 작동합니다.
sv_se: Aktiverar dynamisk MIDI-mixer, vilket förbättrar kvaliteten, men beter sig mindre som mTropolis Player.

source: Autosave at progress points
hu_hu: Automatikus mentés az előrehaladás-pontoknál
ko: 진행 지점에서 자동 저장
sv_se: Autospara vid framstegspunkter

source: Automatically saves the game after completing puzzles and chapters.
hu_hu: A rejtvények és fejezetek befejezése után automatikusan elmenti a játékot.
ko: 퍼즐과 챕터를 완료한 후 자동으로 게임을 저장합니다.
sv_se: Spelet sparas automatiskt när du har klarat av pussel och kapitel.

source: Enable short transitions
hu_hu: Rövid átmenetek engedélyezése
ko: 짧은 전환을 활성화
sv_se: Aktivera korta övergångar

source: Enables transitions that are set to maximum rate instead of skipping them.
hu_hu: Engedélyezi a maximális sebességre beállított átmeneteket ahelyett, hogy kihagyná őket.
ko: 건너뛰지 않고 최대 속도로 설정된 전환을 활성화합니다.
sv_se: Aktiverar övergångar som är inställda på maximal hastighet i stället för att hoppa över dem.

source: Enable subtitles for important sound effects
hu_hu: Engedélyezi a feliratokat a fontos hangeffektusokhoz
ko: 중요한 사운드 효과에 자막을 활성화
sv_se: Aktivera undertexter för viktiga ljudeffekter

source: Enables subtitles for important sound effects. This may reduce the difficulty of sound recognition puzzles and minigames.
hu_hu: Feliratokat engedélyez a fontos hangeffektusokhoz. Ez csökkentheti a hangfelismerő rejtvények és minijátékok nehézségét.
ko: 중요한 사운드 효과에 대한 자막을 활성화합니다. 이렇게 하면 사운드 인식 퍼즐과 미니게임의 난이도가 낮아질 수 있습니다.
sv_se: Aktiverar undertexter för viktiga ljudeffekter. Detta kan minska svårighetsgraden för pussel och minispel med ljudigenkänning.

source: Start with debugger
hu_hu: Kezdés a hibakeresővel
ko: 디버거로 시작
sv_se: Starta med felsökaren

source: Starts with the debugger dashboard active.
hu_hu: Aktív hibakereső irányítópulttal indul.
ko: 디버거 대시보드가 활성화된 상태에서 시작합니다.
sv_se: Startar med felsökarens anslagstavla aktiv.

source: Toggle debug overlay
hu_hu: Hibakereső felület be- és kikapcsolása
ko: 디버그 오버레이 전환
sv_se: Växla felsökningsöverlägg

source: Force any playing movies to end
hu_hu: Bármely éppen lejátszott átvezető leállítása
ko: 재생 중인 동영상 강제로 종료
sv_se: Tvinga alla uppspelade filmer att avslutas

source: This game requires MPEG video support for some content but MPEG video support was not compiled in. The game will still play, but MPEG videos will not work.
hu_hu: A játék számára szükséges az MPEG videó támogatás egyes tartalmakhoz, azonban ez nem került lefordításra. A játék működik, de az MPEG fájlok nem kerülnek lejátszásra.
ko: 이 게임은 일부 콘텐츠에 대해 MPEG 비디오 지원이 필요하지만 MPEG 비디오 지원이 컴파일되지 않았습니다. 게임은 계속 플레이되지만 MPEG 비디오는 작동하지 않습니다.
sv_se: Detta spel kräver MPEG-videostöd för en del innehåll men MPEG-videostöd har inte kompilerats in. Spelet kommer fortfarande att gå att spela, men MPEG-videor kommer inte att fungera.

source: This game requires MPEG audio support for some content but MPEG audio support was not compiled in. The game will still play, but some audio will not work.
hu_hu: A játék számára szükséges az MPEG hang támogatás egyes tartalmakhoz, azonban ez nem került lefordításra. A játék működik, de az MPEG hangok nem kerülnek lejátszásra.
ko: 이 게임은 일부 콘텐츠에 대해 MPEG 오디오 지원이 필요하지만 MPEG 오디오 지원이 컴파일되지 않았습니다. 게임은 계속 플레이되지만 일부 오디오는 작동하지 않습니다.
sv_se: Detta spel kräver MPEG-ljudstöd för en del innehåll men MPEG-ljudstöd har inte kompilerats in. Spelet kommer fortfarande gå att spela, men en del ljud kommer inte att fungera.

source: Failed to read version information from save file
hu_hu: Nem sikerült a mentés verziószámának beolvasása
ko: 저장 파일에서 버전 정보를 읽기 실패함
sv_se: Kunde inte läsa versionsinformation från sparfil

source: Failed to load save, the save file doesn't contain valid version information.
hu_hu: Nem sikerült betölteni a mentést, a mentési fájl nem tartalmaz érvényes verzióinformációkat.
ko: 저장 파일을 불러오는 데 실패했습니다. 저장 파일에 유효한 버전 정보가 없습니다.
sv_se: Misslyckades med att läsa in sparning, sparfilen innehåller inte giltig versionsinformation.

source: Saved game was created with an earlier, incompatible version of ScummVM. Unable to load.
hu_hu: A játékmentés a ScummVM egy régebbi, nem kompatibilis verziójával készült. Nem tölthető be.
ko: 저장된 게임은 이전의 호환되지 않는 ScummVM 버전으로 생성되었습니다. 불러올 수 없습니다.
sv_se: Sparat spel skapades med en tidigare, inkompatibel version av ScummVM. Kunde inte läsa in.

source: Failed to load save, an error occurred when reading the save game data.
hu_hu: Nem sikerült betölteni a mentést, hiba történt a mentési játékadatok beolvasásakor.
ko: 저장 데이터를 불러오는 데 실패했습니다. 저장 게임 데이터를 읽는 중 오류가 발생했습니다.
sv_se: Misslyckades med att läsa in sparat spel, ett fel uppstod vid läsning av sparat speldata.

source: An internal error occurred while attempting to write save game data
hu_hu: Belső hiba történt a mentett játékadatok írása közben
ko: 게임 저장 데이터를 쓰는 중 내부 오류가 발생함
sv_se: Ett internt fel uppstod vid försök att skriva sparat speldata

source: An error occurred while writing the save game
hu_hu: Hiba történt a játék mentés írása közben
ko: 저장 게임을 쓰는 동안 오류가 발생함
sv_se: Ett fel inträffade vid skrivning av sparat spel

source: Image Viewer
hu_hu: Kép nézegető
ko: 이미지 뷰어
sv_se: Bildvisare

source: Unable to locate the '%s' engine data file
hu_hu: Nem található '%s' motor adatfájl
ko: '%s' 엔진 데이터 파일을 찾을 수 없음
sv_se: Kunde inte hitta spelmotorns datafil för '%s'

source: PS2 version is not yet supported
hu_hu: A PS2 verzió még nem támogatott
ko: PS2 버전은 아직 지원되지 않았음
sv_se: PS2-versionen stöds ännu inte

source: Widescreen mod
hu_hu: Szélesvásznú mód
ko: 와이드 스크린 개조
sv_se: Bredbildsmodifiering

source: Enable widescreen rendering in fullscreen mode.
hu_hu: Engedélyezi a szélesvásznú megjelenítést teljesképernyős módban.
ko: 전체 화면 모드에서 와이드 스크린 렌더링을 활성화합니다.
sv_se: Aktivera bredbildsrendering i helskärmsläge.

source: This version of Myst III has not been updated with the latest official patch. Please install the official update corresponding to your game's language. The updates can be downloaded from: %s
hu_hu: A Myst III ezen verziója nem tartalmazza a legfrissebb hivatalos frissítéseket. Kérem telepítse a nyelvének megfelelő hivatalos frissítést. A frissítések a következő helyről tölthetőek le: %s
ko: 이 버전의 미스트 III는 최신 공식 패치로 업데이트되지 않았습니다. 게임 언어에 해당하는 공식 업데이트를 설치하세요. 업데이트는 다음에서 다운로드할 수 있습니다: %s
sv_se: Den här versionen av Myst III har inte uppdaterats med den senaste officiella patchen. Installera den officiella uppdateringen som motsvarar ditt spels språk. Uppdateringarna kan hämtas ner från: %s

source: Invalid file name for saving
hu_hu: Érvénytelen fájlnév a mentéshez
ko: 저장할 파일 이름이 잘못되었음
sv_se: Ogiltigt filnamn på sparfilen

source: Fast move modifier
hu_hu: Gyors mozgás módosító
ko: 빠른 이동 수정기
sv_se: Modifierare för snabb förflyttning

source: Nancy Drew - Maze
hu_hu: Nancy Drew - Útvesztő
ko: 낸시 드류 - 미로
sv_se: Nancy Drew - Labyrint

source: Show / hide maze map
sv_se: Visa/dölj labyrintkarta

source: Player Speech
hu_hu: Játékos Beszéde
ko: 플레이어 음성
sv_se: Spelartal

source: Enable player speech. Only works if speech is enabled in the Audio settings.
hu_hu: Engedélyezi a játékos beszédét. Csak akkor működik, ha a beszéd engedélyezve van az Hang beállításokban.
ko: 플레이어 음성을 활성화합니다. 오디오 설정에서 음성이 활성화된 경우만 동작합니다.
sv_se: Aktivera spelarens tal. Fungerar endast om tal är aktiverat i ljudinställningarna.

source: Character Speech
hu_hu: Karakter Beszéd
ko: 캐릭터 음성
sv_se: Karaktärstal

source: Enable NPC speech. Only works if speech is enabled in the Audio settings.
hu_hu: Engedélyezi az NPC beszédet. Csak akkor működik, ha a beszéd engedélyezve van az Hang beállításokban.
ko: NPC 음성을 활성화합니다. 오디오 설정에서 음성이 활성화된 경우만 동작합니다.
sv_se: Aktivera NPC-tal. Fungerar endast om tal är aktiverat i ljudinställningarna.

source: Auto Move
hu_hu: Automata Mozgás
ko: 자동 이동
sv_se: Autoförflytta

source: Automatically rotate the viewport when the mouse reaches an edge.
hu_hu: Automatikusan forgatja a szövegdobozt ha az egér a képernyő széléhez ér.
ko: 마우스가 가장자리에 도달하면 자동으로 뷰포트를 회전합니다.
sv_se: Rotera visningsfönstret automatiskt när musen når en kant.

source: Fix softlocks
hu_hu: Softlock-ok javítása
ko: 소프트락 수정
sv_se: Rätta till mjuklåsningar

source: Fix instances where missing something earlier in the game blocks you from progressing any further.
hu_hu: Javítja azokat az eseteket, amikor a játék megakadályozza a továbbjutást, ha egyes tárgyakat korábban nem szerzett meg.
ko: 게임 초반에 뭔가를 놓쳐 더 이상 진행할 수 없는 상황을 해결합니다.
sv_se: Åtgärda fall där om man missar något tidigare i spelet, vilket hindrar en från att gå vidare.

source: Fix annoyances
hu_hu: Zavaró tényezők javítása
ko: 불편한 것 수정
sv_se: Åtgärda småfel

source: Fix various minor annoyances.
hu_hu: Több zavaró tényező javítása.
ko: 다양하고 사소한 불편한 것 수정합니다.
sv_se: Fixa diverse mindre irritationsmoment.

source: Extend endgame timer
hu_hu: Végjáték visszaszámláló meghosszabbítása
ko: 엔드게임 타이머 연장
sv_se: Förläng slutspelets tidsgräns

source: Get a little more time before failing the final puzzle. This is an official patch by HeR Interactive.
hu_hu: Több idő jut az utolsó rejtvény megfejtésére. Ez egy hivatalos javítás a HeR Interactive-tól.
ko: 마지막 퍼즐에 실패하기 전에 조금 더 시간을 가지세요. 이것은 HeR Interactive의 공식 패치입니다.
sv_se: Få lite mer tid innan du misslyckas med det sista pusslet. Detta är en officiell patch från HeR Interactive.

source: Would you like to load or save a game?
sv_se: Vill du läsa in eller spara ett spel?

source: Skip the Hall of Records storyboard scenes
hu_hu: A Feljegyzések Csarnoka vázlat átvezető átugrása
ko: Hall of Records 스토리 보드 장면 건너뛰기
sv_se: Hoppa över Hall of Records storyboard-scenerna

source: Allows the player to skip past the Hall of Records storyboard scenes
hu_hu: Lehetőséget nyújt a játékos számára, hogy átugorja a Feljegyzések Csarnoka vázlat átvezetőket
ko: 플레이어가 Hall of Records 스토리 보드 장면을 건너뛸 수 있도록 허용
sv_se: Låter spelaren hoppa över Hall of Records storyboard-scenerna

source: Scale the making of videos to full screen
hu_hu: Hogyan készült videók átméretezése teljesképernyőre
ko: 제작 비디오를 전체 화면으로 크기 조절
sv_se: Skala dokumentärvideor till helskärm

source: Scale the making of videos, so that they use the whole screen
hu_hu: Hogyan készült videók kinyújtása, hogy a teljes képernyőt használjanak
ko: 제작 영상이 전체 화면을 사용하도록 크기 조절
sv_se: Skala dokumentärvideor så att de använder hela skärmen

source: Repeat useful Willie's hint
hu_hu: Ismételd meg Willie hasznos tippjét
ko: 유용한 Willie의 힌트를 반복
sv_se: Upprepa användbar Willie's tips

source: Repeat actual useful hint by Willie
hu_hu: Willie valóban hasznos tippjének megismétlése
ko: Willie의 실제 유용한 힌트를 반복
sv_se: Upprepa faktiskt användbar ledtråd av Willie

source: NHC replacement:
hu_hu: NHC csere:
ko: NHC 교체:
sv_se: NHC-ersättning:

source: Save file management menus keymappings
sv_se: Kortkommandon för filhanteringsmeny

source: Pause menu keymappings
sv_se: Kortkommandon för pausmeny

source: Move / Interact
sv_se: Flytta / Interagera

source: Pause / Exit menu
sv_se: Pausa / Avsluta meny

source: Skip section of cutscene
sv_se: Hoppa över del av mellansekvens

source: Skip entire scene (works only in some scenes)
sv_se: Hoppa över hela sekvensen (fungerar endast i vissa scener)

source: Confirm the selected save / new save name
sv_se: Bekräfta vald sparning / nytt sparat namn

source: Credits keymappings
sv_se: Kortkommandon för medverkande

source: Dialog keymappings
sv_se: Kortkommandon för dialog

source: Deselect item
sv_se: Avmarkera objekt

source: Stop sounds
sv_se: Stoppa ljud

source: Toggle inventory
sv_se: Växla inventarier

source: Skip credits
sv_se: Hoppa över medverkande

source: Close dialog
sv_se: Stäng dialogen

source: Close map
sv_se: Stäng karta

source: Can't save game in slot %i
hu_hu: Játékállás nem menthető a %i slotba
ko: 슬롯 %i에서 게임을 저장할 수 없음
sv_se: Kan inte spara data på plats %i

source: Load file
hu_hu: Fájl betöltése
ko: 파일 불러오기
sv_se: Läs in fil

source: Loading game...
hu_hu: Játék betöltés...
ko: 게임 불러오는 중...
sv_se: Läser in spel...

source: Save file
hu_hu: Fájl mentése
ko: 파일 저장
sv_se: Spara fil

source: Saving game...
hu_hu: Játék mentése...
ko: 게임 저장 중...
sv_se: Sparar speldata...

source: ScummVM found that you have old saved games for Nippon Safes that should be renamed. The old names are no longer supported, so you will not be able to load your games if you don't convert them. Press OK to convert them now, otherwise you will be asked next time.
hu_hu: A ScummVM számára túl régi Nippon Safes mentések állnak rendelkezésre, ezért újra kell nevezni őket. A régi nevek nem támogatottak, ezért konvertálás nélkül nem fogja tudni használni őket. Nyomjon az OK-ra a konvertáláshoz, máskülönben legközelebb újra megjelenik az ablak.
ko: ScummVM에서 이름을 바꿔야 하는 Nippon Safes에 대한 오래된 저장된 게임이 있음을 발견했습니다. 이전 이름은 더 이상 지원되지 않으므로, 변환하지 않으면 게임을 불러올 수 없습니다. 지금 변환하려면 확인을 누르세요. 그렇지 않으면 다음에 묻습니다.
sv_se: ScummVM upptäckte att du har gamla spardata för Nippon Safes som borde byta namn. De gamla filnamnen stöds inte längre, så du kommer inte kunna läsa in dina spel om du inte konverterar dem. Tryck på "OK" för att konvertera dem nu, annars kommer du tillfrågas igen nästa gång.

source: ScummVM successfully converted all your saved games.
hu_hu: ScummVM sikeresen konvertálta az összes játékállását.
ko: ScummVM이 저장된 모든 게임을 성공적으로 변환했습니다.
sv_se: ScummVM konverterade alla dina spardata.

source: ScummVM printed some warnings in your console window and can't guarantee all your files have been converted. Please report to the team.
hu_hu: A konzol ablakban írt hibák merültek fel, melyek miatt nem garantálható a konvertált mentések épsége. Kérjük jelezzen vissza a csapatunknak ezzel kapcsolatban.
ko: ScummVM이 콘솔 창에 몇 가지 경고를 인쇄했으며 모든 파일이 변환되었는지 보장할 수 없습니다. 개발 팀에 보고해 주세요.
sv_se: ScummVM skrev ut några varningar i ditt konsolfönster och kan inte garantera att alla dina filer har konverterats. Var god rapportera till teamet.

source: Up / Zoom in / Move forward / Open door
sv_se: Upp/Zooma in/Gå framåt/Öppna dörr

source: Down / Zoom out
sv_se: Ner/Zooma ut

source: Action/Select
hu_hu: Művelet/Választ
ko: 동작/선택
sv_se: Handling/Välj

source: Toggle inventory tray
sv_se: Visa inventariefack

source: Toggle biochip tray
sv_se: Växla biochip-fack

source: Toggle center data display
sv_se: Aktivera centrerad dataskärm

source: Toggle info screen
sv_se: Växla infoskärm

source: Toggle pause menu
sv_se: Växla pausmeny

source: Toggle Chatty AI
hu_hu: Kapcsold be a Csevegő AI-t
ko: 말 많은 AI 전환
sv_se: Växla pratsam AI

source: Interact / Skip dialog
sv_se: Interagera / Hoppa över dialog

source: Open action menu / Close current interface
sv_se: Öppna åtgärdsmeny / Stäng aktuellt gränssnitt

source: Chapayev use object
sv_se: Chapayevs använd objekt

source: Show / Hide options screen
sv_se: Visa / dölj alternativskärm

source: Close current interface
sv_se: Stäng aktuellt gränssnitt

source: This menu item is not yet implemented
hu_hu: Ez a menüpont még nem ikerült implementálásra
ko: 이 메뉴 항목은 아직 구현되지 않았음
sv_se: Detta menyval är ännu inte implementerat

source: Interact / Select
sv_se: Interagera / Välj

source: Cancel interaction
sv_se: Avbryt interaktion

source: Skip walk
sv_se: Hoppa över gång

source: Skip walk and cancel interaction
sv_se: Hoppa över promenad och avbryt interaktion

source: Skip sequence
sv_se: Hoppa över sekvens

source: Skip sub-sequence
sv_se: Hoppa över undersekvens

source: Restart sequence
sv_se: Starta om sekvens

source: Switch test
sv_se: Växlingstest

source: Enable/Disable fog
sv_se: Aktivera/inaktivera dimma

source: Enable/Disable scissor
sv_se: Aktivera/inaktivera sax

source: 3DO Plumbers requires RGB support.
hu_hu: A 3DO Plumbers RGB támogatást igényel.
ko: 3DO Plumbers에는 RGB 지원이 필요합니다.
sv_se: 3DO Plumbers kräver RGB-stöd.

source: Open interaction menu
sv_se: Öppna interaktionsmenyn

source: Z key
sv_se: Z-tangent

source: X key
sv_se: X-tangent

source: Display SFX subtitles
sv_se: Visa undertexter för ljudeffekter

source: Use SFX subtitles (if subtitles are enabled).
sv_se: Använd SFX-undertexter (om undertexter finns tillgängliga)

source: Highlight decision areas
sv_se: Markera beslutsområden

source: Highlight clickable areas in decision scenes.
sv_se: Markera klickbara områden i beslutsscener.

source: Skip video
hu_hu: Videó átugrása
ko: 비디오 건너뛰기
sv_se: Hoppa över video

source: Enable 16 bits per pixel mode
sv_se: Aktivera 16 bitar per bildpunktsläget

source: Enable this if backend does not support 32bpp and/or to debug graphics
sv_se: Aktivera detta om bakänden inte har stöd för 32bpp och/eller för att felsöka grafik

source: Alternative intro
hu_hu: Alternatív bevezető
ko: 대체 인트로
sv_se: Alternativt intro

source: Use an alternative game intro (CD version only)
hu_hu: Alternatív bevezető videó használata (csak CD verziónál)
ko: 대체 게임 인트로 사용 (CD 버전에서만)
sv_se: Använd alternativt spelintro (endast CD-version)

source: Improved font
hu_hu: Továbbfejlesztett font
ko: 개선된 글꼴
sv_se: Förbättrat typsnitt

source: Use an easier to read custom font
hu_hu: Használjon könnyebben olvasható egyéni betűtípust
ko: 읽기 쉬운 커스텀 글꼴을 사용
sv_se: Använd ett anpassat typsnitt som är enklare att läsa

source: Move / Skip / Use default action with inventory item
sv_se: Flytta / Hoppa över / Använd standardåtgärd med inventarieobjekt

source: Toggle fast mode
hu_hu: Gyors mód kapcsoló
ko: 빠른 모드 전환
sv_se: Växla snabbläge

source: Skip text
sv_se: Hoppa över text

source: Scroll inventory up
sv_se: Rulla uppåt i inventarier

source: Scroll inventory down
sv_se: Rulla nedåt i inventarier

source: Inventory item 1
sv_se: Inventarieobjekt 1

source: Inventory item 2
sv_se: Inventarieobjekt 2

source: Inventory item 3
sv_se: Inventarieobjekt 3

source: Inventory item 4
sv_se: Inventarieobjekt 4

source: Skip cutaway / dialog
sv_se: Hoppa över scen / dialog

source: Use journal
sv_se: Använd dagbok

source: Pick up
hu_hu: Felvesz
ko: 줍기
sv_se: Ta

source: Talk to
hu_hu: Beszél
ko: 대화하기
sv_se: Tala med

source: Close journal
sv_se: Stäng dagbok

source: Windows Trial version is not supported
hu_hu: A Windows próbaverzió nem támogatott
ko: 윈도우즈 체험판은 지원되지 않았음
sv_se: Testversionen för Windows stöds inte

source: macOS Trial version is not supported
hu_hu: macOS próbaverzió nem támogatott
ko: macOS 체험판은 지원되지 않았음
sv_se: Testversionen för macOS stöds inte

source: Pocket PC Trial version is not supported
hu_hu: Pocket PC próbaverzió nem támogatott
ko: 포켓 PC 체험판은 지원되지 않았음
sv_se: Testversionen för Pocket PC stöds inte

source: I Have No Mouth support not compiled in
hu_hu: I Have No Mouth támogatás nincs lefordítva
ko: I Have No Mouth 지원이 컴파일되지 않았음
sv_se: Stöd för I Have No Mouth har inte kompilerats in

source: Game keymapping
hu_hu: Játék gombkiosztás
ko: 게임 키맵핑
sv_se: Tangentmappning för spel

source: Option panel keymapping
hu_hu: Opció panel gombkiosztás
ko: 옵션 패널 키맵핑
sv_se: Tangentmappning för alternativpanel

source: Save panel keymapping
hu_hu: Mentés panel gombkiosztás
ko: 패널 키맵핑 저장
sv_se: Tangentmappning för sparningspanel

source: Load panel keymapping
hu_hu: Betöltő panel gombkiosztás
ko: 패널 키맵핑 불러오기
sv_se: Tangentmappning för inläsningspanel

source: Quit panel keymapping
hu_hu: Kilépő panel gombkiosztás
ko: 패널 키맵핑 종료
sv_se: Tangentmappning för avslutningspanel

source: Converse panel keymapping
hu_hu: Beszélgető panel gombkiosztás
ko: 패널 키맵핑 정반대
sv_se: Tangentmappning för konversationspanel

source: Boss key
hu_hu: Főnök gomb
ko: 보스 키
sv_se: Chefstangent

source: Show options
hu_hu: Opciók megjelenítése
ko: 옵션 표시
sv_se: Visa alternativ

source: Exit conversation
hu_hu: Kilépés párbeszéd
ko: 대화 나가기
sv_se: Avsluta konversation

source: Conversation position - Up
hu_hu: Párbeszéd pozíció - Fel
ko: 대화 위치 - 위쪽
sv_se: Position för konversation - Upp

source: Conversation position - Down
hu_hu: Párbeszéd pozíció - Le
ko: 대화 위치 - 아래쪽
sv_se: Position för konversation - Ner

source: Pause game
hu_hu: Játék szünetelése
ko: 게임 일시 정지
sv_se: Pausa spelet

source: Abort speech
hu_hu: Beszéd leállítás
ko: 음성 중단
sv_se: Avbryt tal

source: Show dialog
sv_se: Visa dialog

source: Walk to
hu_hu: Odamegy
ko: 걷기
sv_se: Gå till

source: Push
hu_hu: Tol
ko: 밀기
sv_se: Tryck

source: Swallow
hu_hu: Nyelés
ko: 삼키기
sv_se: Svälj

source: Reading speed
hu_hu: Olvasási sebesség
ko: 읽기 속도
sv_se: Läsningshastighet

source: Change music
hu_hu: Zene változtatása
ko: 음악 변경
sv_se: Byt musik

source: Change sound
hu_hu: Hang változtatása
ko: 사운드 변경
sv_se: Byt ljud
