Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: Graphics mode:
hu_hu: Grafikai mód:
ko: 그래픽 모드:
sv_se: Grafikläge:

source: Render mode:
hu_hu: Render mód:
ko: 렌더 모드:
sv_se: Renderingsläge:

source: Special dithering modes supported by some games
hu_hu: Néhány játék támogatja a speciális dithering módokat
ko: 일부 게임에서 지원하는 특수 디더링 모드
sv_se: Speciella dithering-lägen som stöds av vissa spel

source: Stretch mode:
hu_hu: Nyújtás mód:
ko: 늘리기 모드:
sv_se: Utsträckningsläge:

source: Scaler:
hu_hu: Méretező:
ko: 크기 조절:
sv_se: Skalning:

source: Rotation mode:
hu_hu: Forgatás mód:
ko: 회전 모드:
sv_se: Roteringsläge:

source: Specifies path to the shader used for scaling the game screen
hu_hu: Megadja a játék képernyőjének méretezéséhez használt shader elérési útját
ko: 게임 화면 크기 조정에 사용되는 셰이더 경로를 지정
sv_se: Anger sökvägen till shadern som används för att skala spelskärmen

# lowres
source: Shader Path:
hu_hu: Shader Elérési út:
ko: 셰이더 경로:
sv_se: Sökväg för shader:

# shader
source: None
hu_hu: Nincs
ko: 없음
sv_se: Ingen

source: Download Shaders
hu_hu: Shaderek letöltése
ko: 셰이더 다운로드
sv_se: Hämta shaders

source: Check on the scummvm.org website for updates of shader packs
hu_hu: Látogasson el a scummvm.org oldalra a shader csomag frissítésekért
ko: 셰이더 팩 업데이트는 scummvm.org 웹사이트에서 확인
sv_se: Leta på webbplatsen scummvm.org efter uppdateringar av shader-paket

source: Fullscreen mode
hu_hu: Teljesképernyős mód
ko: 전체화면 모드
sv_se: Helskärmsläge

source: V-Sync
ko: 수직동기화
sv_se: V-Synk

source: Wait for the vertical sync to refresh the screen in order to prevent tearing artifacts
hu_hu: Várja meg míg a függőleges szinkron frissíti a képernyőt a képtörés elkerüléséért
ko: 수직동기화가 화면을 새로 고쳐서 아티팩트가 찢어지는 것을 방지할 때까지 기다림
sv_se: Vänta på att vertikal sync uppdaterar skärmen för att undvika visuella grafikfel

source: Game 3D Renderer:
hu_hu: 3D játék Renderelő:
ko: 게임 3D 렌더러:
sv_se: 3D-renderare:

# lowres
source: Game 3D Renderer:
hu_hu: 3D játék Renderelő:
ko: 게임 3D 렌더러:
sv_se: 3D-renderare för spel:

source: 3D Anti-aliasing:
hu_hu: 3D Élsimítás:
ko: 3D 안티 에일리어싱:
sv_se: Kantutjämning i 3D:

source: Disabled
hu_hu: Kikapcsolva
ko: 비활성화됨
sv_se: Inaktiverad

source: Filter graphics
hu_hu: Grafika filterezése
ko: 그래픽 필터
sv_se: Filtrera grafik

source: Use linear filtering when scaling graphics
hu_hu: Lineáris filterezés használata a grafika átméretezésénél
ko: 그래픽 크기 조정 시 선형 필터링을 사용
sv_se: Använd linjärt filter för att förstora bilden

source: Aspect ratio correction
hu_hu: Képarány korrekció
ko: 화면비 교정
sv_se: Korrigering av bildförhållande

source: Correct aspect ratio for games
hu_hu: A játék megfelelő képaránya
ko: 게임에 적합한 화면비
sv_se: Korrigera bildförhållandet för spel

source: Preferred device:
hu_hu: Preferált eszköz:
ko: 선호하는 장치:
sv_se: Föredragen enhet:

source: Music device:
hu_hu: Zene eszköz:
ko: 음악 장치:
sv_se: Musikenhet:

source: Specifies preferred sound device or sound card emulator
hu_hu: Preferált hang eszköz vagy hang emulátor beállítása
ko: 선호하는 사운드 장치 또는 사운드 카드 에뮬레이터를 지정
sv_se: Bestämmer din föredragna emulator för ljudenhet eller ljudkort

source: Specifies output sound device or sound card emulator
hu_hu: Hangeszköz vagy hangkártya emulátor kiválasztása
ko: 출력 사운드 장치 또는 사운드 카드 에뮬레이터를 지정
sv_se: Bestämmer emulator för ljudenhet eller ljudkort

# lowres
source: Preferred dev.:
hu_hu: Preferált eszk.:
ko: 선호 장치:
sv_se: Föredr. enhet:

# lowres
source: Music device:
hu_hu: Zene eszköz:
ko: 음악 장치:
sv_se: Musikenhet:

source: AdLib is used for music in many games
hu_hu: Sok játékban zenéjénél használt az AdLib
ko: 애드립은 많은 게임에서 음악 재생에 사용됨
sv_se: AdLib används för musik i många spel

source: GM device:
hu_hu: GM eszköz:
ko: GM 장치:
sv_se: GM-enhet:

source: Specifies default sound device for General MIDI output
hu_hu: Alapértelmezett hangeszköz kiválasztása General MIDI kimenethez
ko: 일반 미디 출력을 위한 기본 사운드 장치를 지정
sv_se: Bestämmer standardenheten för General MIDI-uppspelning

source: Don't use General MIDI music
hu_hu: Ne használjon General MIDI zenét
ko: 일반 미디 음악을 사용하지 않음
sv_se: Använd inte General MIDI-musik

source: Use first available device
hu_hu: Első elérhető eszköz használata
ko: 사용 가능한 첫 번째 장치 사용
sv_se: Använd första tillgängliga enhet

source: SoundFont is supported by some audio cards, FluidSynth and Timidity
hu_hu: Néhány hangkártya, a FluidSynth és TiMidity támogatja a SoundFont betöltését
ko: 사운드폰트는 일부 오디오 카드, FluidSynth, Timidity 지원함
sv_se: SoundFont stöds endast av vissa ljudkort, FluidSynth och Timidity

# soundfont
source: None
hu_hu: Nincs
ko: 없음
sv_se: Ingen

source: Mixed AdLib/MIDI mode
hu_hu: Vegyes AdLib/MIDI mód
ko: 애드립/미디 믹스 모드
sv_se: Blandat AdLib/MIDI-läge

source: Use both MIDI and AdLib sound generation
hu_hu: Használja a MIDI és AdLib hang generálást egyszerre
ko: 사운드 생성에 미디와 애드립을 동시에 사용
sv_se: Använd både MIDI och AdLib för ljudgeneration

source: MIDI gain:
hu_hu: MIDI erősítés:
ko: 미디 게인:
sv_se: MIDI-förstärkning:

source: MT-32 Device:
hu_hu: MT-32 Eszköz:
ko: MT-32 장치:
sv_se: MT-32-enhet:

source: Specifies default sound device for Roland MT-32/LAPC1/CM32l/CM64 output
hu_hu: Alapértelmezett hangeszköz beállítása Roland MT-32/LAPC1/CM32l/CM64 kimenethez
ko: 롤랜드 MT-32/LAPC1/CM32l/CM64 출력을 위한 기본 사운드 장치를 선택
sv_se: Bestämmer standardenheten för Roland MT-32/LAPC1/CM32I/CM64-uppspelning

source: True Roland MT-32 (disable GM emulation)
hu_hu: Hardveres Roland MT-32 (GM emuláció kikapcsolása)
ko: 실기 롤랜드 MT-32 (GM 에뮬레이션 비활성화)
sv_se: Äkta Roland MT-32 (inaktivera GM-emulering)

source: Check if you want to use your real hardware Roland-compatible sound device connected to your computer
hu_hu: Jelölje be, ha hardveres Roland kompatibilis hang eszközt csatlakoztatott a számítógépéhez
ko: 컴퓨터에 연결된 실기 하드웨어 롤랜드 호환 사운드 장치를 사용할지 확인
sv_se: Aktivera om du vill använda din verkliga Roland-kompatibla och datoranslutna ljudenhet

# lowres
source: True Roland MT-32 (no GM emulation)
hu_hu: Hardveres Roland MT-32 (nincs GM emuláció)
ko: 실기 롤랜드 MT-32(GM 에뮬레이션 없음)
sv_se: Äkta Roland MT-32 (ingen GM-emulering)

source: Roland GS device (enable MT-32 mappings)
hu_hu: Roland GS eszköz (MT-32 leképezés engedélyezve)
ko: 롤랜드 GS 장치 (MT-32 매핑 활성화)
sv_se: Roland GS-enhet (aktivera MT-32-mappningar)

source: Check if you want to enable patch mappings to emulate an MT-32 on a Roland GS device
hu_hu: Jelölje be, ha be akarja kapcsolni a patch leképzéseket az MT-32 Roland GS eszközön való emulálását
ko: 롤랜드 GS 장치에서 MT-32를 에뮬레이션하기 위해 패치 매핑을 활성화할지 확인
sv_se: Aktivera om du vill använda patchmappningar för att emulera en MT-32 på en Roland GS-enhet

source: Don't use Roland MT-32 music
hu_hu: Ne használjon Roland MT-32 zenét
ko: 롤랜드 MT-32 음악을 사용하지 않음
sv_se: Använd inte Roland MT-32-musik

source: Text and speech:
hu_hu: Szöveg és beszéd:
ko: 자막과 음성:
sv_se: Text och tal:

source: Speech
hu_hu: Beszéd
ko: 음성
sv_se: Tal

source: Subtitles
hu_hu: Feliratok
ko: 자막
sv_se: Undertexter

source: Both
hu_hu: Mindkettő
ko: 둘 다
sv_se: Båda

source: Subtitle speed:
hu_hu: Felirat sebesség:
ko: 자막 속도:
sv_se: Undertexthastighet:

# lowres
source: Text and speech:
hu_hu: Szöveg és beszéd:
ko: 자막과 음성:
sv_se: Text och tal:

source: Spch
hu_hu: Besz
ko: 음성
sv_se: Tal

source: Subs
hu_hu: Felir
ko: 자막
sv_se: Text

# lowres
source: Both
hu_hu: Mindk
ko: 둘 다
sv_se: Båda

source: Show subtitles and play speech
hu_hu: Felirat megjelenítése és hang lejátszása
ko: 자막을 표시하고 음성을 재생
sv_se: Visa undertexter och spela upp tal

# lowres
source: Subtitle speed:
hu_hu: Felirat sebesség:
ko: 자막 속도:
sv_se: Undertexthastighet:

source: Music volume:
hu_hu: Zene hangerő:
ko: 음악 볼륨:
sv_se: Musikvolym:

# lowres
source: Music volume:
hu_hu: Zene hangerő:
ko: 음악 볼륨:
sv_se: Musikvolym:

source: Mute all
hu_hu: Összes némítása
ko: 모두 음소거
sv_se: Ljud av

source: SFX volume:
hu_hu: Effekt hangerő:
ko: 효과음 볼륨:
sv_se: SFX-volym:

source: Special sound effects volume
hu_hu: Speciális hangeffekt hangerő
ko: 특수 사운드 효과 볼륨
sv_se: Volym för specialeffekter

# lowres
source: SFX volume:
hu_hu: Effekt hangerő:
ko: 효과음 볼륨:
sv_se: SFX-volym:

source: Speech volume:
hu_hu: Beszéd hangerő:
ko: 음성 볼륨:
sv_se: Talvolym:

# lowres
source: Speech volume:
hu_hu: Beszéd hangerő:
ko: 음성 볼륨:
sv_se: Talvolym:

source: Control
hu_hu: Irányitás
ko: 조작
sv_se: Kontroll

# lowres
source: Cloud
hu_hu: Felhő
ko: 클라우드
sv_se: Moln

# lowres
source: LAN
hu_hu: Helyi hálózat
sv_se: Lokalt nätverk

source: Accessibility
hu_hu: Könnyű kezelés
ko: 접근성
sv_se: Hjälpmedel

# lowres
source: Accessibility
hu_hu: Könnyű kezelés
ko: 접근성
sv_se: Hjälpmedel

source: Discard changes and close the dialog
hu_hu: Módosítások elvetése és az ablak bezárása
ko: 변경 사항을 취소하고 대화 상자를 닫음
sv_se: Förkasta ändringar och stäng dialogen

source: Apply
hu_hu: Alkalmaz
ko: 적용
sv_se: Tillämpa

source: Apply changes without closing the dialog
hu_hu: Változások alkalmazása az ablak bezárása nélkül
ko: 대화 상자를 닫지 않고 변경 사항을 적용
sv_se: Tillämpa ändringar utan att stänga dialogrutan

source: Apply changes and close the dialog
hu_hu: Változások alkalmazása az ablak bezárásával
ko: 변경 사항을 적용하고 대화 상자를 닫음
sv_se: Tillämpa ändringar och stäng dialogrutan

source: FluidSynth Settings
hu_hu: FluidSynth Beállítások
ko: FluidSynth 설정
sv_se: Inställningar för FluidSynth

source: Specifies where your saved games are put. A red coloring indicates the value is temporary and will not get saved
hu_hu: Meghatározza, hogy a mentés hova kerüljön. A piros szín azt jelzi, hogy az érték ideiglenes, és nem kerül mentésre
ko: 저장된 게임이 저장되는 위치를 지정합니다. 빨간색은 값이 임시적이며 저장되지 않음을 나타냄
sv_se: Anger var sparade spel placeras. Röd färg anger ett temporärt värde som inte kommer att sparas

source: Theme Path:
hu_hu: Téma elérési út:
ko: 테마 경로:
sv_se: Temasökväg:

# lowres
source: Theme Path:
hu_hu: Téma elérési út:
ko: 테마 경로:
sv_se: Temasökväg:

source: Icon Path:
hu_hu: Ikon elérési út:
ko: 아이콘 경로:
sv_se: Ikonsökväg:

# lowres
source: Icon Path:
hu_hu: Ikon elérési út:
ko: 아이콘 경로:
sv_se: Ikonsökväg:

# path
source: Default
hu_hu: Alapértelmezett
ko: 기본값
sv_se: Standard

source: DLC Path:
hu_hu: DLC elérési út:
ko: DLC 경로:
sv_se: DLC-sökväg:

# lowres
source: DLC Path:
hu_hu: DLC elérési út:
ko: DLC 경로:
sv_se: DLC-sökväg:

source: Specifies path to additional data used by all games or ScummVM
hu_hu: A ScummVM vagy az összes játék által használt kiegészítő fájlok elérési útvonala
ko: 모든 게임 또는 ScummVM에서 사용되는 추가 데이터의 경로를 지정
sv_se: Bestämmer sökväg till andra data som används av alla spel eller ScummVM

source: Plugins Path:
hu_hu: Plugin elérési út:
ko: 플러그인 경로:
sv_se: Tilläggssökväg:

# lowres
source: Plugins Path:
hu_hu: Plugin elérési út:
ko: 플러그인 경로:
sv_se: Tilläggssökväg:

source: ScummVM config path:
hu_hu: ScummVM konfiguráció elérési út:
ko: ScummVM 구성 경로:
sv_se: Sökväg för ScummVM-konfiguration:

source: ScummVM log path:
hu_hu: ScummVM napló elérési út:
ko: ScummVM 로그 경로:
sv_se: Sökväg för ScummVM-loggar:

source: View
hu_hu: Nézet
ko: 보기
sv_se: Visa

source: Last browser path:
hu_hu: Utolsó böngésző elérési út:
ko: 마지막 접근 경로:
sv_se: Senaste bläddrarsökväg:

source: Theme:
hu_hu: Téma:
ko: 테마:
sv_se: Tema:

source: GUI scale:
hu_hu: Felület mérete:
ko: GUI 크기:
sv_se: Gränssnittsskala:

source: %d%% - Custom
hu_hu: %d%% - Egyéni
ko: %d%% - 커스텀
sv_se: %d%% - Anpassad

source: GUI renderer:
hu_hu: Felület renderelő:
ko: GUI 렌더러:
sv_se: GUI-renderare:

source: Return to the launcher when leaving a game
hu_hu: Térjen vissza az indítóhoz ha kilép a játékból
ko: 게임 종료 시 런처로 돌아가기
sv_se: Återvänd till spelstartaren när ett spel avslutas

source: Return to the launcher when leaving a game instead of closing ScummVM (this feature is not supported by all games).
hu_hu: Térjen vissza az indítóhoz ha kilép a játékból a ScummVM bezárása helyett (ezt a funkciót nem minden játék támogatja).
ko: 게임 종료 시 ScummVM을 닫는 대신 런처로 돌아갑니다 (이 기능은 모든 게임에서 지원되지 않음).
sv_se: Återvänd till spelstartaren när ett spel avslutas i stället för att avsluta ScummVM (denna funktion stöds inte av alla spel).

source: Ask for confirmation on exit
hu_hu: Megerősítés kilépéskor
ko: 나갈 시 확인 요청
sv_se: Bekräfta innan avslut

source: Ask for permission when closing ScummVM or leaving a game.
hu_hu: Megerősítés kérése a ScummVM vagy egy játék bezárásakor.
ko: ScummVM을 닫거나 게임을 나갈 시 권한을 요청합니다.
sv_se: Fråga om tillstånd att stänga ett spel eller avsluta ScummVM.

source: Disable fixed font scaling
hu_hu: A rögzített betűméretezés tiltása
ko: 고정된 글꼴 크기 조정 비활성화
sv_se: Inaktivera fast skalning av typsnitt

source: Do not upscale fixed size fonts in the GUI. This reduces artefacts on low resolution screens
hu_hu: Ne skálázza fel a rögzített méretű betűtípusokat a grafikus felhasználói felületen. Ez csökkenti a grafikai hibák számát az alacsony felbontású képernyőkön
ko: GUI에서 고정 크기 글꼴을 업스케일하지 마세요. 이렇게 하면 저해상도 화면에서 아티팩트가 줄어듬
sv_se: Skala inte upp typsnitt med fast storlek i gränssnittet. Detta minskar artefakter på skärmar med låg upplösning

source: GUI language:
hu_hu: Felület nyelve:
ko: GUI 언어:
sv_se: Gränssnittsspråk:

source: Language of ScummVM GUI
hu_hu: A ScummVM felhasználói felületének nyelve
ko: ScummVM GUI의 언어
sv_se: Språk för användargränssnittet i ScummVM

source: Switch the ScummVM GUI language to the game language
hu_hu: Váltsa át a ScummVM felület nyelvét a játék nyelvére
ko: ScummVM GUI 언어를 게임 언어로 전환
sv_se: Ändra ScummVMs gränssnittsspråk till spelets språk

source: When starting a game, change the ScummVM GUI language to the game language. That way, if a game uses the ScummVM save and load dialogs, they are in the same language as the game.
hu_hu: A játék indításakor módosítsa a ScummVM felhasználói felület nyelvét a játék nyelvére. Így ha egy játék a ScummVM mentési és betöltési párbeszédablakot használ, akkor ugyanaz lesz a nyelv, mint a játéké.
ko: 게임을 시작 시, ScummVM GUI 언어를 게임 언어로 변경합니다. 이렇게 하면, 게임에서 ScummVM 저장 및 불러오기 대화 상자를 사용하는 경우 게임과 동일한 언어로 표시됩니다.
sv_se: Matcha ScummVM-gränssnittets språk med det pågående spelets språk, så att spara- och läs in-dialogrutor (i de spel som använder ScummVMs egna) får samma språk som resten av spelet.

source: Use native system file browser
hu_hu: Használjon natív rendszerfájl böngészőt
ko: 기본 시스템 파일 브라우저 사용
sv_se: Använd systemets egna filbläddrare

source: Use the native system file browser instead of the ScummVM one to select a file or directory.
hu_hu: A ScummVM-é helyett a rendszer fájlböngészőjét használhatja egy fájl vagy könyvtár kiválasztásához.
ko: ScummVM 대신 기본 시스템 파일 브라우저를 사용하여 파일이나 디렉터리를 선택하세요.
sv_se: Använd systemets egna filbläddrare i stället för ScummVMs egna för att välja filer och kataloger.

source: Download Icons
hu_hu: Ikonok Letöltése
ko: 아이콘 다운로드
sv_se: Hämta ner ikoner

source: Check on the scummvm.org website for updates of icon packs
hu_hu: További ikoncsomag frissítésekért látogasson a scummvm.org oldalra
ko: 아이콘 팩 업데이트는 scummvm.org 웹사이트에서 확인
sv_se: Leta på webbplatsen scummvm.org efter uppdateringar av ikonpaket

source: Autosave:
hu_hu: Automata mentés:
ko: 자동 저장:
sv_se: Autospara:

# lowres
source: Autosave:
hu_hu: Automata mentés:
ko: 자동 저장:
sv_se: Autospara:

source: Random seed:
hu_hu: Véletlenszerű szám:
ko: 무작위 시드:
sv_se: Slumpmässig seed:

source: Seed for initializing all random number generators
hu_hu: Kód az összes véletlenszám-generátor inicializálásához
ko: 모든 난수 생성기를 초기화하기 위한 시드
sv_se: Seed för att aktivera alla slumptalsgeneratorer

source: Debug level:
hu_hu: Hibakeresési szint:
ko: 디버그 수준:
sv_se: Felsökningsnivå:

source: None
hu_hu: Nincs
ko: 없음
sv_se: Ingen

source: 11 (all)
hu_hu: 11 (mind)
ko: 11 (모두)
sv_se: 11 (alla)

source: Enable Discord integration
hu_hu: Discord integráció engedélyezése
ko: 디스코드 통합 활성화
sv_se: Aktivera Discord-integration

source: Show information about the games you are playing on Discord if the Discord client is running.
hu_hu: Ha fut a Discord kliens, információkat jelenít meg a futó játékokról.
ko: 디스코드 클라이언트가 실행 중이면 디스코드에서 플레이하는 게임에 대한 정보를 표시합니다.
sv_se: Visa information om spelen du spelar på Discord om Discord-klienten kör.

source: Update check:
hu_hu: Frissítés ellenőrzés:
ko: 업데이트 확인:
sv_se: Uppdateringskontroll:

source: How often to check ScummVM updates
hu_hu: ScummVM frissítés ellenőrzésének gyakorisága
ko: ScummVM 업데이트를 확인하는 빈도
sv_se: Hur ofta ScummVM letar efter uppdateringar

source: Check now
hu_hu: Ellenőrzés most
ko: 지금 확인
sv_se: Kontrollera nu

source: Active storage:
hu_hu: Aktív tároló:
ko: 사용할 저장소:
sv_se: Aktiv lagring:

source: Active cloud storage
hu_hu: Aktív felhő tároló
ko: 사용할 클라우드 저장소
sv_se: Aktiv molnlagring

# lowres
source: Storage is not yet enabled. Verify that username is correct and enable it:
hu_hu: A tároló még nem engedélyezett. Ellenőrizze a felhasználónevet és engedélyezze:
ko: 저장소가 아직 활성화되지 않았습니다. 사용자 이름이 올바른지 확인하고 활성화하세요:
sv_se: Lagring är ännu inte aktiverad. Kontrollera att användarnamnet är korrekt och aktivera den:

source: Storage is not yet enabled. Verify that username is correct and enable it:
hu_hu: A tároló még nem engedélyezett. Ellenőrizze a felhasználónevet és engedélyezze:
ko: 저장소가 아직 활성화되지 않았습니다. 사용자 이름이 올바른지 확인하고 활성화하세요:
sv_se: Lagring är ännu inte aktiverad. Kontrollera att användarnamnet är korrekt och aktivera den:

source: Enable storage
hu_hu: Tároló engedélyezése
ko: 저장소 활성화
sv_se: Aktivera lagring

source: Confirm you want to use this account for this storage
hu_hu: Erősítse meg, hogy ezt a fiókot akarja használni a tároláshoz
ko: 이 저장소에 이 계정을 사용할 것인지 확인
sv_se: Bekräfta att du vill använda det här kontot för den här lagringen

source: Username:
hu_hu: Felhasználó:
ko: 사용자이름:
sv_se: Användarnamn:

source: Username used by this storage
hu_hu: Felhasználónév ehhez a tárolóhoz
ko: 이 저장소에서 사용되는 사용자이름
sv_se: Användarnamn som används av denna lagring

source: <none>
hu_hu: <nincs>
ko: <없음>
sv_se: <ingen>

source: Used space:
hu_hu: Felhasznált tárhely:
ko: 사용된 용량:
sv_se: Utnyttjat utrymme:

source: Space used by ScummVM's saved games on this storage
hu_hu: ScummVM mentésekhez használt tárhely ezen a tárolón
ko: 이 저장소에서 ScummVM이 저장한 게임의 사용하는 용량
sv_se: Utrymme som används av ScummVM:s sparade data på denna lagring

source: Last sync:
hu_hu: Utolsó szinkronizáció:
ko: 최근 동기화:
sv_se: Senaste synkronisering:

source: When was the last time saved games were synced with this storage
hu_hu: Mikor volt az utoljára mentett játékok szinkronizálása ezen a tárolón
ko: 마지막으로 저장된 게임이 이 저장소와 동기화된 시점
sv_se: När sparade data senast synkroniserades för den här lagringen

source: <never>
hu_hu: <soha>
ko: <절대 안 함>
sv_se: <aldrig>

# lowres
source: Saved games sync automatically on launch, after saving and on loading.
hu_hu: A mentett játékok automatikusan szinkronizálódnak indításkor, mentés után és visszatöltéskor.
ko: 저장된 게임은 실행 시, 저장 후/불러오기 시 자동으로 동기화됩니다.
sv_se: Sparade spel synkroniseras automatiskt vid start, efter sparning och vid inläsning.

source: Saved games sync automatically on launch, after saving and on loading.
hu_hu: A mentett játékok automatikusan szinkronizálódnak indításkor, mentés után és visszatöltéskor.
ko: 저장된 게임은 실행 시, 저장 후/불러오기 시 자동으로 동기화됩니다.
sv_se: Sparade spel synkroniseras automatiskt vid start, efter sparning och vid inläsning.

source: Sync now
hu_hu: Szinkronizálás most
ko: 지금 동기화
sv_se: Synkronisera nu

source: Start saved games sync
hu_hu: Mentések szinkronizálásnak indítása
ko: 저장된 게임 동기화 시작
sv_se: Starta synkroniseringen av sparade spel

# lowres
source: You can download game files from your cloud ScummVM folder:
hu_hu: Játék fájlok letölthetőek a ScummVM felhő mappából:
ko: 클라우드 ScummVM 폴더에서 게임 파일을 다운로드할 수 있습니다:
sv_se: Du kan hämta ner spelfiler från din ScummVM-katalog i molnet:

source: You can download game files from your cloud ScummVM folder:
hu_hu: Játék fájlok letölthetőek a ScummVM felhő mappából:
ko: 클라우드 ScummVM 폴더에서 게임 파일을 다운로드할 수 있습니다:
sv_se: Du kan hämta ner spelfiler från din ScummVM-katalog i molnet:

source: Download game files
hu_hu: Játék fájlok letöltése
ko: 게임 파일 다운로드
sv_se: Hämta ner spelfiler

source: Open downloads manager dialog
hu_hu: Letöltéskezelő párbeszédablak megnyitása
ko: 다운로드 관리자 대화 상자 열기
sv_se: Öppna fönstret för hämtningshanteraren

# lowres
source: To change account for this storage, disconnect and connect again:
hu_hu: A tároló fiók megváltoztatásához lépjen ki, majd újra lépjen be:
ko: 이 저장소의 계정을 변경하려면, 연결을 끊었다가 다시 연결하세요:
sv_se: För att byta konto för den här lagringen kopplar du från och kopplar sedan upp igen:

source: To change account for this storage, disconnect and connect again:
hu_hu: A tároló fiók megváltoztatásához lépjen ki, majd újra lépjen be:
ko: 이 저장소의 계정을 변경하려면, 연결을 끊었다가 다시 연결하세요:
sv_se: För att byta konto för den här lagringen, koppla från och koppla sedan upp igen:

source: Disconnect
hu_hu: Szétkapcsolás
ko: 연결 해제
sv_se: Koppla från

source: Stop using this storage on this device
hu_hu: Ne használja többet ezt a tárlót az eszközön
ko: 이 장치에서 이 저장소 사용을 중지
sv_se: Sluta använda den här lagringen på den här enheten

# lowres
source: This storage is not connected yet!
hu_hu: A tároló még nincs csatlakoztatva!
ko: 이 저장소는 아직 연결되지 않았습니다!
sv_se: Den här lagringen är inte ansluten än!

source: This storage is not connected yet!
hu_hu: A tároló még nincs csatlakoztatva!
ko: 이 저장소는 아직 연결되지 않았습니다!
sv_se: Den här lagringen är inte ansluten än!

source: Connect
hu_hu: Kapcsolódás
ko: 연결
sv_se: Anslut

source: Connect your cloud storage account
hu_hu: Csatlakoztassa felhő tároló fiókját
ko: 클라우드 저장소 계정 연결
sv_se: Anslut ditt molnlagringskonto

# lowres
source: /root/ Path:
hu_hu: /gyökér/ Útvonal:
ko: /root/ 경로:
sv_se: Sökväg till /root/:

source: Select which directory will be shown as /root/ in the Files Manager
hu_hu: Válassza ki, melyik könyvtár jelenjen meg /gyökér/ néven a Fájlkezelőben
ko: 파일 관리자에서 /root/로 표시될 디렉터리를 선택
sv_se: Bestämmer vilken mapp filhanteraren visar som rotkatalog

source: /root/ Path:
hu_hu: /gyökér/ Útvonal:
ko: /root/ 경로:
sv_se: Sökväg till /root/:

source: Server's port:
hu_hu: Szerver portja:
ko: 서버 포트:
sv_se: Serverport:

source: Port for server to use
hu_hu: Port a kiszolgáló számára
ko: 서버가 사용할 포트
sv_se: Port för servern att använda

# lowres
source: Run server to manage files with browser (in the same network).
hu_hu: Kiszolgáló futtatás a fájlok kezeléséhez böngészőn belül (azonos hálózatban).
ko: (동일한 네트워크에서) 브라우저로 파일을 관리하기 위해 서버를 실행합니다.
sv_se: Kör server för att hantera filer med webbläsare (i samma nätverk).

# lowres
source: Closing options dialog will stop the server.
hu_hu: Az Opciók párbeszédpanel bezárása leállítja a szervert.
ko: 옵션 대화 상자를 닫으면 서버가 중지됩니다.
sv_se: Om du stänger dialogrutan stoppas servern.

source: Run server to manage files with browser (in the same network).
hu_hu: Kiszolgáló futtatás a fájlok kezeléséhez böngészőn belül (azonos hálózatban).
ko: (동일한 네트워크에서) 브라우저로 파일을 관리하기 위해 서버를 실행합니다.
sv_se: Kör server för att hantera filer i webbläsare (inom samma nätverk).

source: Closing options dialog will stop the server.
hu_hu: Az Opciók párbeszédpanel bezárása leállítja a szervert.
ko: 옵션 대화 상자를 닫으면 서버가 중지됩니다.
sv_se: Om du stänger inställningsdialogrutan stoppas servern.

source: Use Text to speech
hu_hu: Használjon szövegfelolvasót
ko: TTS 사용
sv_se: Använd text till tal (TTT)

source: Will read text in gui on mouse over.
hu_hu: Az egér alatt levő felhasználói felület szövegét felolvassa.
ko: 마우스를 올리면 GUI에서 텍스트를 읽습니다.
sv_se: Läser gränssnittets text när muspekaren flyttas över.

source: Ignore
hu_hu: Mellőz
ko: 무시
sv_se: Ignorera

source: Disable autosave
hu_hu: Automata mentés letiltás
ko: 자동 저장 비활성화
sv_se: Inaktivera automatisk sparning
