Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: Enable the "A Pirate I Was Meant To Be" song
hu_hu: Engedélyezi a „A kalóz, aminek kellett volna lennem” dalt
ko: "A Pirate I Was Meant To Be" 노래 활성화
sv_se: Aktivera sången "A Pirate I Was Meant To Be"

source: Enable the song at the beginning of Part 3 of the game, "A Pirate I Was Meant To Be", which was cut in international releases. Beware though: subtitles may not be fully translated.
hu_hu: "A kalóz, aminek kellett volna lennem" szám lejátszása a játék harmadik felvonásának elején, melyet kivágtak a nemzetközi verzióból. Azonban vegye figyelembe, hogy a feliratok nincsenek teljesen lefordítva.
ko: 게임 3부 시작 부분에서 삭제된 노래 "A Pirate I Was Meant To Be"를, 인터내셔널 출시 버전에서는 활성화합니다. 하지만 자막이 완전히 번역되지 않았을 수 있으니 주의하세요.
sv_se: Aktivera låten i början av del 3 i spelet, ”A Pirate I Was Meant To Be”, som klipptes bort i internationella utgåvor. Var dock uppmärksam: undertexterna kanske inte är helt översatta.

source: Enable demo/kiosk mode
hu_hu: Demó/kioszk mód bekapcsolása
ko: 데모/키오스크 모드 활성화
sv_se: Aktivera demo-/kioskläge

source: Enable demo/kiosk mode in the full retail version of Maniac Mansion.
hu_hu: A demó/kioszk mód bekapcsolása a Maniac Mansion teljes verziójában.
ko: 매니악 맨션의 정식 버전에서 데모/키오스크 모드를 활성화하세요.
sv_se: Aktivera demo-/kioskläge i den fullständiga versionen av Maniac Mansion.

source: Use remastered audio
hu_hu: Remasterelt hang használata
ko: 리마스터 오디오 사용
sv_se: Använd remastrat ljud

source: Use the remastered speech and sound effects.
hu_hu: Használja a remasterelt beszéd és effekt hangokat.
ko: 리마스터된 대사와 사운드 효과를 사용합니다.
sv_se: Använd det remastrade talet och ljudeffekterna.

source: Enable ambience sounds
hu_hu: Környezeti hangok engedélyezése
ko: 공연장 분위기 사운드 활성화
sv_se: Aktivera stämningsljud

source: Enable ambience sounds.
hu_hu: Környezeti hangok engedélyezése.
ko: 공연장 분위기 사운드 활성화합니다.
sv_se: Aktivera stämningsljud.

source: Down left
sv_se: Nedåt vänster

source: Down right
sv_se: Nedåt höger

source: Up left
sv_se: Uppåt vänster

source: Up right
sv_se: Uppåt höger

source: Switch weapon
hu_hu: Fegyver váltás
ko: 무기 전환
sv_se: Byt vapen

source: Win the bike fight cheat
hu_hu: Csalás a motoros harc megnyeréséhez
ko: 자전거 대결에서 승리하는 치트
sv_se: Vinn cykelkampsfusket

source: Warning: incompatible sound settings detected between the current configuration and this saved game. Current music device: %s (id %d) Save file music device: %s (id %d) Loading will be attempted, but the game may behave incorrectly or crash. Please change the audio configuration accordingly in order to properly load this save file.
hu_hu: Figyelem: a jelenlegi konfiguráció és a mentés között kompatibilitási problémák vannak. Jelenlegi zene eszköz: %s (id %d) Mentésben levő zenei eszköz: %s (id %d) Megkísérlésre kerül a betöltés, de a játék nem biztos, hogy megfelelő módon fog működni, esetlegesen ki is fagyhat. Kérem állítsa át a hangbeállításokat a mentésnek megfelelően a megfelelő betöltés érdekében.
ko: 경고: 현재 구성과 이 저장된 게임 간에 호환되지 않는 사운드 설정이 감지되었습니다. 현재 음악 장치: %s (id %d) 저장 파일 음악 장치: %s (id %d) 불러오기를 시도하지만 게임이 제대로 작동하지 않거나 충돌할 수 있습니다. 이 저장 파일을 제대로 불러오려면 오디오 구성을 적절히 변경하세요.
sv_se: Varning: inkompatibla ljudinställningar upptäcktes mellan aktuell konfiguration och detta sparade spel. Aktuell musikenhet: %s (id %d) Musikenhet i sparfil: %s (id %d) Inläsning kommer att försökas men spelet kan bete sig felaktigt eller krascha. Ändra ljudkonfigurationen därefter för att kunna läsa in denna sparfil ordentligt.

source: You have enabled 'aspect ratio correction'. However, FM-TOWNS' natural resolution is 320x240, which doesn't allow aspect ratio correction. Aspect ratio correction can be achieved by trimming the resolution to 320x200, under 'engine' tab.
hu_hu: Engedélyezte a 'képarány korrekciót'. Azonban az FM-TOWNS alap felbontása azonban 320x240, ami nem teszi lehetővé a képarány korrekcióját. A képarány korrekciója úgy érhető el, hogy a 'motor' fül alatt a felbontást 320x200-ra vágja le.
ko: '화면비 교정'을 활성화했습니다. 그러나, FM-TOWNS의 자연스러운 해상도는 320x240으로 화면비 교정을 허용하지 않습니다. 화면비 교정은 '엔진' 탭에서 해상도를 320x200으로 잘라내어 달성할 수 있습니다.
sv_se: Du har aktiverat "korrigering av bildförhållande". FM-TOWNS' naturliga upplösning är dock 320x240, vilket inte tillåter korrigering av bildförhållande. Korrigering av bildförhållande kan uppnås genom att beskära upplösningen till 320x200, under fliken "motor".

source: This game requires the '%s' Macintosh executable for its fonts.
hu_hu: A játékhoz szükség van a '%s' Macintosh indítófájlra a betűtípus miatt.
ko: 이 게임의 글꼴을 사용하려면 '%s' 매킨토시 실행 파일이 필요합니다.
sv_se: Detta spel kräver körbara '%s' Macintosh-filen för sina typsnitt.

source: This game requires the '%s' Macintosh executable for its music and fonts.
hu_hu: A játékhoz szükség van a '%s' Macintosh indítófájlra a zene és betűtípus miatt.
ko: 이 게임은 음악과 글꼴을 사용하려면 '%s' 매킨토시 실행 파일이 필요합니다.
sv_se: Detta spel kräver den körbara '%s' Macintosh-filen för sin musik och typsnitt.

source: Could not find the '%s' Macintosh executable to read resources from. %s will be disabled.
hu_hu: Az adatok nem nyerhetőek ki, mert nem található a '%s' Macintosh indítófájl. Emiatt %s kikapcsolásra kerül.
ko: 리소스를 읽기 위한 매킨토시 실행 파일 '%s'를 찾을 수 없습니다. %s는 비활성화됩니다.
sv_se: Kunde inte hitta den körbara Macintosh-filen för '%s' att läsa in resurser från. %s kommer att inaktiveras.

source: The Mac GUI
hu_hu: A Mac felület
ko: 맥 GUI
sv_se: Mac-gränssnittet

source: The music and the Mac GUI
hu_hu: A zene és a Mac felület
ko: 음악과 맥 GUI
sv_se: Musiken och Mac-gränssnittet

source: Could not open Macintosh resource file %s
hu_hu: Nem nyitható meg a %s adat fájl
ko: 매킨토시 리소스 파일 %s을(를) 열 수 없음
sv_se: Kunde inte öppna Macintosh-resursfilen %s

source: Could not find resource fork in Macintosh resource file %s
hu_hu: Fork adat nem található a %s Macintosh adatfájlban
ko: 매킨토시 리소스 파일 %s에서 리소스 포크를 찾을 수 없음
sv_se: Kunde inte hitta resursgren i Macintosh-resursfilen %s

source: '%s' appears to be the wrong Dig executable. It may be the launcher one found in the CD root, which does not contain any of the necessary menu and dialog definitions. Look for a 'The Dig f' folder on your CD. Any one from its sub-folders should be what you need.
hu_hu: Úgy tűnik '%s' nem a megfelelő Dig indítófájl. Lehet, hogy ez az indító amely a CD tőkönyvtárában található, ami azonban nem tartalmazza a szükséges menü és dialógus definíciókat. Keresse meg a 'The Dig f' mappát a CD-jén. Ennek alkönyvtáraiban kell legyen az amit keres.
ko: '%s'는 잘못된 Dig 실행 파일인 듯합니다. CD 루트에서 찾은 런처일 수 있는데, 여기에는 필요한 메뉴와 대화 상자 정의가 하나도 없습니다. CD에서 'The Dig f' 폴더를 찾으세요. 하위 폴더 중 하나면 필요한 것이 있을 것입니다.
sv_se: '%s' verkar vara fel körbar Dig-fil. Det kan vara spelstartaren som finns i cd-skivans rot, som inte innehåller några av de nödvändiga meny- och dialogdefinitionerna. Leta efter en "The Dig f"-mapp på din cd. Vilken som helst av dess undermappar bör vara vad du behöver.

source: Audio files compressed with ScummVM Tools were detected; *.BUN/*.SOU compression is not supported anymore for this game, audio will be disabled. Please copy the game from the original media without compression.
hu_hu: A rendszer ScummVM Tools-al tömörített hangfájlokat észlelt; *.BUN/*.SOU a tömörítés már nem támogatott ebben a játékban, a hang letiltásra kerül. Kérjük, másolja a tömörítetlen játékot az eredeti adathordozóról.
ko: ScummVM 도구로 압축된 오디오 파일이 감지되었습니다; *.BUN/*.SOU 압축은 이 게임에서 더 이상 지원되지 않으므로 오디오가 비활성화됩니다. 게임을 압축하지 않고 원본 미디어에서 복사하세요.
sv_se: Ljudfiler komprimerade med ScummVM Tools upptäcktes; *.BUN/*.SOU- kompression stöds inte längre för detta spel, ljud kommer att inaktiveras. Kopiera spelet från originalmedia utan kompression.

source: Native MIDI support requires the Roland Upgrade from LucasArts, but %s is missing. Using AdLib instead.
hu_hu: A natív MIDI támogatáshoz szükséges a Roland Upgrade a LucasArts-tól, de a %s hiányzik. Helyette AdLib kerül használatra.
ko: 실기 미디 지원에는 루카스아츠의 롤랜드 업그레이드가 필요하지만, %s가 없습니다. 대신 애드립을 사용합니다.
sv_se: Stöd för Native MIDI kräver Roland-uppdateringen från LucasArts, men %s saknas. Använder AdLib istället.

source: This particular version of Monkey Island 1 is known to miss some required resources for MT-32. Using AdLib instead.
hu_hu: A Monkey Island 1 ezen verziója arról ismeretes, hogy hiányzik néhány szükséges erőforrás az MT-32-höz. Helyette AdLib kerül használatra.
ko: 이 특정 버전의 원숭이 섬 1은 MT-32에 필요한 리소스가 일부 빠진 것으로 알려져 있습니다. 대신 애드립을 사용합니다.
sv_se: Denna specifika version av Monkey Island 1 är känd för att sakna några resurser som krävs för MT-32. Använd AdLib istället.

source: Usually, Maniac Mansion would start now. But for that to work, the game files for Maniac Mansion have to be in the 'Maniac' directory inside the Tentacle game directory, and the game has to be added to ScummVM.
hu_hu: Általában a Maniac Mansion elindult volna. Azonban ahhoz, hogy ez működjön a Maniac Mansion játék fájlokban benne kell lennie a 'Maniac' mappában a Tentacle mappán belül, és a játékot hozzá kell adni a ScummVM indítóhoz.
ko: 보통, 매니악 맨션은 지금 시작해야 합니다. 하지만 그렇게 하려면 매니악 맨션의 게임 파일이 Tentacle 게임 디렉터리 내의 'Maniac' 디렉터리에 있어야 하고, 게임을 ScummVM에 추가해야 합니다.
sv_se: Vanligtvis hade Maniac Mansion startat nu, men för att det ska fungera måste Maniac Mansion-filerna placeras i 'Maniac'-katalogen i 'Tentacle'-katalogen. Spelet måste även läggas till i ScummVM.

source: Would you like to host or join a network play session?
hu_hu: Szeretne hálózati játékmenetet hosztolni vagy csatlakozni?
ko: 네트워크 플레이 세션을 호스팅하거나 참여하고 싶습니까?
sv_se: Vill du stå värd för eller gå med i en session för nätverksspel?

source: Random Map Options
hu_hu: Véletlenszerű Térkép Opciók
ko: 무작위 지도 옵션
sv_se: Alternativ för slumpmässiga kartor

source: Algorithm
hu_hu: Algoritmus
ko: 알고리즘
sv_se: Algoritm

source: Random
hu_hu: Véletlenszerű
ko: 무작위
sv_se: Slumpmässig

source: Picks the map algorithm randomly.
hu_hu: Véletlenszerűen választja ki térkép algoritmust.
ko: 지도 알고리즘을 무작위로 선택합니다.
sv_se: Väljer kartalgoritmen slumpmässigt.

source: Size
hu_hu: Méret
ko: 크기
sv_se: Storlek

source: Small
hu_hu: Kicsi
ko: 작게
sv_se: Liten

source: Large
hu_hu: Nagy
ko: 크게
sv_se: Stor

source: Huge
hu_hu: Óriási
ko: 거대
sv_se: Enorm

source: Ridiculous
hu_hu: Gigantikus
ko: 터무니없는
sv_se: Löjligt

source: Picks the map size randomly.
hu_hu: Véletlenszerűen választja ki a térkép méretet.
ko: 지도 크기를 무작위로 선택합니다.
sv_se: Väljer kartstorleken slumpmässigt.

source: Tileset
hu_hu: Térképrács
ko: 타일셋
sv_se: Plattuppsättning

source: Picks the map tileset randomly.
hu_hu: Véletlenszerűen választja ki a térképmintát.
ko: 지도 타일셋을 무작위로 선택합니다.
sv_se: Väljer kartans plattuppsättning slumpmässigt.

source: Energy
hu_hu: Energia
ko: 에너지
sv_se: Energi

source: Scarce - Lots
hu_hu: Kevés - Sok
ko: 희소 - 다수
sv_se: Knapp - Mycket

source: Picks the random amount of energy pools.
hu_hu: Véletlen nagyságú energia készletek.
ko: 에너지 풀의 양을 무작위로 선택합니다.
sv_se: Väljer den slumpmässiga mänden av energipooler.

source: Terrain
hu_hu: Felszín
ko: 지형
sv_se: Terräng

source: Barren - Rough
hu_hu: Sík - Dombos
ko: 척박 - 거침
sv_se: Karg - Ojämn

source: Picks the random amount of terrain level.
hu_hu: Véletlen felszínszerkezet kiválasztása.
ko: 지형 레벨을 무작위로 선택합니다.
sv_se: Väljer den slumpmässiga mängden terrängnivå.

source: Water
hu_hu: Víz
ko: 물
sv_se: Vatten

source: Driest - Wettest
hu_hu: Száraz - Nyirkos
ko: 가장 건조 - 가장 습함
sv_se: Torrast - Blötast

source: Picks the random amount of water.
hu_hu: Véletlen nedvesség választása.
ko: 물의 양을 무작위로 선택합니다.
sv_se: Väljer den slumpmässiga mängden vatten.

source: Generate
hu_hu: Generálás
ko: 생성
sv_se: Generera

source: Unimplemented development codepath encountered within the sound engine, please file a ticket at https://bugs.scummvm.org.
hu_hu: Nem implementált fejlesztési kódjavítás található a hang motorjában, nyisson egy ticket-et a https://bugs.scummvm.org oldalon.
ko: 사운드 엔진 내에서 구현되지 않은 개발 코드 경로가 발견되었습니다, https://bugs.scummvm.org에서 티켓을 제출하세요.
sv_se: Oimplementerad utvecklingskodväg anträffad i ljudmotorn, rapportera ett fel på https://bugs.scummvm.org.

source: This AMIGA version is missing (at least) the following file(s):
hu_hu: Ez az AMIGA verzióból hiányoznak a következő fájlok:
ko: 이 아미가 버전에는 (최소한) 다음 파일이 누락되었습니다:
sv_se: Denna AMIGA-version saknar (minst) följande fil(er):

source: Please copy these file(s) into the game data directory.
hu_hu: Kérjük, másolja ezeket a fájlokat a játék könyvtárába.
ko: 다음 파일들을 게임 데이터 디렉터리에 복사해 주세요.
sv_se: Kopiera dessa fil(er) in i spelets datakatalog.

source: Pixellated scene transitions
hu_hu: Pixeles jelenet átmenetek
ko: 픽셀화된 장면 전환
sv_se: Pixliga scenövergångar

source: When changing scenes, a randomized pixel transition is done
hu_hu: Helyszínek váltásánál, egy véletlenszerű pixel átmenet történik
ko: 장면을 변경할 때 무작위 픽셀 전환 수행
sv_se: En slumpmässig bildpunktsövergång visas vid scenbyten

source: Don't show hotspots when moving mouse
hu_hu: Aktív pontok elrejtése egérmozgatás közben
ko: 마우스를 움직일 때 핫스팟을 표시 안 함
sv_se: Visa inte känsliga punkter vid musrörelse

source: Only show hotspot names after you actually click on a hotspot or action button
hu_hu: Csak az aktív pontok nevének jelzése a kattintást vagy művelet gomb lenyomást követően
ko: 핫스팟이나 작업 버튼을 실제로 클릭한 후에만 핫스팟 이름을 표시함
sv_se: Visar endast namn för aktiveringspunkter när du klickar på en aktiveringspunkt eller handlingsknapp

source: Show character portraits
hu_hu: Karakter portrék mutatása
ko: 캐릭터 인물 표시
sv_se: Visa karaktärsporträtt

source: Show portraits for the characters when conversing
hu_hu: Karakter portrék mutatása beszélgetés közben
ko: 대화 시 캐릭터 인물 표시
sv_se: Visa porträtt för karaktärerna vid konversation

source: Slide dialogs into view
hu_hu: Párbeszéd becsúsztatása
ko: 대화 상자 슬라이드 보기
sv_se: Låt dialogrutor glida in

source: Slide UI dialogs into view, rather than simply showing them immediately
hu_hu: Az azonnali megjelenítés helyett a párbeszéd panel becsúszik a képernyőre
ko: UI 대화 상자를 바로 보여주는 대신, 슬라이드로 표시
sv_se: Låter gränssnittets dialogrutor glida in i bilden istället för att bara visa dem direkt

source: Transparent windows
hu_hu: Átlátszó ablakok
ko: 투명한 창
sv_se: Genomskinliga fönster

source: Show windows with a partially transparent background
hu_hu: Ablakok részlegesen átlátszó háttérrel való megjelenítése
ko: 부분적으로 투명한 배경을 가진 창 표시
sv_se: Visar fönster med en delvis genomskinlig bakgrund

source: Scroll keymappings
sv_se: Kortkommandon för rullning

source: Main user interface keymappings
sv_se: Kortkommandon för huvudmenyns gränssnitt

source: Darts minigame keymappings
sv_se: Kortkommandon för Darts-minispel

source: Talk keymappings
sv_se: Kortkommandon för tal

source: Files keymappings
sv_se: Kortkommandon för filer

source: Settings keymappings
sv_se: Kortkommandon för inställningar

source: Movie keymappings
sv_se: Kortkommandon för filmer

source: Skip / Deselect verb
sv_se: Hoppa över / Avmarkera verb

source: Setup
sv_se: Konfigurera

source: Files
sv_se: Filer

source: Go back 10 pages
sv_se: Gå bakåt 10 sidor

source: Go forward 10 pages
sv_se: Gå framåt 10 sidor

source: First page
hu_hu: Első oldal
ko: 첫 페이지
sv_se: Första sida

source: Last page
hu_hu: Utolsó oldal
ko: 마지막 페이지
sv_se: Sista sida

source: Scroll left
sv_se: Rulla åt vänster

source: Scroll right
sv_se: Rulla åt höger

source: Select option
sv_se: Välj alternativ

source: Toggle music
sv_se: Växla musik

source: Toggle portraits
sv_se: Växla porträtt

source: Change font style
sv_se: Ändra typsnittsstil

source: Toggle sound effects
sv_se: Växla ljudeffekter

source: Toggle windows mode
sv_se: Växla fönsterläge

source: Change auto-help location
sv_se: Byt plats för automatisk hjälp

source: Toggle voices
sv_se: Växla röster

source: Fade by pixel
sv_se: Tona ut efter bildpunkt

source: Fade directly
sv_se: Tona ut direkt

source: Change fade mode
sv_se: Ändra uttoningsläge

source: Journal search keymappings
sv_se: Kortkommandon för dagbokssökning

source: Menu scrolling keymappings
sv_se: Kortkommandon för menyrullning

source: save / load menu keymappings
sv_se: spara / läs in kortkommandon för meny

source: Save files name editing keymappings
sv_se: Kortkommandon för redigeringsmeny för sparade filnamn

source: Foolscap puzzle keymappings
sv_se: Kortkommandon för Foolscap-pussel

source: Options menu keymappings
sv_se: Kortkommandon för alternativmeny

source: Password entry keymappings
sv_se: Kortkommandon för lösenordsinmatning

source: Talk options keymappings
sv_se: Kortkommandon för talalternativ

source: Move / Examine / Select
sv_se: Flytta / Undersök / Välj

source: Change speed
sv_se: Ändra hastighet

source: Open journal
sv_se: Öppna dagbok

source: Open options menu
hu_hu: Opciók menü megnyitása
ko: 옵션 메뉴 열기
sv_se: Öppna alternativmenyn

source: Exit / Close window
sv_se: Avsluta / Stäng fönster

source: Change selected option to the left
sv_se: Ändra valt alternativ till vänster

source: Change selected option to the right
sv_se: Ändra valt alternativ till höger

source: Skip darts minigame
sv_se: Hoppa över dart-minispel

source: Scroll to top left
sv_se: Rulla längst upp till vänster

source: Scroll to bottom right
sv_se: Rulla längst ner

source: Scroll to end
sv_se: Rulla till slutet

source: Scroll to start
sv_se: Rulla till början

source: Go to next save file slot
sv_se: Gå till nästa plats för sparad fil

source: Go to next page of save files
sv_se: Gå till nästa sida för sparade filer

source: Select save file
sv_se: Välj sparningsfil

source: Toggle insert mode
sv_se: Växla infogningsläge

source: Close puzzle
sv_se: Stäng pussel

source: Exit inventory / Close verb menu / Cancel item use action
sv_se: Avsluta inventerier / Stäng verbmeny / Avbryt åtgärd för objektanvändning

source: Go to the line start
sv_se: Gå till radbörjan

source: Go to the line end
sv_se: Gå till radslut

source: Select next option
sv_se: Välj nästa alternativ

source: Go to next talk option
sv_se: Gå till nästa dialogalternativ

source: Go to previous talk option
sv_se: Gå till föregående dialogalternativ

source: The "sky.cpt" engine data file has an incorrect size.
hu_hu: A "sky.cpt" motor adatfájl mérete inkorrekt.
ko: "sky.cpt" 엔진 데이터 파일의 크기가 잘못 되었습니다.
sv_se: Datafilen 'sky.cpt' har felaktig storlek.

source: Walk / Look / Talk
hu_hu: Séta / Néz / Beszél
ko: 걷기 / 보기 / 말하기
sv_se: Gå / Titta / Prata

source: Skip / Close
hu_hu: Átugrik / Bezár
ko: 건너뛰기 / 닫기
sv_se: Hoppa över / Stäng

source: Open control panel
hu_hu: Vezérlőpult megnyitása
ko: 제어판 열기
sv_se: Öppna kontrollpanel

source: Toggle really fast mode on / off
sv_se: Växla väldigt snabbt läge på/av

source: Floppy intro
hu_hu: Floppy bevezető
ko: 플로피 버전 인트로
sv_se: Diskettintro

source: Use the floppy version's intro (CD version only)
hu_hu: A floppy verziós bevezető használata (csak CD verziónál)
ko: 플로피 버전의 인트로를 사용 (CD 버전만)
sv_se: Använd diskettversionens intro (endast CD-version)

source: WARNING: Deleting the autosave slot is not supported by this engine
hu_hu: FIGYELEM: Ez a motor nem támogatja az automatikus mentési slot törlését
ko: 경고: 자동 저장 슬롯 삭제는 이 엔진에서 지원되지 않음
sv_se: VARNING: Att ta bort autosparposter stöds inte av denna motor

source: Debug keymappings
sv_se: Felsök kortkommandon

source: Minigame keymappings
sv_se: Kortkommandon för minispel

source: Change action
sv_se: Byt åtgärd

source: Speed up dialog
sv_se: Snabba upp dialog

source: Slow down dialog
sv_se: Sakta ner dialog

source: Load auto save
sv_se: Läs in autosparning

source: Load save
sv_se: Läs in sparat spel

source: DEBUG: Show floor
sv_se: FELSÖK: Visa golv

source: DEBUG: Show boxes
sv_se: FELSÖK: Visa rutor

source: Inventory / Examine
sv_se: Inventarier / Utforska

source: Examine / Skip dialog
sv_se: Undersök / Hoppa över dialog

source: Pause / Skip cutscene
sv_se: Pausa / Hoppa över mellansekvens

source: Smell
sv_se: Lukta

source: Consume
sv_se: Konsumera

source: Cast earth spell
sv_se: Kasta jordbesvärjelse

source: Cast air spell
sv_se: Kasta luftbesvärjelse

source: Cast fire spell
sv_se: Kasta eldbesvärjelse

source: Cast water spell
sv_se: Kasta vattenbesvärjelse

source: Move / Interact / Skip dialog
sv_se: Flytta / Interagera / Hoppa över dialog

source: Inventory / Skip dialog
sv_se: Inventarier / Hoppa över dialog

source: Load modded assets
hu_hu: Módosított eszközök betöltése
ko: 개조된 자산 불러오기
sv_se: Läs in modifierade resurser

source: Enable loading of external replacement assets.
hu_hu: Külső helyettesítő eszközök betöltésének engedélyezése.
ko: 외부 대체 자산의 불러오기를 활성화합니다.
sv_se: Aktivera inläsning av externa ersättningsresurser.

source: Enable linear filtering of the backgrounds images
hu_hu: A háttérképek lineáris szűrésének engedélyezése
ko: 백그라운드 이미지의 선형 필터링 활성화
sv_se: Aktivera linjärfiltrering av bakgrundsbilder

source: When linear filtering is enabled the background graphics are smoother in full screen mode, at the cost of some details.
hu_hu: Ha a lineáris szűrés engedélyezve van, a háttérgrafika simább teljes képernyős módban, a részlet megjelenítés kárára.
ko: 선형 필터링을 활성화하면 전체 화면 모드에서 백그라운드 그래픽이 더 부드러워지지만, 일부 디테일이 손실됩니다.
sv_se: När linjär filtrering är aktiverad blir bakgrundsgrafiken jämnare i helskärmsläge, på bekostnad av vissa detaljer.

source: Enable font anti-aliasing
hu_hu: Betűtípus élsimítás bekapcsolása
ko: 글꼴 안티 에일리어싱 활성화
sv_se: Aktivera kantutjämning för typsnitt

source: When font anti-aliasing is enabled, the text is smoother.
hu_hu: Ha a betűtípus élsimítás be van kapcsolva, a betűk tisztábbak.
ko: 글꼴 안티 에일리어싱을 활성화하면, 텍스트가 더 부드러워집니다.
sv_se: När kantutjämning för typsnitt är aktiverat blir texten mjukare.

source: Diary menu
hu_hu: Napló menü
ko: 일기 메뉴
sv_se: Dagboksmeny

source: Conversation log
hu_hu: Beszélgetés naplója
ko: 대화 로그
sv_se: Konversationslogg

source: April's diary (initially disabled)
hu_hu: April naplója (elején kikapcsolva)
ko: 4 월 일기 (초기에는 비활성화됨)
sv_se: Aprils dagbok (initialt inaktiverad)

source: Video replay
hu_hu: Videó visszajátszás
ko: 비디오 리플레이
sv_se: Spela upp video igen

source: Game settings
hu_hu: Játék beállítások
ko: 게임 설정
sv_se: Spelinställningar

source: Toggle subtitles
hu_hu: Felirat megjelenítés
ko: 자막 전환
sv_se: Växla undertexter

source: Quit to menu
hu_hu: Kilépés a menübe
ko: 메뉴 종료
sv_se: Avsluta till menyn

source: Cycle back through inventory cursor items
hu_hu: Visszalapozás a felszerelésben
ko: 인벤토리 커서 아이템 뒤로 순환
sv_se: Växla bakåt genom översiktens markörobjekt

source: Cycle forward through inventory cursor items
hu_hu: Előrelapozás a felszerelésben
ko: 인벤토리 커서 아이템을 앞으로 순환
sv_se: Växla framåt genom översiktens markörobjekt

source: Display all exits on current location
hu_hu: A jelenlegi helyről való kiutak megjelenítése
ko: 현재 위치의 모든 나가기 표시
sv_se: Visa alla utgångar på aktuell plats

source: Scroll up in inventory
hu_hu: Felgörgetés a felszerelésben
ko: 인벤토리에서 위로 스크롤
sv_se: Rulla uppåt i översikten

source: Scroll down in inventory
hu_hu: Legörgetés a felszerelésben
ko: 인벤토리에서 아래로 스크롤
sv_se: Rulla nedåt i översikten

source: Scroll up in your dialogs
sv_se: Rulla uppåt i dina dialoger

source: Scroll down in your dialogs
sv_se: Rulla neråt i dina dialoger

source: Go to next dialog
sv_se: Gå till nästa dialog

source: Go to previous dialogs
sv_se: Gå till föregående dialoger

source: Select dialog
sv_se: Välj dialog

source: Skip video sequence or dialog
sv_se: Hoppa över videosekvens eller dialog

source: Software renderer does not support modded assets
hu_hu: A szoftver render nem támogatja a módosított eszközöket
ko: 소프트웨어 렌더러는 수정된 자산을 지원하지 않음
sv_se: Programvarurenderare har inte stöd för modifierade resurser

source: You are missing recommended data files:
hu_hu: Hiányzó ajánlott adatfájlok:
ko: 권장되는 데이터 파일이 없음:
sv_se: Du saknar rekommenderade datafiler:
