Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: Apple Macintosh Audio
hu_hu: Apple Macintosh Hang
ko: 애플 매킨토시 오디오
sv_se: Apple Macintosh-ljud

source: (built on %s with %s)
hu_hu: (összeállítva %s dátummal, %s segítségével)
ko: (%s에서 %s로 빌드됨)
sv_se: (byggdes %s med %s)

source: Features compiled in:
hu_hu: Fordítói funkciók:
ko: 다음과 같은 기능이 있습니다:
sv_se: Inkompilerade funktioner:

source: not supported
hu_hu: nem támogatott
ko: 지원되지 않음
sv_se: stöds inte

source: disabled
hu_hu: kikapcsolva
ko: 비활성화됨
sv_se: inaktiverad

source: enabled
hu_hu: bekapcsolva
ko: 활성화됨
sv_se: aktiverad

source: CPU extensions support:
hu_hu: CPU bővítmények támogatása:
ko: CPU 확장 지원:
sv_se: Stöd för CPU-utökningar:

source: Available engines:
hu_hu: Támogatott játékmotorok:
ko: 사용 가능한 엔진:
sv_se: Tillgängliga motorer:

source: Close
hu_hu: Bezárás
ko: 닫기
sv_se: Stäng

source: Show hidden files
hu_hu: Rejtett fájlok megjelenítése
ko: 숨긴 파일 표시
sv_se: Visa dolda filer

source: Show files marked with the hidden attribute
hu_hu: Rejtett attribútumú fájlok megjelenítése
ko: 숨김 속성이 있는 파일 표시
sv_se: Visa filer markerade med dolt attribut

source: Go up
hu_hu: Fentebb lépés
ko: 위로
sv_se: Gå uppåt

source: Go to previous directory level
hu_hu: Vissza az előző könyvtárszintre
ko: 상위 디렉터리로 이동
sv_se: Gå till föregående katalognivå

# lowres
source: Go up
hu_hu: Fentebb lépés
ko: 위로
sv_se: Gå uppåt

source: Cancel
hu_hu: Mégse
ko: 취소
sv_se: Avbryt

source: Choose
hu_hu: Kiválaszt
ko: 선택
sv_se: Välj

source: Cloud Connection Wizard
hu_hu: Felhőkapcsolat varázsló
ko: 클라우드 연결 마법사
sv_se: Guide för molntjänst

source: Quick mode
hu_hu: Gyors mód
ko: 빠른 모드
sv_se: Snabbläge

source: Manual mode
hu_hu: Kézi mód
ko: 수동 모드
sv_se: Manuellt läge

source: Will ask you to run the Local Webserver
hu_hu: Megkéri a helyi Webszerver futtatására
ko: 로컬 웹서버를 실행하도록 요청
sv_se: Frågar dig om att köra lokal webbserver

source: Requires the Local Webserver feature
hu_hu: Helyi Webszerver szolgáltatás szükséges
ko: 로컬 웹서버 기능이 필요
sv_se: Kräver att lokal webbserver körs

source: Quick Mode: Step 1
hu_hu: Gyors mód: 1. lépés
ko: 빠른 모드: 1 단계
sv_se: Snabbläge: Steg 1

source: In this mode, the Local Webserver must be running, so your browser can forward data to ScummVM
hu_hu: Ebben a módban a helyi webszervernek futnia kell, így a böngészője adatokat továbbíthat a ScummVM-nek
ko: 이 모드에서는 로컬 웹서버가 실행 중이어야, 브라우저가 ScummVM으로 데이터를 전달할 수 있음
sv_se: I denna läge måste lokal webbserver köras, så att din webbläsare kan vidarebefordra data till ScummVM

source: Stop server
hu_hu: Szerver leállítás
ko: 서버 중지
sv_se: Stoppa server

source: Run server
hu_hu: Szerver futtatás
ko: 서버 실행
sv_se: Starta server

source: Stop local webserver
hu_hu: Helyi webszerver leállítása
ko: 로컬 웹서버 중지
sv_se: Stoppa lokal webbserver

source: Run local webserver
hu_hu: Helyi webszerver futtatása
ko: 로컬 웹서버 실행
sv_se: Starta lokal webbserver

source: Not running
hu_hu: Nem fut
ko: 실행 중 아님
sv_se: Körs inte

source: Quick Mode: Step 2
hu_hu: Gyors mód: 2. lépés
ko: 빠른 모드 : 2 단계
sv_se: Snabbläge: Steg 2

source: Now, open this link in your browser:
hu_hu: Most nyissa meg a hivatkozást a böngészőjében:
ko: 이제, 브라우저에서 이 링크를 열어보세요:
sv_se: Öppna denna länk i din webbläsare:

source: Open URL
hu_hu: Hivatkozás megnyitása
ko: URL 열기
sv_se: Öppna URL

source: It will automatically pass the data to ScummVM, and warn you should there be any errors.
hu_hu: Az adatokat automatikusan továbbítja a ScummVM-nek, és figyelmezteti Önt hiba esetén.
ko: ScummVM에 자동으로 데이터가 전달되고, 오류가 있으면 경고합니다.
sv_se: Den vill automatiskt skicka data till ScummVM, och varna dig vid eventuella fel.

source: Local Webserver address:
hu_hu: Helyi Webszerver címe:
ko: 로컬 웹서버 주소:
sv_se: Lokal webbserveradress:

source: Quick Mode: Success
hu_hu: Gyors mód: Sikeres
ko: 빠른 모드: 성공
sv_se: Snabbläge: Lyckades

source: Your cloud storage has been connected!
hu_hu: A felhőtárhelye csatlakoztatva lett!
ko: 클라우드 저장소가 연결되었습니다!
sv_se: Din molnlagring har anslutits!

source: Finish
hu_hu: Befejezés
ko: 완료
sv_se: Avsluta

source: Manual Mode: Step 1
hu_hu: Kézi Mód: 1. lépés
ko: 수동 모드: 1 단계
sv_se: Manuellt läge: Steg 1

source: Open this link in your browser:
hu_hu: Nyissa meg a hivatkozást a böngészőben:
ko: 브라우저에서 이 링크 열기:
sv_se: Öppna denna länk i din webbläsare:

source: When it fails to pass the JSON code to ScummVM, find it on the Troubleshooting section of the page, and go to the next step here.
hu_hu: Ha nem sikerül átadni a JSON kódot a ScummVM-nek, megtalálja az oldal Hibaelhárítás részében, és térjen át itt a következő lépésre.
ko: ScummVM에 JSON 코드를 전달하지 못하는 경우, 해당 페이지의 문제 해결 섹션에서 해당 코드를 찾은 후, 다음 단계로 이동합니다.
sv_se: När den inte lyckas skicka JSON-koden till ScummVM, hitta felet på felsökningsdelen av sidan, och gå till nästa steg.

source: Manual Mode: Step 2
hu_hu: Kézi Mód: 2. lépés
ko: 수동 모드: 2 단계
sv_se: Manuellt läge: Steg 2

source: Copy the JSON code from the browser here and press Next:
hu_hu: Másolja ide a JSON kódot a böngészőből, és nyomjon a Tovább gombra:
ko: 브라우저에서 JSON 코드를 여기 복사하고 다음을 누름:
sv_se: Kopiera JSON-koden från webbläsaren hit och tryck Nästa:

source: Paste
hu_hu: Beillesztés
ko: 붙여넣기
sv_se: Klistra in

source: Paste code from clipboard
hu_hu: Kód beillesztése vágólapról
ko: 클립보드에서 코드 붙여넣기
sv_se: Klistra in kod från urklipp

source: Load
hu_hu: Betöltés
ko: 불러오기
sv_se: Läs in

source: Load code from file
hu_hu: Kód betöltése fájlból
ko: 파일에서 코드 불러오기
sv_se: Läs in kod från fil

source: Manual Mode: Something went wrong
hu_hu: Kézi Mód: Hiba lépett fel
ko: 수동 모드: 오류 발생
sv_se: Manuellt läge: Något gick fel

source: Cloud storage was not connected.
hu_hu: Felhőtárhely nem volt csatlakoztatva.
ko: 클라우드 저장소가 연결되지 않았습니다.
sv_se: Molnlagringen var inte ansluten.

source: Make sure the JSON code was copied correctly and retry.
hu_hu: Győződjön meg, hogy megfelelően másolta a JSON kódot, majd próbáld újra.
ko: JSON 코드가 올바르게 복사되었는지 확인하고 다시 시도하세요.
sv_se: Säkerställ att JSON-koden blev kopierad rätt och försök igen.

source: If that doesn't work, try again from the beginning.
hu_hu: Ha ez sem működik, próbálja újra az elejétől.
ko: 문제가 해결되지 않으면, 처음부터 다시 시도해 보세요.
sv_se: Om detta inte hjälper, starta om från början.

source: Error message:
hu_hu: Hibaüzenet:
ko: 오류 메세지:
sv_se: Felmeddelande:

source: Manual Mode: Success
hu_hu: Kézi Mód: Sikeres
ko: 수동 모드: 성공
sv_se: Manuellt läge: Lyckades

source: Back
hu_hu: Vissza
ko: 뒤로
sv_se: Tillbaka

source: Next
hu_hu: Következő
ko: 다음
sv_se: Nästa

source: Another Storage is working right now. Do you want to interrupt it?
hu_hu: Egy másik tároló éppen felhasználás alatt van. Biztosan meg kívánja szakítani?
ko: 다른 저장소가 지금 작동 중입니다. 중단할까요?
sv_se: En annan lagring fungerar just nu. Vill du avbryta den?

source: Yes
hu_hu: Igen
ko: 예
sv_se: Ja

source: No
hu_hu: Nem
ko: 아니오
sv_se: Nej

source: Wait until current Storage finishes and try again.
hu_hu: Várjon amíg a jelenlegi tároló végez, majd próbálja újra.
ko: 현재 저장소 작업이 완료될 때까지 기다린 후 다시 시도하세요.
sv_se: Vänta tills det nuvarande lagring är färdigt och försök igen.

source: JSON code contents are malformed.
hu_hu: A JSON kód tartalma hibás.
ko: JSON 코드 내용이 잘못되었습니다.
sv_se: JSON-koden innehåller fel.

source: Incorrect JSON.
hu_hu: Helytelen JSON.
ko: 잘못된 JSON입니다.
sv_se: Felaktig JSON.

source: Interrupted.
hu_hu: Megszakítva.
ko: 중단되었습니다.
sv_se: Avbruten.

source: Failed to open URL! Please navigate to this page manually.
hu_hu: Sikertelen hivatkozás megnyitás! Kérjük, navigáljon az oldalra manuálisan.
ko: URL을 여는데 실패했습니다! 해당 페이지로 직접 이동하세요.
sv_se: Kunde inte öppna URLen! Navigera till denna sida manuellt.

source: Select JSON file copied from scummvm.org site
hu_hu: Válassza ki a scummvm.org webhelyről másolt JSON fájlt
ko: scummvm.org 사이트에서 복사한 JSON 파일을 선택
sv_se: Välj JSON-fil kopierad från scummvm.org

source: Failed to load JSON file
hu_hu: JSON fájl betöltése sikertelen
ko: JSON 파일을 불러오는 데 실패함
sv_se: Kunde inte läsa in JSON-filen

source: Download Freeware Games and Demos
hu_hu: Ingyenes játékok és demók letöltése
ko: 무료 게임 및 데모 다운로드
sv_se: Hämta ner freeware-spel och demos

source: Fetching DLCs...
hu_hu: DLC-k lekérése...
ko: DLC를 가져오는 중...
sv_se: Hämtar DLC:er...

source: All Downloads
hu_hu: Minden Letöltés
ko: 모두 다운로드
sv_se: Alla hämtningar

source: Download
hu_hu: Letöltés
ko: 다운로드
sv_se: Hämta ner

source: Select directory where to download game data
hu_hu: Válassza ki, melyik mappába kívánja letölteni a játék adatokat
ko: 게임 데이터를 다운로드할 디렉터리를 선택
sv_se: Välj katalogen där du vill hämta ner speldata

source: Select directory with game data
hu_hu: Játék adat mappa kiválasztása
ko: 게임 데이터가 있는 디렉터리를 선택
sv_se: Välj katalog med speldata

source: From:
hu_hu: Innen:
ko: 다음에서:
sv_se: Från:

source: To:
hu_hu: Ide:
ko: 다음으로:
sv_se: Till:

source: Cancel download
hu_hu: Letöltés megszakítása
ko: 다운로드 취소
sv_se: Avbryt hämtning

# lowres
source: Cancel download
hu_hu: Letöltés megszakítása
ko: 다운로드 취소
sv_se: Avbryt hämtning

source: Hide
hu_hu: Elrejtés
ko: 숨김
sv_se: Dölj

source: It looks like your connection is limited. Do you really want to download files with it?
hu_hu: Úgy tűnik a kapcsolata korlátozott. Biztosan ezzel akarja letölteni a fájlokat?
ko: 연결이 제한된 것 같습니다. 정말 파일을 다운로드하겠습니까?
sv_se: Det verkar som att din anslutning är begränsad. Vill du verkligen använda den för att hämta ner filer?

source: ScummVM couldn't open the specified directory!
hu_hu: A ScummVM nem tudja megnyitni az előírt mappát!
ko: ScummVM이 지정된 디렉터리를 열 수 없습니다!
sv_se: ScummVM kunde inte öppna den angivna katalogen!

source: Cannot create a directory to download - the specified directory has a file with the same name.
hu_hu: A letöltési mappa nem hozható létre - a megadott könyvtárban van egy fájl ugyanazzal a névvel.
ko: 다운로드할 디렉터리를 만들 수 없습니다. 지정된 디렉터리에 동일한 이름의 파일이 있습니다.
sv_se: Kan inte skapa en katalog för hämtning - den angivna katalogen innehåller en fil med samma namn.

source: The "%s" already exists in the specified directory. Do you really want to download files into that directory?
hu_hu: A "%s" már létezik a megadott könyvtárban. Biztos benne hogy letölti a fájlokat ebbe a könyvtárba?
ko: 지정된 디렉터리에 "%s" 파일이 이미 존재합니다. 정말 해당 디렉터리에 파일을 다운로드하겠습니까?
sv_se: "%s" finns redan i den angivna katalogen. Vill du verkligen hämta ner filer i den katalogen?

source: Downloaded %s %S / %s %S
hu_hu: %s %S / %s %S letöltött
ko: %s %S / %s %S 다운로드 됨
sv_se: Hämtade ner %s %S / %s %S

source: Download speed: %s %S/s
hu_hu: Letöltési sebesség: %s %S/s
ko: 다운로드 속도: %s %S/s
sv_se: Hämtningshastighet: %s %S/s

source: Currently Downloading Games
hu_hu: Játék letöltés folyamatban
ko: 현재 게임 다운로드하는 중
sv_se: Hämtar för närvarande ner spel

source: Pending Downloads
hu_hu: Függő Letöltések
ko: 보류 중인 다운로드
sv_se: Väntande hämtningar

source: ERROR %d: %s
hu_hu: HIBA %d: %s
ko: 오류 %d: %s
sv_se: FEL %d: %s

source: Downloading %S list...
hu_hu: %S lista letöltése...
ko: %S 목록을 다운로드하는 중...
sv_se: Hämtar ner %S-lista...

source: Clear Cache
hu_hu: Gyorsítótár Ürítése
ko: 캐시 지우기
sv_se: Töm cache

source: Downloading %S list... %d entries
hu_hu: %S lista letöltése... %d bejegyzés
ko: %S 목록을 다운로드하는 중... %d 개 항목
sv_se: Hämtar ner %S-lista... %d poster

source: Detected %d new packs, %s %S
hu_hu: %d új csomag észlelve, %s %S
ko: %d 개의 새 팩이 감지되었음, %s %S
sv_se: Hittade %d nya paket, %s %S

source: Download complete, downloaded %d packs, %s %S
hu_hu: Letöltés kész, %d csomag letöltve, %s %S
ko: 다운로드 완료, %d 개의 팩 다운로드, %s %S
sv_se: Hämtningen är färdig, hämtade ner %d paket, %s %S

source: ERROR: No icons path set
hu_hu: HIBA: Ikon elérési út nincs beállítva
ko: 오류: 아이콘 경로가 설정 안 됨
sv_se: FEL: Ingen ikonsökväg inställd

source: No new %S available
hu_hu: Nem érhető el új %S
ko: 새 %S을(를) 사용할 수 없음
sv_se: Inga nya %S tillgängliga

source: You are about to remove %s %S of data, deleting all previously downloaded %S. Do you want to proceed?
hu_hu: %s %S adat eltávolítására készül, ezzel törli az összes korábban letöltött %S-t. Biztosan folytatja?
ko: %s %S의 데이터를 제거하고, 이전에 다운로드한 %S을(를) 모두 삭제합니다. 계속하겠습니까?
sv_se: Du är på väg att ta bort %s %S med data, tar bort alla tidigare hämtade %S. Vill du fortsätta?

source: Proceed
hu_hu: Folytat
ko: 진행
sv_se: Fortsätt

source: icon packs
hu_hu: ikon csomagok
ko: 아이콘 팩
sv_se: ikonpaket

source: shader packs
hu_hu: shader csomagok
ko: 셰이더 팩
sv_se: shader-paket

source: Pick the game:
hu_hu: Válassza ki a játékot:
ko: 게임을 선택하세요:
sv_se: Välj spel:

source: Game
hu_hu: Játék
ko: 게임
sv_se: Spel

source: Graphics
hu_hu: Grafika
ko: 그래픽
sv_se: Grafik

source: Override global graphic settings
hu_hu: Átfogó grafikai beállítások felülírása
ko: 글로벌 그래픽 설정 재정의
sv_se: Åsidosätt globala grafikinställningar

# lowres
source: Override global graphic settings
hu_hu: Átfogó grafikai beállítások felülírása
ko: 글로벌 그래픽 설정 재정의
sv_se: Åsidosätt globala grafikinställningar

source: Keymaps
hu_hu: Billentyű kiosztás
ko: 키설정
sv_se: Tangenter

source: Override global backend settings
hu_hu: Átfogó backend beállítások felülírása
ko: 글로벌 백엔드 설정 재정의
sv_se: Åsidosätt globala backend-inställningar

# lowres
source: Override global backend settings
hu_hu: Átfogó backend beállítások felülírása
ko: 글로벌 백엔드 설정 재정의
sv_se: Åsidosätt globala backend-inställningar

source: Audio
hu_hu: Hang
ko: 오디오
sv_se: Ljud

source: Override global audio settings
hu_hu: Átfogó hang beállítások felülírása
ko: 글로벌 오디오 설정 재정의
sv_se: Åsidosätt globala ljudinställningar

# lowres
source: Override global audio settings
hu_hu: Átfogó hang beállítások felülírása
ko: 글로벌 오디오 설정 재정의
sv_se: Åsidosätt globala ljudinställningar

source: Volume
hu_hu: Hangerő
ko: 볼륨
sv_se: Volym

# lowres
source: Volume
hu_hu: Hangerő
ko: 볼륨
sv_se: Volym

source: Override global volume settings
hu_hu: Átfogó hangerő beállítások felülírása
ko: 글로벌 볼륨 설정 재정의
sv_se: Åsidosätt globala volyminställningar

# lowres
source: Override global volume settings
hu_hu: Átfogó hangerő beállítások felülírása
ko: 글로벌 볼륨 설정 재정의
sv_se: Åsidosätt globala volyminställningar

source: Override global MIDI settings
hu_hu: Átfogó MIDI beállítások felülírása
ko: 글로벌 미디 설정 재정의
sv_se: Åsidosätt globala MIDI-inställningar

# lowres
source: Override global MIDI settings
hu_hu: Átfogó MIDI beállítások felülírása
ko: 글로벌 미디 설정 재정의
sv_se: Åsidosätt globala MIDI-inställningar

source: Override global MT-32 settings
hu_hu: Átfogó MT-32 beállítások felülírása
ko: 글로벌 MT-32 설정 재정의
sv_se: Åsidosätt globala MT-32-inställningar

# lowres
source: Override global MT-32 settings
hu_hu: Átfogó MT-32 beállítások felülírása
ko: 글로벌 MT-32 설정 재정의
sv_se: Åsidosätt globala MT-32-inställningar

source: Paths
hu_hu: Elérési utak
ko: 경로
sv_se: Sökvägar

# lowres
source: Paths
hu_hu: Elérési utak
ko: 경로
sv_se: Sökvägar

source: Check Integrity
hu_hu: Integritás ellenőrzés
ko: 무결성 확인
sv_se: Kontrollera integritet

source: Perform integrity check for all game files
hu_hu: Integritás ellenőrzés elvégzése minden játék fájlon
ko: 모든 게임 파일에 대한 무결성 검사를 수행
sv_se: Utför integritetskontroll för alla spelfiler

source: Game Path:
hu_hu: Játék Elérési út:
ko: 게임 경로:
sv_se: Spelsökväg:

# lowres
source: Game Path:
hu_hu: Játék Elérési út:
ko: 게임 경로:
sv_se: Spelsökväg:

source: Extra Path:
hu_hu: Extra Elérési út:
ko: 추가 경로:
sv_se: Extrasökväg:

source: Specifies path to additional data used by the game
hu_hu: Elérési útvonal meghatározása a játékok kiegészítő fájljaihoz
ko: 게임에서 사용하는 추가 데이터 경로를 지정
sv_se: Anger sökvägen till ytterligare data som spelet använder

# lowres
source: Extra Path:
hu_hu: Extra Elérési út:
ko: 추가 경로:
sv_se: Extrasökväg:

# path
source: None
hu_hu: Nincs
ko: 없음
sv_se: Ingen

source: Save Path:
hu_hu: Mentés Elérési út:
ko: 저장 경로:
sv_se: Sparningssökväg:

source: Specifies where your saved games are put
hu_hu: Játékmentések elérési útvonalának meghatározása
ko: 저장된 게임이 저장되는 위치를 지정
sv_se: Anger var dina sparade spel lagras

# lowres
source: Save Path:
hu_hu: Mentés Elérési út:
ko: 저장 경로:
sv_se: Sparningssökväg:

source: Default
hu_hu: Alapértelmezett
ko: 기본값
sv_se: Standard

source: Achievements
hu_hu: Teljesítmények
ko: 도전과제
sv_se: Prestationer

source: Statistics
hu_hu: Statisztikák
ko: 통계
sv_se: Statistik

source: Short game identifier used for referring to saved games and running the game from the command line
hu_hu: Rövid játékazonosító a játékmentésekhez és a játék parancssori futtatásához
ko: 저장된 게임을 참조하고 명령줄에서 게임을 실행하는 데 사용되는 짧은 게임 식별자
sv_se: Kortnamn för spel. Används för att hänvisa till spardata och att starta spelet från kommandoraden

source: Name:
hu_hu: Név:
ko: 이름:
sv_se: Namn:

source: Full title of the game
hu_hu: A játék teljes neve
ko: 게임의 전체 제목
sv_se: Spelets fullständiga titel

# lowres
source: Name:
hu_hu: Név:
ko: 이름:
sv_se: Namn:

source: Language:
hu_hu: Nyelv:
ko: 언어:
sv_se: Språk:

source: Language of the game. This will not turn your Spanish game version into English
hu_hu: A játék nyelve. Ez nem fogja átváltani a spanyol játékodat angolra
ko: 게임 언어입니다. 이렇게 하면 스페인어 게임 버전이 영어로 바뀌지 않음
sv_se: Spelets språk. Den här inställningen gör inte din spanska spelversion till en svensk

source: <default>
hu_hu: <alapértelmezett>
ko: <기본값>
sv_se: <standard>

source: Platform:
ko: 플랫폼:
sv_se: Plattform:

source: Platform the game was originally designed for
hu_hu: Platform amire a játékot eredetileg készítették
ko: 게임이 원래 동작하도록 디자인된 플랫폼
sv_se: Plattformen som spelet ursprungligen utvecklades för

# lowres
source: Platform:
ko: 플랫폼:
sv_se: Plattform:

source: Select SoundFont
hu_hu: SoundFont kiválasztása
ko: 사운드폰트 선택
sv_se: Välj SoundFont

source: Select additional game directory
hu_hu: Válassza ki a játék kiegészítő mappát
ko: 추가 게임 디렉터리를 선택
sv_se: Välj ytterligare spelkatalog

source: Select directory for saved games
hu_hu: Válassza ki a játék mentés mappát
ko: 저장된 게임을 위한 디렉터리를 선택
sv_se: Välj katalog för sparade spel

source: The chosen directory cannot be written to. Please select another one.
hu_hu: A kiválasztott mappa írásvédett. Kérem válasszon egy másikat.
ko: 선택한 디렉터리에 기록할 수 없습니다. 다른 디렉터리를 선택하세요.
sv_se: Det går inte att skriva till den valda katalogen. Välj en annan.

source: Saved games sync feature doesn't work with non-default directories. If you want your saved games to sync, use default directory.
hu_hu: A mentés szinkronizálás nem működik nem alapértelmezett mappa struktúrával. Ha szinkronizálni akarja mentéseit, használja az alapértelmezettet.
ko: 저장된 게임 동기화 기능은 기본이 아닌 디렉터리에서는 작동하지 않습니다. 저장된 게임을 동기화하려면 기본 디렉터리를 사용하세요.
sv_se: Synkfunktionen för sparade data fungerar endast med standardkataloger. Om du vill synka dina sparade data måste du använda standardkatalogen.

source: This game ID is already taken. Please choose another one.
hu_hu: Ez a játékazonosító már foglalt. Kérem válasszon egy másikat.
ko: 이 게임 ID는 이미 사용 중입니다. 다른 ID를 선택하세요.
sv_se: Detta spel-id är upptaget. Välj ett annat.

source: Author:
hu_hu: Szerző:
ko: 원작자:
sv_se: Upphovsperson:

source: Notes:
hu_hu: Megjegyzések:
ko: 참고:
sv_se: Anteckningar:

source: Verifying file integrity may take a long time to complete. Please wait...
hu_hu: Az integritás ellenőrzés sok ideig is eltarthat. Kérem várjon türelemmel...
ko: 파일 무결성을 확인하는 데 시간이 오래 걸릴 수 있습니다. 기다려 주세요...
sv_se: Verifikation av filintegritet kan ta lång tid att genomföra. Vänta...

source: Calculating file checksums...
hu_hu: Ellenőrző összeg fájl kalkulálása...
ko: 파일 체크섬 계산 중...
sv_se: Beräknar kontrollsummor för filer...

source: Launch Email Client
hu_hu: Email Kliens Indítása
ko: 이메일 클라이언트 실행
sv_se: Starta e-postklient

source: This game includes add-ons, pick the part you want to be checked:
sv_se: Detta spel inkluderar tillägg, välj den del som du vill kontrollera:

source: Calculation complete
hu_hu: Kalkuláció kész
ko: 계산 완료
sv_se: Beräkning färdig

source: Calculated %s %S / %s %S
hu_hu: %s %S / %s %S kalkulálva
ko: %s %S / %s %S 계산됨
sv_se: Beräknade %s %S / %s %S

source: ### Results Your set of game files seems to be unknown to us. If you are sure that this is a valid unknown variant, please send the following e-mail to integrity@scummvm.org
hu_hu: ### Eredmények A játék fájlok ismeretlennek tűnnek. Ha biztos abban, hogy ez egy érvényes ismeretlen variáns, küldjön számunkra egy emailt a integrity@scummvm.org címre
ko: ### 결과 보유한 게임 파일 세트는 우리에게 알려지지 않은 것 같습니다. 이것이 유효한 알려지지 않은 변형이라고 확신하는 경우 다음 이메일을 integrity@scummvm.org로 보내주세요
sv_se: ### Resultat Din uppsättning av spelfiler förefaller vara okänd för oss. Om du är säker på att du har en giltig okänd variant, skicka följande e-postmeddelande till integrity@scummvm.org

source: The game doesn't seem to have any files. Are you sure the path is correct?
hu_hu: Úgy tűnik a játéknak nincsenek fájljai. Biztos benne, hogy az elérési út helyes?
ko: 게임에 파일이 없는 것 같습니다. 경로가 올바른지 확인하였습니까?
sv_se: Spelet verkar inte ha några filer. Är du säker på att sökvägen är korrekt?

source: The game doesn't seem to have any metadata associated with it, so it is unable to be matched. Please fill in the correct metadata for the game.
hu_hu: Úgy tűnik a játékhoz nem tartoznak metaadatok, így nem felismerhető. Kérjük töltse ki a megfelelő metaadatokat a játékhoz.
ko: 이 게임에는 연관된 메타데이터가 없는 듯하므로, 매치할 수 없습니다. 게임에 대한 올바른 메타데이터를 입력해 주세요.
sv_se: Spelet verkar inte ha någon metadata associerad med det, så det kan inte matchas. Fyll i den korrekta metadatan för spelet.

source: Files all OK
hu_hu: Minden fájl OK
ko: 모든 파일 정상
sv_se: Filerna är alla OK

source: Choose file for loading
hu_hu: Válassza ki a betöltendő fájlt
ko: 로딩할 파일을 선택
sv_se: Välj en fil att läsa in

source: Enter filename for saving
hu_hu: Írja be a fájlnevet a mentéshez
ko: 저장할 파일명을 입력
sv_se: Ange ett filnamn för att spara

source: Do you really want to overwrite the file?
hu_hu: Biztosan felül akarja írni a fájlt?
ko: 정말 파일을 덮어쓰겠습니까?
sv_se: Vill du verkligen skriva över filen?

source: Active
hu_hu: Aktív
ko: 활성화
sv_se: Aktiv

source: Room:
hu_hu: Szoba:
ko: 룸:
sv_se: Rum:

source: Damp:
hu_hu: Csillapítás:
ko: 감쇠:
sv_se: Dämpning:

source: Width:
hu_hu: Szélesség:
ko: 너비:
sv_se: Bredd:

source: Level:
hu_hu: Szint:
ko: 수준:
sv_se: Nivå:

source: Speed:
hu_hu: Sebesség:
ko: 속도:
sv_se: Hastighet:

source: Depth:
hu_hu: Mélység:
ko: 깊이:
sv_se: Djup:

source: Type:
hu_hu: Típus:
ko: 유형:
sv_se: Typ:

source: Sine
hu_hu: Szinusz
ko: 사인
sv_se: Sinus

source: Triangle
hu_hu: Háromszög
ko: 삼각형
sv_se: Triangel

source: Misc
hu_hu: Egyéb
ko: 기타
sv_se: Diverse

source: Interpolation:
hu_hu: Interpoláció:
ko: 보간:
sv_se: Interpolering:

source: None (fastest)
hu_hu: Nincs (leggyorsabb)
ko: 없음 (가장 빠름)
sv_se: Ingen (snabbast)

source: Linear
hu_hu: Lineáris
ko: 선형
sv_se: Linjär

source: Fourth-order
hu_hu: Negyedrangú
ko: 4 차
sv_se: Fjärde ordningen

source: Seventh-order
hu_hu: Hetedrangú
ko: 7 차
sv_se: Sjunde ordningen

source: Reset
hu_hu: Alaphelyzetbe állít
ko: 재설정
sv_se: Nollställ

source: Reset all FluidSynth settings to their default values.
hu_hu: Minden FluidSynth visszaállítása alapértelmezett értékre.
ko: 모든 FluidSynth 설정을 기본값으로 재설정합니다.
sv_se: Återställ alla FluidSynth-inställningar till deras ursprungliga värden.

source: Do you really want to reset all FluidSynth settings to their default values?
hu_hu: Biztosan visszaállítja az összes FluidSynth beállítást az alapértelmezett értékére?
ko: 모든 FluidSynth 설정을 기본값으로 재설정하겠습니까?
sv_se: Vill du verkligen återställa alla FluidSynth-inställningar till deras ursprungliga värden?

source: GUI
hu_hu: Kezelőfelület
sv_se: Gränssnitt

source: Interact
hu_hu: Interakció
ko: 상호작용
sv_se: Interagera

source: Up
hu_hu: Fel
ko: 위쪽
sv_se: Upp

source: Down
hu_hu: Le
ko: 아래쪽
sv_se: Ner

source: Left
hu_hu: Bal
ko: 왼쪽
sv_se: Vänster

source: Right
hu_hu: Jobb
ko: 오른쪽
sv_se: Höger

source: Backspace
hu_hu: Törlésgomb
ko: Backspace 키
sv_se: Backsteg

source: Delete Character
hu_hu: Karakter Törlése
ko: 문자 삭제
sv_se: Ta bort tecken

source: Go to end of line
hu_hu: Ugrás sor végére
ko: 줄의 끝으로 이동
sv_se: Gå till radslut

source: Select to end of line
hu_hu: Válassza ki a sor végéig
ko: 줄의 끝까지 선택
sv_se: Markera till radslut
