Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: Change voices
hu_hu: Beszédhang változtatása
ko: 음성 변경
sv_se: Byt röster

source: Continue game
hu_hu: Játék folytatás
ko: 게임 계속하기
sv_se: Fortsätt spelet

source: Cancel quit
hu_hu: Kilépés megszakítása
ko: 종료 취소
sv_se: Avsluta inte

source: Okay
hu_hu: Oké
ko: 확인
sv_se: Okej

source: Cancel load
hu_hu: Betöltés megszakítása
ko: 불러오기 취소
sv_se: Avbryt inläsning

source: Cancel save
hu_hu: Mentés megszakítása
ko: 자동 취소
sv_se: Avbryt sparning

source: Could not find AdLib instrument definition files %s and %s. Without these files, the music will not sound the same as the original game.
hu_hu: Nem található a %s és %s AdLib hangszerdefiníciós fájl. Ezen fájlok nélkül, a zene nem olyan hangzású, mint az eredeti játékban.
ko: 애드립 악기 정의 파일 %s 및 %s를 찾을 수 없습니다. 이 파일이 없으면, 음악이 원래 게임과 같은 사운드가 나오지 않습니다.
sv_se: Kunde inte hitta AdLib-definitionsfiler för instrument %s och %s. Utan dessa filer, låter musiken inte på samma sätt som i originalspelet.

source: Error loading game resources.
hu_hu: Hiba a játék források betöltésekor.
ko: 게임 리소스를 불러오는 중에 오류가 발생했습니다.
sv_se: Fel vid inläsning av spelresurser.

source: Skip EGA dithering pass (full color backgrounds)
hu_hu: EGA dithering művelet átugrása (teljes színmélységű hátterek)
ko: EGA 디더링 패스 건너뛰기 (풀컬러 배경화면)
sv_se: Hoppa över EGA dithering-pass (bakgrunder i full färg)

source: Skip dithering pass in EGA games, graphics are shown with full colors
hu_hu: Dithering művelet átugrása EGA játékok esetében, grafika teljes színmélységben jelenik meg
ko: EGA 게임에서 디더링 패스를 건너뛰고, 그래픽은 풀컬러로 표시
sv_se: Hoppa över dithering-pass i EGA-spel. Grafik visas i full färg

source: Enable high resolution graphics
hu_hu: Nagy felbontású grafika engedélyezése
ko: 고해상도 그래픽 사용
sv_se: Aktivera högupplöst grafik

source: Enable high resolution graphics/content
hu_hu: Nagy felbontású grafika/tartalom engedélyezése
ko: 고해상도 그래픽/컨텐츠를 활성화
sv_se: Aktivera högupplöst grafik/innehåll

source: Enable black-lined video
hu_hu: Feketevonalas videó engedélyezése
ko: 비디오에 검은 선 활성화
sv_se: Aktivera svarta videoränder

source: Draw black lines over videos to increase their apparent sharpness
hu_hu: A videó fölé fekete vonalakat rajzol, ezzel élesebb hatást keltve
ko: 선명도를 높이기 위해 비디오 위에 검은 선을 그림
sv_se: Rita svarta linjer över videor för att få dem att se skarpare ut

source: Use high-quality video scaling
hu_hu: Magas minőségû videó átméretezés használata
ko: 고품질 비디오 크기 조정 사용
sv_se: Använd högkvalitativ bildförstoring

source: Use linear interpolation when upscaling videos, where possible
hu_hu: Ha lehetséges, használja a lineáris interpolációt a videók átméretezésekor
ko: 비디오 크기 조정 시, 가능하면 선형 필터링을 사용
sv_se: Använd linjär interpolering för att förstora bilden, om möjligt

source: Use high-quality "LarryScale" cel scaling
hu_hu: Magas minőségű "LarryScale" pont skálázás használata
ko: 고품질 "래리스케일" 셀 크기 조정 사용
sv_se: Använd högkvalitativ "LarryScale"-bildförstoring

source: Use special cartoon scaler for drawing character sprites
hu_hu: Használjon speciális rajzfilm-skálázást a karakter sprite-ok rajzolásához
ko: 캐릭터 스프라이트를 그리기 위해 때 특별한 카툰 크기 조정 방식을 사용
sv_se: Använd en speciell skalare för att rita figur-sprites

source: Use CD audio
hu_hu: CD hang használata
ko: CD 오디오 사용
sv_se: Använd CD-ljud

source: Use CD audio instead of in-game audio, if available
hu_hu: CD hang használata a játékban lévővel szemben, ha rendelkezésre áll
ko: 사용 가능할 경우, 게임 오디오 대신 CD 오디오를 사용
sv_se: Använd CD-ljud istället för spelets ljud, om tillgängligt

source: Use the Windows cursors (smaller and monochrome) instead of the DOS ones
hu_hu: Windows kurzorok használata (kisebb és monokróm) a DOS-osok helyett
ko: 도스 커서 대신에 윈도우즈 커서 (작고 흑백)를 사용
sv_se: Använd Windows-muspekare (mindre och svartvit) istället för DOS-pekaren

source: Use silver cursors
hu_hu: Ezüst kurzor használata
ko: 은색 커서 사용
sv_se: Använd silverpekare

source: Use the alternate set of silver cursors instead of the normal golden ones
hu_hu: Használjon alternatív ezüst kurzorokat, a normál arany színűek helyett
ko: 일반적인 금색 커서 대신 대체 은색 커서 세트를 사용
sv_se: Använd muspekare i silver istället för de vanliga guldfärgade

source: Enable content censoring
hu_hu: Tartalom cenzúrázásának engedélyezése
ko: 컨텐츠 검열 활성화
sv_se: Aktivera innehållscensurering

source: Enable the game's built-in optional content censoring
hu_hu: Engedélyezze a játék beépített opcionális tartalom cenzúrázását
ko: 게임 내장 옵션 콘텐츠 검열 활성화
sv_se: Aktivera spelets inbyggda och valfria censurfunktion

source: Upscale videos
hu_hu: Felskálázott videók
ko: 비디오 업스케일
sv_se: Skala upp videor

source: Upscale videos to double their size
hu_hu: Videók méretének megduplázása felskálázással
ko: 실제 사이즈의 두 배 크기로 비디오를 업스케일
sv_se: Skala upp videor till dubbla storleken

source: Use RGB rendering
hu_hu: RGB megjelenítés használata
ko: RGB 렌더링 사용
sv_se: Använd RGB-rendering

source: Use RGB rendering to improve screen transitions
hu_hu: Használjon RGB renderelést a képernyőátmenet javításához
ko: RGB 렌더링을 사용하여 화면 전환을 개선
sv_se: Använd RGB-rendering för att förbättra skärmövergångar

source: Use per-resource modified palettes
hu_hu: Használjon erőforrásonkénti módosított palettákat
ko: 리소스별 수정된 팔레트 사용
sv_se: Använd modifierade paletter per-resurs

source: Use custom per-resource palettes to improve visuals
hu_hu: Használjon egyedi erőforrás palettákat a látvány javításához
ko: 커스텀 리소스별 팔레트를 사용하여 시각적 효과를 개선
sv_se: Använd anpassade paletter per resurs för att förbättra visualisering

source: Enable bearded musicians
hu_hu: Szakállas zenészek engedélyezése
ko: 수염을 기른 음악가를 활성화
sv_se: Aktivera skäggiga musiker

source: Enable graphics that were disabled for legal reasons
hu_hu: Engedélyezze a jogi okok miatt letiltott grafikai tartalmakat
ko: 법적 이유로 비활성화된 그래픽을 활성화
sv_se: Aktivera grafik som inaktiverades av juridiska skäl

source: Enable saving via the GMM
hu_hu: GMM-en keresztüli mentés engedélyezése
ko: GMM을 통한 저장 활성화
sv_se: Aktivera sparande via GMM

source: Allows saving via the GMM. WARNING: saves created via the GMM may be corrupted and unusable. Use at your own risk!
hu_hu: Engedélyezi a GMM-en keresztül való mentést. FIGYELEM: a GMM-el készült mentések eredménye sérült vagy használhatatlan is lehet. Saját felelősségre használja!
ko: GMM을 통해 저장할 수 있습니다. 경고: GMM을 통해 생성된 저장은 손상되어 사용할 수 없을 수 있습니다. 사용 시 모든 위험을 감수하세요!
sv_se: Tillåter sparande via GMM. VARNING: sparade filer som skapats via GMM kan vara skadade och oanvändbara. Använd på egen risk!

source: Repair speech audio
hu_hu: Beszédhangok javítása
ko: 음성 오디오 복구
sv_se: Reparera talat ljud

source: Detect and attempt to repair overflows in DPCM8 audio, which cause noticeable pops and crackles.
hu_hu: A DPCM8 hang túlfolyások felismerése és kipróbálása, amely máskülönben recsegést okozhat.
ko: DPCM8 오디오에서 눈에 띄는 톡톡 튀는 소리를 발생시키는 오버플로우를 감지하고 복구를 시도합니다.
sv_se: Upptäck och försök att reparera överflöden i DPCM8-ljud, som orsakar märkbara ljudproblem.

source: Game does not contain menu resources
hu_hu: A játék nem tartalmaz menü forrásokat
ko: 게임에는 메뉴 리소스가 포함되어 있지 않음
sv_se: Spelet innehåller inga menyresurser

source: This demo uses an unimplemented version of Robot videos
hu_hu: Ez a demó a Robot videók implementálatlan verzióját használja
ko: 이 데모에서는 구현되지 않은 버전의 로봇 비디오를 사용
sv_se: Denna demo använder en oimplementerad version av Robot-videor

source: Incomplete game detected. You have to copy data from all the CDs.
hu_hu: Hiányos játék észlelve. Az összes CD-ről át kell másolnia az adatokat.
ko: 완료되지 않은 게임이 감지되었습니다. 모든 CD에서 데이터를 복사해야 합니다.
sv_se: Ofullständigt spel upptäcktes. Du måste kopiera data från alla cd-skivor.

source: (Autosave)
hu_hu: (Automatamentés)
ko: (자동 저장)
sv_se: (Autosparning)

source: Please use an external viewer to open the game's help file: %s
hu_hu: A játék súgófájljának megnyitásához használjon külső megjelenítőt: %s
ko: 게임의 도움말 파일을 열려면 외부 뷰어를 사용: %s
sv_se: Använd ett externt visningsprogram för att öppna spelets hjälpfil: %s

source: The Poker logic is hardcoded in an external DLL, and is not implemented yet. There exists some dummy logic for now, where opponent actions are chosen randomly
hu_hu: A Póker logikát egy külső DLL kódolja, és még nincs implementálva. Jelenleg van némi színlelt logika, ami az ellenfél műveleteit véletlenszerűen választja ki
ko: 포커 로직은 외부 DLL에 하드코딩되어 있으며 아직 구현되지 않았습니다. 지금은 상대의 행동이 무작위로 선택되는 더미 로직이 존재
sv_se: Pokerlogiken är hårdkodad i en extern DLL och är inte implementerad ännu. Det finns en del dummy-logik för tillfället, där motståndarnas handlingar väljs slumpmässigt

source: The format of this saved game is obsolete, unable to load it
hu_hu: A mentett játék formátuma elavult, nem tölthető be
ko: 이 저장된 게임의 형식은 오래되어서, 불러올 수 없음
sv_se: Formatet på dessa sparade data är föråldrat, det gick inte att läsa in dem

source: Savegame version is %d, maximum supported is %0d
hu_hu: A mentés verziója %d, a maximálisan támogatott %0d
ko: 저장된 게임 버전 : %d, 최대 지원 가능 : %0d
sv_se: Versionen på sparade data är %d, den senaste som stöds är %0d

source: This saved game was created with a different version of the game, unable to load it
hu_hu: Ez a mentett játék a játék másik verziójával készült, ezért nem tölthető be
ko: 이 저장된 게임은 다른 버전의 게임으로 생성되었으므로 불러올 수 없음
sv_se: Dessa sparade data skapades med en annan version av spelet, som inte kunde läsas in

source: Cannot play back %dbpp video on a system with maximum color depth of 8bpp
hu_hu: Nem lehet lejátszani %d bpp videót olyan rendszeren, melynek maximális színmélysége 8 bpp
ko: 최대 색심도가 8 bpp인 시스템에서 %d bpp 비디오를 재생할 수 없음
sv_se: Det går inte att spela upp %dbpp-video på ett system med maximalt färgdjup på 8bpp

source: SCI32 support not compiled in
hu_hu: SCI32 támogatás nincs lefordítva
ko: SCI32 지원이 컴파일 되지 않았음
sv_se: Stöd för SCI32 har inte kompilerats in

source: Missing or corrupt game resources have been detected. Some game features may not work properly. Please check the console for more information, and verify that your game files are valid.
hu_hu: Úgy tűnik egyes játék elemek hiányoznak vagy sérültek. Bizonyos játékfunkciók nem feltétlenül fognak működni. Tekintse meg a konzolt további információért, és ellenőrizze, hogy játékfájljai megfelelőek-e.
ko: 누락되거나 손상된 게임 리소스가 감지되었습니다. 일부 게임 기능이 제대로 작동하지 않을 수 있습니다. 자세한 내용은 콘솔 창을 확인하고 게임 파일이 유효한지 확인하세요.
sv_se: Saknade eller skadade spelresurser har upptäckts. Det är möjligt att vissa spelfunktioner inte kommer att fungera. Se konsolen för ytterligare information och kontrollera att dina spelfiler är giltiga.

source: Subtitles are enabled, but subtitling in King's Quest 7 was unfinished and disabled in the release version of the game. ScummVM allows the subtitles to be re-enabled, but because they were removed from the original game, they do not always render properly or reflect the actual game speech. This is not a ScummVM bug -- it is a problem with the game's assets.
hu_hu: A feliratok engedélyezve vannak, de a King's Quest 7 feliratozása befejezetlen és letiltották a játék véglegesen kiadott verziójában. A ScummVM lehetővé teszi a feliratok újbóli engedélyezését, de mivel eltávolításra kerültek az eredeti játéktól, nem minden esetben látszik megfelelően, vagy tükrözi a tényleges beszédet. Ez nem ScummVM hiba -- a játék belső hibájából eredeztethető.
ko: 자막은 활성화되었지만 킹스 퀘스트 7의 자막은 미완성 상태였고 게임의 정식 버전에서는 비활성화되었습니다. ScummVM은 자막을 다시 활성화할 수 있게 해주지만, 원래 게임에서 제거되었기 때문에 항상 제대로 렌더링되지 않거나 실제 게임 음성을 반영하지 않습니다. 이것은 ScummVM 버그가 아니라 게임 자산의 문제입니다.
sv_se: Undertexter är aktiverade, men undertexter var en inkomplett funktion i King's Quest 7 och var inaktiverade i den lanserade versionen av spelet. ScummVM tillåter återaktivering av undertexterna, men eftersom de togs bort från det ursprungliga spelet kommer de inte alltid att visas ordentligt eller matcha talet. Det här är inte en bugg i ScummVM -- det är ett problem med spelfilerna.

source: You have selected General MIDI as a sound device. Sierra has provided after-market support for General MIDI for this game in their "General MIDI Utility". Please, apply this patch in order to enjoy MIDI music with this game. Once you have obtained it, you can unpack all of the included *.PAT files in your ScummVM extras folder and ScummVM will add the appropriate patch automatically. Alternatively, you can follow the instructions in the READ.ME file included in the patch and rename the associated *.PAT file to 4.PAT and place it in the game folder. Without this patch, General MIDI music for this game will sound badly distorted.
hu_hu: A General MIDI-t válaszotta hangeszközének. A Sierra biztosított egy utólagos támogatást a játék General MIDI-hez a "General MIDI Utility" programjával. Kérjük használja ezt a patch-et, hogy teljes mértékben tudja élvezni a MIDI zenét a játékban. Miután beszerezte, ki tudja csomagolni a már meglevő *.PAT fájlokat a ScummVM extrák mappájába, és a ScummVM automatikusan hozzáadja ezt a játékhoz. Esetlegesen követheti a patch READM.ME fájl utasításait, és átnevezheti a megfelelő PAT fájlt "4.PAT"-ra, majd bemásolja a játék könyvtárba. Enélkül a patch nélkül a General MIDI borzasztóan torzítani fog.
ko: 일반 미디를 사운드 장치로 선택했습니다. 시에라는 "일반 미디 유틸리티"에서 이 게임의 일반 미디에 대한 사후 마켓 지원을 제공했습니다. 이 패치를 적용하여 이 게임에서 미디 음악을 즐기세요. 패치를 받으면 포함된 모든 *.PAT 파일을 ScummVM extras 폴더에 압축 해제하면 ScummVM에서 자동으로 해당 패치를 추가합니다. 또는 패치에 포함된 READ.ME 파일의 지침에 따라 연관된 *.PAT 파일의 이름을 4.PAT로 변경하여 게임 폴더에 넣을 수 있습니다. 이 패치가 없으면 이 게임의 일반 미디 음악이 심하게 왜곡된 사운드가 들립니다.
sv_se: Du har valt General MIDI som ljudenhet. Sierra tillhandahåller stöd för General MIDI för det här spelet via deras "General MIDI Utility". Använd den här patchen för att kunna lyssna på MIDI-musik i det här spelet. När du har verktyget kan du packa upp alla inkluderade *.PAT-filer i ScummVM:s "Extras"-mapp, så kommer ScummVM att tillämpa patchen automatiskt. Alternativt kan du följa instruktionerna i READ.ME-filen som följer med patchen och döpa om den tillhörande *.PAT-filen till 4.PAT och placera den i spelets mapp. Utan den här patchen kommer General MIDI-musik att låta väldigt förvrängd i det här spelet.

source: Download patch
hu_hu: Patch letöltése
ko: 패치 다운로드
sv_se: Hämta ner patch

source: (or click 'Download patch' button. But note - it only downloads, you will have to continue from there)
hu_hu: (vagy kattints a 'Patch letöltése' gombra. Vegye azonban figyelembe - ez csak maga a letöltés, innen még folytatnia kell a folyamatot)
ko: (또는 '패치 다운로드' 버튼을 클릭하세요. 하지만 참고 - 다운로드만 가능하며, 거기서 계속 진행해야 함)
sv_se: (eller klicka på knappen ”Hämta ner patch”. Men observera - den hämtar bara ner, du måste fortsätta därifrån)

source: GK2 has fan made subtitles, available thanks to the good people at SierraHelp. Installation: - download http://www.sierrahelp.com/Files/Patches/GabrielKnight/GK2Subtitles.zip
hu_hu: A GK2 rendelkezik egy rajongói felirattal, amely a SierraHelp tagjainak köszönhető. Telepítés: - töltse le a http://www.sierrahelp.com/Files/Patches/GabrielKnight/GK2Subtitles.zip fájlt
ko: GK2에는 SierraHelp의 팬이 제작한 비공식 자막이 존재합니다. 설치: - http://www.sierrahelp.com/Files/Patches/GabrielKnight/GK2Subtitles.zip 을 다운로드
sv_se: GK2 har undertexter gjorda av fans, tillgängliga tack vare de snälla personerna på SierraHelp. Installation: - hämta ner http://www.sierrahelp.com/Files/Patches/GabrielKnight/GK2Subtitles.zip

source: Characters saved inside ScummVM are shown automatically. Character files saved in the original interpreter need to be put inside ScummVM's saved games directory and a prefix needs to be added depending on which game it was saved in: 'qfg1-' for Quest for Glory 1, 'qfg2-' for Quest for Glory 2. Example: 'qfg2-thief.sav'.
hu_hu: A ScummVM-ben mentett karakterek automatikusan megjelenítésre kerülnek. Az eredeti tolmácsban mentett fájlokat azonban be kell rakni a ScummVM mentés könyvtárába, és a nevükbe egy prefixet kell beszúrni attól függően melyik játékban kerültek mentésre: 'qfg1-' Quest for Glory 1 esetén, 'qfg2-' Quest for Glory 2 esetén. Például: 'qfg2-thief.sav'.
ko: ScummVM에 저장된 캐릭터는 자동으로 표시됩니다. 원래 해석기에 저장된 캐릭터 파일은 ScummVM의 저장된 게임 디렉터리에 넣어야 하며 저장된 게임에 따라 접두사를 추가해야 합니다. Quest for Glory 1의 경우 'qfg1-', Quest for Glory 2의 경우 'qfg2-'. 예: 'qfg2-thief.sav'.
sv_se: Rollpersoner som sparats inom ScummVM visas automatiskt. Rollpersonsfiler som sparats i det ursprungliga programmet måste placeras i ScummVM:s katalog för sparade data och måste förses med ett prefix beroende på vilket spel det sparades i: 'qfg1-' för Quest for Glory 1, 'qfg2-' för Quest for Glory 2. Exempel: 'qfg2-thief.sav'.

source: The selected audio driver requires the following file(s):
hu_hu: A választott hang driver-hez a következő fájlok szükségesek:
ko: 선택된 오디오 드라이버는 다음 파일을 필요로 합니다:
sv_se: Den valda ljuddrivrutinen kräver följande fil(er):

source: Some audio drivers (at least for some games) were made available by Sierra as aftermarket patches and thus might not have been installed as part of the original game setup. Please copy these file(s) into your game data directory. However, please note that the file(s) might not be available separately but only as content of (patched) resource bundles. In that case you may need to apply the original Sierra patch.
hu_hu: Egyes hang drivereket (legalábbis néhány játéknál) a Sierra mint utángyártott javításként jelentette meg. Emiatt nem feltétlenül kerültek telepítésre a játékkal együtt. Kérjük másolja ezeket a fájlokat a játék adat könyvtárába. Azonban lehetséges, hogy a fájlok nem elérhetőek külön, hanem egy összecsomagolt már javított fájl pack-ként. Ebben az esetben az eredeti Sierra javítást kell telepítenie.
ko: 일부 오디오 드라이버(적어도 일부 게임의 경우)는 시에라에서 사후 시장 패치로 제공되었으므로 원래 게임 설정의 일부로 설치되지 않았을 수 있습니다. 이 파일을 게임 데이터 디렉터리에 복사하세요. 하지만 해당 파일은 개별적으로 사용할 수 없고 (패치된) 리소스 번들의 콘텐츠로만 사용할 수 있습니다. 그런 경우 원래 시에라 패치를 적용해야 할 수도 있습니다.
sv_se: Vissa ljuddrivrutiner (åtminstone för vissa spel) gjordes tillgängliga av Sierra som eftermarknadspatchar och kan därför inte ha installerats som en del av den ursprungliga spelinställningen. Kopiera dessa fil(er) till din speldatakatalog. Observera dock att filen/filerna kanske inte är tillgänglig(a) separat utan endast som innehåll i (patchade) resurspaket. I så fall kan du behöva använda den ursprungliga Sierra-patchen.

source: This version of Monkey Island can't be played, because Limited Run Games provided corrupted DISK03.LEC, DISK04.LEC and 903.LFL files. Please contact their technical support for replacement files, or look online for some guides which can help you recover valid files from the KryoFlux dumps that Limited Run Games also provided.
hu_hu: A Monkey Island ezen verziója nem játszható, mert a Limited Run Games sérült DISK03.LEC, DISK04.LEC és 903.LFL fájlokat mellékelt. Kérjük lépjen kapcsolatba az ügyfélszolgálatukkal a fájlok pótlásával kapcsolatban, vagy keressen rá online útmutatókra, melyek segítenek az eredeti Limited Run Games által biztosított KryoFlux fájlok felderítésében.
ko: Limited Run Games에서 손상된 DISK03.LEC, DISK04.LEC, 903.LFL 파일을 제공했기 때문에, 이 버전의 원숭이 섬의 비밀은 플레이할 수 없습니다. 교체 파일에 대해서는 기술 지원팀에 문의하거나, Limited Run Games에서 제공한 KryoFlux 덤프에서 유효한 파일을 복구하는 데 도움이 되는 가이드를 온라인에서 찾아보세요.
sv_se: Den här versionen av Monkey Island kan inte spelas, eftersom Limited Run Games levererade skadade DISK03.LEC-, DISK04.LEC- och 903.LFL-filer. Kontakta deras tekniska support för ersättningsfiler, eller leta online efter några guider som kan hjälpa dig att återställa giltiga filer från KryoFlux-dumparna som Limited Run Games också tillhandahöll.

source: Create a new game session
hu_hu: Új játékmenet készítése
ko: 새 게임 세션을 만들기
sv_se: Skapa en ny spelsession

source: Game Name:
hu_hu: Játék Neve:
ko: 게임 이름:
sv_se: Spelnamn:

source: Your Name:
hu_hu: Az Ön Neve:
ko: 사용자 이름:
sv_se: Ditt namn:

source: Host
hu_hu: Gazda
ko: 호스트
sv_se: Värd

source: Querying games...
hu_hu: Játékok lekérdezése...
ko: 게임 쿼리 중...
sv_se: Söker efter spel...

source: Join
hu_hu: Csatlakozás
ko: 참여
sv_se: Gå med

source: Found %d available games.
hu_hu: %d elérhető játék található.
ko: 사용 가능한 게임 %d 개를 찾았습니다.
sv_se: Hittade %d tillgängliga spel.

source: ~P~revious
hu_hu: Előzők
ko: 이전(~P~)
sv_se: Fö~r~egående

source: ~N~ext
hu_hu: Következők
ko: 다음(~N~)
sv_se: ~N~ästa

source: ~C~lose
hu_hu: Bezár
ko: 닫기(~C~)
sv_se: ~S~täng

source: Speech Only
hu_hu: Csak beszéd
ko: 음성만
sv_se: Endast tal

source: Speech and Subtitles
hu_hu: Beszéd és feliratok
ko: 음성과 자막
sv_se: Tal och undertexter

source: Subtitles Only
hu_hu: Csak felirat
ko: 자막만
sv_se: Endast undertexter

# lowres
source: Speech & Subs
hu_hu: Beszéd & Feliratok
ko: 음성과 자막
sv_se: Tal & text

source: Select a Proficiency Level.
hu_hu: Válasszon nehézségi szintet.
ko: 숙련도를 선택하세요.
sv_se: Välj en skicklighetsnivå.

source: Refer to your Loom(TM) manual for help.
hu_hu: Tekintse meg Loom kézikönyvét a további segítségért.
ko: 도움이 필요하면 Loom(TM) 매뉴얼을 참조하세요.
sv_se: Hänvisa till din Loom(TM)-manual för hjälp.

source: Practice
hu_hu: Gyakorlás
ko: 연습
sv_se: Övning

source: Enhancements:
hu_hu: Feljavítások:
ko: 강화:
sv_se: Förbättringar:

source: Fix original bugs
hu_hu: Eredeti hibák javítása
ko: 원본 버그 수정
sv_se: Rätta till originalbuggar

source: Fixes bugs which were present in the original release, and noticeable graphical/audio glitches.
hu_hu: A megjelent verzióban is megtalálható, valamint látható grafikai/hang hibák javítása.
ko: 원래 릴리스에 존재했던 버그와 눈에 띄는 그래픽/오디오 문제를 수정했습니다.
sv_se: Åtgärdar buggar som fanns i den ursprungliga versionen och märkbara grafiska och ljudmässiga fel.

source: Audio-visual improvements
hu_hu: Hang-vizuális javítások
ko: 시청각적 개선
sv_se: Audiovisuella förbättringar

source: Makes adjustments not related to bugs for certain audio and graphics elements (e.g. version consistency changes).
hu_hu: Finomhangolások, melyek nem hibaként jellemezhető hang és grafikai furcsaságokat javít (pl: konzisztens verzió változások).
ko: 특정 오디오 및 그래픽 요소(예: 버전 일관성 변경)에 대한 버그와 관련 없는 조정을 수행합니다.
sv_se: Gör justeringar som inte är relaterade till buggar för vissa ljud- och grafikelement (t.ex. ändringar av versionskonsistens).

source: Restored content
hu_hu: Visszaállított tartalom
ko: 복원된 콘텐츠
sv_se: Återskapat innehåll

source: Restores dialogs, graphics, and audio elements which were originally cut in the original release.
hu_hu: Dialógusok, grafikák, hang elemek visszaállítása, melyeket kivágtak a végleges verzióból.
ko: 원래 릴리스에서 삭제된 대화, 그래픽, 오디오 요소를 복원합니다.
sv_se: Återställer dialoger, grafik och ljudelement som ursprungligen klipptes bort i originalutgåvan.

source: Modern UI/UX adjustments
hu_hu: Modern UI/UX hangolások
ko: 현대 UI/UX 조정
sv_se: Moderna UI/UX-justeringar

source: Activates some modern comforts; e.g it removes the fake sound loading screen in Sam&Max, and makes early save menus snappier.
hu_hu: Néhány modern komfortos kezelést hozzáad; pl: eltávolítja a hamis betöltő hangot a Sam&Max-ben, valamint a mentés menük reszponzívabbá tétele.
ko: 몇 가지 현대적인 편의 시설이 활성화되었습니다. 예를 들어, 샘&맥스에서 가짜 사운드 로딩 화면을 제거하고 초기 저장 메뉴를 더욱 빠르게 만듭니다.
sv_se: Aktiverar vissa moderna bekvämligheter; t.ex. tar den bort den falska ljudinläsningsskärmen i Sam&Max och gör tidiga sparmenyer snabbare.

source: Enable the original GUI and Menu
hu_hu: Eredeti felület és Menü engedélyezése
ko: 원본 GUI 및 메뉴 활성화
sv_se: Aktivera ursprungligt gränssnitt och meny

source: Allow the game to use the in-engine graphical interface and the original save/load menu. Use it together with the "Ask for confirmation on exit" for a more complete experience.
hu_hu: Engedélyezi a motoron belüli grafikus felület és az eredeti mentés/töltés menü használatát. A teljesebb élmény érdekében használja a „Kérj visszaigazolást kilépéskor” funkcióval együtt.
ko: 게임에서 엔진 내 그래픽 인터페이스와 원래 저장/불러오기 메뉴를 사용하도록 허용합니다. "종료 시 확인 요청"과 함께 사용하면 더욱 완벽한 경험을 할 수 있습니다.
sv_se: Gör att spelet kan använda det grafiska gränssnittet i spelmotorn och den ursprungliga menyn för att spara/läs in. Använd den tillsammans med ”Be om bekräftelse vid avslutning” för en mer komplett upplevelse.
