Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: DEBUG: Access to locations 1-24
sv_se: FELSÖK: Åtkomst till Platserna 1-24

source: Enable Text to Speech for Objects and Options
hu_hu: Szövegfelolvasó engedélyezése az Objektumok és Opciókban
ko: 개체 및 옵션에 대한 TTS 활성화
sv_se: Aktivera text till tal för objekt och alternativ

source: Use TTS to read the descriptions (if TTS is available)
hu_hu: Használja a TTS-t a leírás felolvasásához (ha a TTS elérhető)
ko: TTS를 사용하여 설명 읽기 (TTS가 가능한 경우)
sv_se: Använd TTT för att läsa beskrivningarna (om TTT är tillgängligt)

source: Enable Text to Speech for Subtitles
hu_hu: Szövegfelolvasás engedélyezése a feliratokhoz
ko: 자막에 TTS를 활성화
sv_se: Aktivera text till tal för undertexter

source: Use TTS to read the subtitles (if TTS is available)
hu_hu: Használja a TTS-t a feliratokhoz (ha a TTS elérhető)
ko: TTS를 사용하여 자막 읽기 (TTS가 가능한 경우)
sv_se: Använd TTT för att läsa undertexter (om TTT är tillgängligt)

source: Close the dialog box
sv_se: Stäng dialogrutan

source: Quit dialog keymappings
sv_se: Kortkommandon för avslutningsdialog

source: Use transparent dialog boxes in 16 color scenes
hu_hu: Átlátszó párbeszédpanelek használata 16 színű jeleneteknél
ko: 16 색 화면에서 투명 대화 상자 사용
sv_se: Använd transparenta dialogrutor i 16-färgsscener

source: Use transparent dialog boxes in 16 color scenes even if the original game version did not support them
hu_hu: Átlátszó párbeszédpanelek használata a 16 színű jeleneteknél, még akkor is ha a játék ezt nem támogatta eredetileg
ko: 16색 화면에서도 투명한 대사 창을 활성화합니다. 이 기능은 원작에서는 지원하지 않았습니다
sv_se: Använd transparenta dialogrutor i 16-färgscener även om orginalspelet inte hade stöd för dem

source: Unnamed autosave
hu_hu: Névtelen automata mentés
ko: 제목 없는 저장
sv_se: Namnlös autosparning

source: Unnamed savegame
hu_hu: Névtelen játékmentés
ko: 제목 없음
sv_se: Namnlöst spardata

source: Empty autosave
hu_hu: Üres automata mentés
ko: 비어있는 자동 저장
sv_se: Tom autosparning

source: Key to mouse keymappings
hu_hu: Billentyű egérgombra kiosztása
ko: 마우스 키맵핑 키
sv_se: Kortkommandon för tangent till mus

source: Exit screen keymappings
hu_hu: Kilépő képernyő gombkiosztás
ko: 나가기 화면 키맵핑
sv_se: Kortkommandon för avslutningsskärm

source: Exit Sony intro screen
hu_hu: Sony átvezető átugrása
ko: 소니 인트로 화면 종료
sv_se: Avsluta Sony-introskärm

source: Select option / Click in game
hu_hu: Opció kiválasztása / Klikkelés játékban
ko: 옵션 선택 / 게임 내 클릭
sv_se: Välj alternativ / Klicka i spelet

source: Open action menu / Close menu
hu_hu: Műveleti menü megnyitása / Menü bezárása
ko: 동작 메뉴 열기 / 메뉴 닫기
sv_se: Öppna åtgärdsmeny / Stäng meny

source: Default game speed
hu_hu: Alapértelmezett játék sebesség
ko: 기본 게임 속도
sv_se: Standardhastighet för spelet

source: Slower game speed
hu_hu: Lassabb játék sebesség
ko: 더 느린 게임 속도
sv_se: Långsammare spelhastighet

source: Faster game speed
hu_hu: Gyorsabb játék sebesség
ko: 더 빠른 게임 속도
sv_se: Snabbare spelhastighet

source: Examine
hu_hu: Vizsgál
ko: 조사
sv_se: Undersök

source: Speak
hu_hu: Mond
ko: 말하기
sv_se: Tala

source: Action menu
hu_hu: Műveleti menü
ko: 동작 메뉴
sv_se: Åtgärdsmeny

source: System menu
hu_hu: Rendszer menü
ko: 시스템 메뉴
sv_se: Systemmeny

source: Show collisions
hu_hu: Ütközések mutatása
ko: 충돌 표시
sv_se: Visa kollisioner

source: Menu option up
hu_hu: Menü opció fel
ko: 메뉴 옵션 위로
sv_se: Menyalternativ upp

source: Menu option down
hu_hu: Menü opció le
ko: 메뉴 옵션 아래로
sv_se: Menyalternativ ner

source: WARNING: The savegame you are loading is using a temporary broken format. Things will be broken. Please consider starting Operation Stealth from beginning using new savegames.
hu_hu: FIGYELEM: A betöltött játékállás ideiglenesen sérült formátumot használ, emiatt hibák merülhetnek fel. Ajánlott az Operation Stealth egy új mentésből való visszatöltése.
ko: 경고: 불러오기 중인 저장 게임은 일시적으로 잘못된 포맷을 사용하고 있습니다. 모든 부분이 잘못 동작할 것입니다. 새 저장 게임을 사용하여 처음부터 Operation Stealth를 시작하는 것을 고려해 보세요.
sv_se: VARNING: Sparade spelet som du läser in använder ett tillfälligt trasigt format. Saker och ting kommer att vara trasiga. Överväg att starta Operation Stealth från början med nya sparade spel.

source: Talk / Interact
sv_se: Prata/Interagera

source: Attack
hu_hu: Támadás
ko: 공격
sv_se: Attackera

source: Block
hu_hu: Blokkolás
ko: 차단
sv_se: Blockera

source: Accept
hu_hu: Elfogad
ko: 확인
sv_se: Acceptera

source: Previous
hu_hu: Előző
ko: 이전
sv_se: Föregående

source: Reply 1
hu_hu: 1. Válasz
ko: 리플 1
sv_se: Svar 1

source: Reply 2
hu_hu: 2. Válasz
ko: 리플 2
sv_se: Svar 2

source: Reply 3
hu_hu: 3. Válasz
ko: 리플 3
sv_se: Svar 3

source: Reply 4
hu_hu: 4. Válasz
ko: 리플 4
sv_se: Svar 4

source: Reply 5
hu_hu: 5. Válasz
ko: 리플 5
sv_se: Svar 5

source: Reply 6
hu_hu: 6. Válasz
ko: 리플 6
sv_se: Svar 6

source: Next page
hu_hu: Következő oldal
ko: 다음 페이지
sv_se: Nästa sida

source: Previous page
hu_hu: Előző Oldal
ko: 이전 페이지
sv_se: Förgående sida

source: Map
hu_hu: Térkép
ko: 맵
sv_se: Ställ in

source: Journal
hu_hu: Napló
ko: 일기
sv_se: Dagbok

source: Traits
hu_hu: Jellemzők
ko: 특성
sv_se: Egenskaper

source: Fast mode
hu_hu: Sebes mód
ko: 빠른 모드
sv_se: Snabbläge

source: Player menu
hu_hu: Játékos menü
ko: 플레이어 메뉴
sv_se: Spelarmeny

source: Increase game speed
hu_hu: Játék sebességének növelése
ko: 게임 속도 증가
sv_se: Öka spelhastighet

source: Decrease game speed
hu_hu: Játék sebességének csökkentése
ko: 게임 속도 감소
sv_se: Sänk spelhastighet

source: Versailles 1685 support is not compiled in
hu_hu: Versailles 1685 támogatás nincs lefordítva
ko: Versailles 1685 지원이 컴파일 되지 않음
sv_se: Stöd för Versailles 1685 har inte kompilerats in

source: Unable to locate the darkseed.dat engine data file.
hu_hu: Nem található a darkseed.dat motor fájl.
ko: darkseed.dat 엔진 데이터 파일을 찾을 수 없습니다.
sv_se: Kunde inte hitta spelmotorns datafil darkseed.dat.

source: Use floppy version music
hu_hu: Használja a kislemez zene verzióit
ko: 플로피 버전 음악 사용
sv_se: Använd musik för diskettversionen

source: Use the music from the floppy version. The floppy version's music files must be copied to the SOUND directory.
hu_hu: Használja a kislemezes verzió zenéjét. A kislemezes verzió zenéit be kell másolni a SOUND mappába.
ko: 플로피 버전의 음악을 사용하세요. 플로피 버전의 음악 파일은 SOUND 디렉터리에 복사해야 합니다.
sv_se: Använd musiken från diskettversionen. Diskettversionens musikfiler måste kopieras till katalogen SOUND.

source: SFX mode:
sv_se: SFX-läge:

source: Determines if the game should use CD version SFX only, CD SFX with additional floppy SFX, or floppy SFX only. Floppy SFX are only available if floppy music is used.
sv_se: Bestämmer om spelet ska använda endast CD-versionen av SFX, CD-SFX med ytterligare diskett-SFX eller endast diskett-SFX. Diskett-SFX är endast tillgängligt om diskettmusik används.

source: CD version SFX only
sv_se: Endast CD-versionens SFX

source: CD + extra floppy SFX
sv_se: CD + extra diskett-SFX

source: Floppy version SFX only
sv_se: Endast diskettversionens SFX

source: Action
hu_hu: Művelet
ko: 액션
sv_se: Åtgärd

source: Change command
sv_se: Byt kommando

source: Time advance
sv_se: Avancera tid

source: Toggle Menu
hu_hu: Menü be/ki kapcsolása
ko: 전환 메뉴
sv_se: Växla meny

source: Toggle Clock
hu_hu: Óra ki/be kapcsolása
ko: 시계 전환
sv_se: Växla klocka

source: Next dialog / menu item
hu_hu: Következő panel / menü elem
ko: 다음 대화 상자 / 메뉴 항목
sv_se: Nästa dialog / menypost

source: Previous dialog / menu item
hu_hu: Előző panel / menü elem
ko: 이전 대화 상자 / 메뉴 항목
sv_se: Föregående dialog / menypost

source: Next object
hu_hu: Következő tárgy
ko: 다음 개체
sv_se: Nästa objekt

source: Previous object
hu_hu: Előző tárgy
ko: 이전 개체
sv_se: Föregående objekt

source: Pick up / Operate
hu_hu: Felvesz / Használatba vesz
ko: 집다 / 운용
sv_se: Ta upp / Använd

source: Activate Inventory Object
hu_hu: Felszerelésben található tárgy aktiválása
ko: 인벤토리 객체 활성화
sv_se: Aktivera inventarieobjekt

source: The game prevents quitting at this moment. Are you sure you want to quit anyway?
hu_hu: A játék nem engedi a kilépést ennél a résznél. Biztosan ki akar lépni?
ko: 이대로 진행하면 게임이 종료됩니다. 계속하시겠습니까?
sv_se: Spelet förhindrar att du avslutar just nu. Är du säker på att du vill avsluta ändå?

source: Enable gamma correction
hu_hu: Gamma korrekció bekapcsolása
ko: 감마 교정 활성화
sv_se: Aktivera gammakorrigering

source: Brighten the graphics to simulate a Macintosh monitor
sv_se: Ljusa upp grafiken för att simulera en Macintosh-skärm

source: Force true color
sv_se: Tvinga true color

source: Use true color graphics mode, even if the game is not designed for it
sv_se: Använd true color-grafikläge, även om spelet inte är utformat för det

source: Dialog choice selection keymappings
sv_se: Kortkommandon för dialogval

source: Toggle leader inventory
sv_se: Växla inventarier för ledare

source: Select dialog choice (only works if there is a single choice)
sv_se: Välj dialogval (fungerar endast om det finns ett enda val)

source: Toggle champion 1 inventory
sv_se: Växla inventarier för champion 1

source: Toggle champion 2 inventory
sv_se: Växla inventarier för champion 2

source: Toggle champion 3 inventory
sv_se: Växla inventarier för champion 3

source: Toggle champion 4 inventory
sv_se: Växla inventarier för champion 4

source: Strafe left
sv_se: Gå vänster och sikta

source: Move backward
sv_se: Flytta bakåt

source: Strafe right
sv_se: Gå höger och sikta

source: Wake up champion
sv_se: Väck champion

source: Enable Text to Speech for Missing Voiceovers
sv_se: Aktivera text till tal för saknade berättarröster

source: Use TTS to read the subtitles of missing voiceovers (if TTS is available)
sv_se: Använd TTT för att läsa undertexter för saknade berättarröster (om TTT är tillgängligt)

source: Skip intro / Exit map or inventory
sv_se: Hoppa över intro/avsluta karta eller översikt

source: Open map
hu_hu: Térkép megnyitása
ko: 지도 열기
sv_se: Öppna karta

source: Show walking map
hu_hu: Gyalogos térkép megnyitása
ko: 도보지도 표시
sv_se: Visa gångkarta

source: Toggle walk speed
hu_hu: Váltás sétálásra
ko: 걷기 속도 전환
sv_se: Växla gånghastighet

source: Open main menu
hu_hu: Fő menü megnyitása
ko: 메인 메뉴 열기
sv_se: Öppna huvudmenyn

source: Toggle between mouse pointer and the last game item
hu_hu: A egér mutató és az utolsó játék tárgy közötti váltogatás
ko: 마우스 포인터와 마지막 게임 항목 간 전환
sv_se: Växla mellan muspekare och sista spelposten

source: Previous item in inventory
hu_hu: Előző tárgy a felszerelésben
ko: 인벤토리 이전 항목
sv_se: Föregående objekt i översikt

source: Next item in inventory
hu_hu: Következő tárgy a felszerelésben
ko: 인벤토리 다음 항목
sv_se: Nästa objekt i översikt

source: Error: The file '%s' hasn't been extracted properly. Please refer to the wiki page %s for details on how to properly extract the DTSPEECH.XA and *.STR files from your game disc.
hu_hu: Hiba: A '%s' fájl kitömörítése sikertelen. Kérem olvassa el a wiki oldalt %s azzal kapcsolatban, hogy hogyan tudja megfelelően kicsomagolni a DTSPEECH.XA és *.STR fájlokat a lemezről.
ko: 오류: 파일 '%s' 파일이 제대로 추출되지 않았습니다. 게임 디스크에서 DTSPEECH.XA 및 *.STR 파일을 올바르게 추출하는 방법에 대한 자세한 내용은 위키 페이지 %s을(를) 참조하세요.
sv_se: Felmeddelande: Filen '%s' har inte packats upp på rätt sätt. Referera till wiki-sidan %s för information om hur du korrekt packar upp filerna DTSPEECH.XA och *.STR från din spelskiva.

source: Error: It appears that the game data files were extracted incorrectly. You should only extract STR and XA files using the special method. The rest should be copied normally from your game CD. See %s
hu_hu: Hiba: Úgy tűnik, a játék adat fájlok kitömörítése sikertelen volt. Csak az STR és XA fájlokat szabad kicsomagolnia a speciális módszerrel. A többit a játék CD-jéről kell átmásolni. További információ %s
ko: 오류: 게임 데이터 파일이 잘못 추출된 것 같습니다. STR 및 XA 파일만 특수 방법을 사용하여 추출해야 합니다. 나머지는 게임 CD에서 정상적으로 복사해야 합니다. %s 참조
sv_se: Fel: Det verkar som om speldatafilerna extraherades på ett felaktigt sätt. Du bör endast extrahera STR- och XA-filer med hjälp av specialmetoden. Resten ska kopieras normalt från din spel-cd. Se %s

source: Debug graphics
sv_se: Felsök grafik

source: Animation keymappings
sv_se: Kortkommandon för animering

source: Move / Interact / Select
sv_se: Flytta / Interagera / Välj

source: Pick
sv_se: Plocka

source: Reset selected verb
sv_se: Nollställ valt verb

source: Volume controls
sv_se: Volymkontroller

source: Save / load game
sv_se: Spara / läs in spel

source: Enable subtitles
sv_se: Aktivera undertexter

source: Disable subtitles
sv_se: Inaktivera undertexter

source: Pause speech
sv_se: Pausa tal

source: Confirm quit
sv_se: Bekräfta avslut

source: ScummVM found that you have old saved games for Drascula that should be converted. The old saved game format is no longer supported, so you will not be able to load your games if you don't convert them. Press OK to convert them now, otherwise you will be asked again the next time you start the game.
hu_hu: A ScummVM szerint a mentései régi típusúak, amelyeket át kell konvertálni. A régi mentés formátum immáron nem támogatott, így nem fogja tudni betölteni őlet konvertálás nélkül. Az OK megnyomásával átkonvertálhatja őket, ellenkező esetben a ScummVM újra meg fogja kérdezni a játék következő indításánál.
ko: ScummVM에서 드라큘라에 대한 오래된 저장된 게임이 변환되어야 한다는 것을 발견했습니다. 오래된 저장된 게임 형식은 더 이상 지원되지 않으므로 변환하지 않으면 게임을 불러올 수 없습니다. 확인을 눌러 지금 변환하세요. 그렇지 않으면 다음에 게임을 시작할 때 다시 묻습니다.
sv_se: ScummVM upptäckte att du har gamla spardata för Drascula som borde konverteras. Det gamla spardataformatet stöds inte längre, så du kommer inte kunna läsa in dina spel om du inte konverterar dem. Tryck på OK för att konvertera dem nu, annars kommer du tillfrågas igen nästa gång du startar spelet.

source: Use bright palette mode
hu_hu: Fényes paletta mód használata
ko: 밝은 팔레트 모드 사용
sv_se: Använd ljust palettläge

source: Display graphics using the game's bright palette
hu_hu: Grafika megjelenítése a játék világos palettájának segítségével
ko: 게임 그래픽을 밝은 팔레트로 표시
sv_se: Visa grafik med spelets ljusa palett

source: Enable Text to Speech for Objects, Options, and the Bible Quote
hu_hu: Szövegfelolvasó engedélyezése az objektumok, Opciók és a Biblia idézet esetén
ko: 개체, 옵션, 성경 인용문에 대해 TTS를 활성화
sv_se: Aktivera text till tal för objekt, alternativ och bibelcitat

source: Select option 1
sv_se: Välj alternativ 1

source: Select option 2
sv_se: Välj alternativ 2

source: Select option 3
sv_se: Välj alternativ 3

source: Select option 4
sv_se: Välj alternativ 4

source: Select option 5
sv_se: Välj alternativ 5

source: Select option 6
sv_se: Välj alternativ 6

source: Select option 7
sv_se: Välj alternativ 7

source: Select option 8
sv_se: Välj alternativ 8

source: Select option 9
sv_se: Välj alternativ 9

source: Select option 10
sv_se: Välj alternativ 10

source: Select option 11
sv_se: Välj alternativ 11

source: Select option 12
sv_se: Välj alternativ 12

source: Select option 13
sv_se: Välj alternativ 13

source: Select option 14
sv_se: Välj alternativ 14

source: Menu keymappings
sv_se: Kortkommandon för meny

source: Quit keymappings
sv_se: Avsluta kortkommandon

source: Skip video keymappings
sv_se: Kortkommandon för att hoppa över video

source: Skip song keymappings
sv_se: Kortkommandon för att hoppa över låt

source: Status menu navigation keymappings
sv_se: Kortkommandon för statusmenynavigering

source: Status menu keymappings
sv_se: Kortkommandon för statusmeny

source: Status menu submenu keymappings
sv_se: Kortkommandon för undermeny i statusmeny

source: Interaction keymappings
sv_se: Kortkommandon för interagering

source: Fight keymappings
sv_se: Tangentmappningar för strider

source: Character selection keymappings
sv_se: Tangentmappningar för karaktärsval

source: Enemy selection keymappings
sv_se: Kortkommandon för fiendeval

source: Death menu keymappings
sv_se: Kortkommandon för dödsmeny

source: Character 1 status
sv_se: Status för karaktär 1

source: Character 2 status
sv_se: Status för karaktär 2

source: Character 3 status
sv_se: Status för karaktär 3

source: Skip song
sv_se: Hoppa över låt

source: Skip song and intro
sv_se: Hoppa över låt och intro

source: Active skills
sv_se: Aktiva färdigheter

source: Drop
hu_hu: Ledob
ko: 떨어뜨리기
sv_se: Släpp

source: Equip
sv_se: Utrusta

source: Give
hu_hu: Ad
ko: 주기
sv_se: Ge

source: Passive skills
sv_se: Passiva färdigheter

source: Trade
sv_se: Handla

source: Exit status menu
sv_se: Avsluta statusmenyn

source: Exit submenu
sv_se: Avsluta undermeny

source: Leave
sv_se: Lämna

source: Defend
sv_se: Försvara

source: Run
hu_hu: Futtatás
ko: 달리기
sv_se: Spring

source: View terrain
sv_se: Visa terräng

source: Select character 1
sv_se: Välj karaktär 1

source: Select character 2
sv_se: Välj karaktär 2

source: Select character 3
sv_se: Välj karaktär 3

source: Cancel character selection
sv_se: Avbryt karaktärsval

source: Select enemy 1
sv_se: Välj fiende 1

source: Select enemy 2
sv_se: Välj fiende 2

source: Select enemy 3
sv_se: Välj fiende 3

source: Select enemy 4
sv_se: Välj fiende 4

source: Select enemy 5
sv_se: Välj fiende 5

source: Cancel enemy selection
sv_se: Avbryt fiendeval

source: Restart game
hu_hu: Játék újraindítása
ko: 게임 재시작
sv_se: Starta om spelet

source: Play sound type 13
sv_se: Spela upp ljudtyp 13

source: Play sound type 14
sv_se: Spela upp ljudtyp 14

source: Play sound type 15
sv_se: Spela upp ljudtyp 15

source: Play sound type 5
sv_se: Spela upp ljudtyp 5

source: Play sound type 10
sv_se: Spela upp ljudtyp 10

source: Play sound type 9
sv_se: Spela upp ljudtyp 9

source: Play sound type 16
sv_se: Spela upp ljudtyp 16

source: Prerecorded sounds
hu_hu: Előre felvett hangok
ko: 미리 녹음된 사운드
sv_se: Förinspelade ljud

source: Use high-quality pre-recorded sounds instead of pc speaker emulation
hu_hu: Jó minőségű előre rögzített hangok használata a pc speaker emuláció helyett
ko: PC 스피커 에뮬레이션 대신 고품질 사전 녹음된 사운드를 사용
sv_se: Använd förinspelade ljud av hög kvalitet i stället för emulering av datorhögtalare

source: Extended timer
hu_hu: Kiterjesztett időzítő
ko: 확장 타이머
sv_se: Utökad timer

source: Start the game timer at 99:59:59
hu_hu: Játékidőzítő indítás 99:59:59-nél
ko: 게임 타이머를 99:59:59에 시작
sv_se: Starta speltimern på 99:59:59

source: Automatic drilling
hu_hu: Automatikus fúrás
ko: 자동 드릴링
sv_se: Automatisk borrning

source: Allow to successfully drill in any part of the area in Driller
hu_hu: Sikeres fúrás engedélyezése bármely területen a Driller-ben
ko: 드릴러에서 영역의 어느 부분에서든 성공적으로 드릴링할 수 있음
sv_se: Gör det möjligt att framgångsrikt borra i alla delar av området i Driller

source: Disable demo mode
hu_hu: Demó mód tiltása
ko: 데모 모드 비활성화
sv_se: Inaktivera demoläge

source: Never activate demo mode
hu_hu: Soha ne aktiválja a demó módot
ko: 데모 모드를 절대 활성화하지 않음
sv_se: Aktivera aldrig demoläge

source: Disable sensors
hu_hu: Érzékelők letiltása
ko: 센서 비활성화
sv_se: Inaktivera sensorer

source: Sensors will not shoot the player
hu_hu: Az érzékelők nem lövik le a játékost
ko: 센서는 플레이어를 쏘지 않음
sv_se: Sensorer kommer inte att skjuta spelaren

source: Disable falling
hu_hu: Leesés tiltása
ko: 낙하 비활성화
sv_se: Inaktivera fall

source: Player cannot fall over edges
hu_hu: A játékos nem eshet át a széleken
ko: 플레이어는 가장자리에서 떨어질 수 없음
sv_se: Spelaren kan inte falla ned för kanter

source: Invert Y-axis on mouse
hu_hu: Egér Y tengely invertálása
ko: 마우스에서 Y축 반전
sv_se: Invertera musens Y-axel

source: Use alternative camera controls
hu_hu: Alternatív kamera irányítás használata
ko: 대체 카메라 조작 사용
sv_se: Använd alternativa kamerakontroller

source: Authentic graphics
hu_hu: Autentikus grafika
ko: 모사 그래픽
sv_se: Autentisk grafik

source: Keep graphics as close as possible to the original
hu_hu: A grafika az eredetihez lehető legjobban közelítsen
ko: 그래픽을 최대한 원본에 가깝게 유지
sv_se: Behåll grafiken så snarlik originalet som möjligt

source: Enable rock travel
hu_hu: Kő utazás engedélyezése
ko: 암석 여행을 활성화
sv_se: Aktivera stenresa

source: Enable traveling using a rock shoot at start
hu_hu: A kezdésnél lehessen kő kilövéssel utazni
ko: 시작 시 암석 사격을 사용하여 여행 가능
sv_se: Aktivera resa med ett stenskott vid start

source: Smoother movement
sv_se: Mjukare rörelse

source: Use smoother movements instead of discrete steps
sv_se: Använd mjuka rörelser i stället för diskreta steg

source: Shoot
hu_hu: Lövés
ko: 사격
sv_se: Skjut

source: Rotate up
hu_hu: Forgatás felfelé
ko: 위로 회전
sv_se: Rotera upp

source: Rotate down
hu_hu: Forgatás lefelé
ko: 아래로 회전
sv_se: Rotera ner

source: Turn back
hu_hu: Visszafordulás
ko: 되돌아오기
sv_se: Vänd tillbaka

source: Change mode
hu_hu: Módváltás
ko: 모드 변경
sv_se: Ändra läge

source: Info menu
sv_se: Info-meny

source: Select Prince
hu_hu: Királyfi kiválasztása
ko: 왕자 선택
sv_se: Välj prins

source: Select Princess
hu_hu: Királykisasszony kiválasztása
ko: 공주 선택
sv_se: Välj prinsessa

source: Toggle Sound
hu_hu: Hang ki/be kapcsolása
ko: 사운드 전환
sv_se: Växla ljud

source: Rotate Left
hu_hu: Forgatás Balra
ko: 왼쪽으로 회전
sv_se: Rotera vänster

source: Rotate Right
hu_hu: Forgatás Jobbra
ko: 오른쪽으로 회전
sv_se: Rotera höger

source: Crawl
hu_hu: Kúszás
ko: 기어가다
sv_se: Kryp

source: Face Forward
hu_hu: Arccal előre
ko: 얼굴 앞으로
sv_se: Vänd framåt

source: Roll left
sv_se: Rulla åt vänster

source: Roll right
sv_se: Rulla åt höger

source: Increase Turn Angle
sv_se: Öka vändvinkeln

source: Decrease Turn Angle
sv_se: Minska vändvinkeln

source: Increase Step Size
hu_hu: Lépés táv növelése
ko: 단계 크기 증가
sv_se: Öka stegstorlek

source: Decrease Step Size
hu_hu: Lépés táv csökkentése
ko: 단계 크기 감소
sv_se: Minska stegstorlek

source: Rise/Fly up
hu_hu: Felemelkedés/Repülés
ko: 상승/급상승
sv_se: Stig/flyg upp

source: Lower/Fly down
hu_hu: Leereszkedés/Repülés
ko: 하강/급강하
sv_se: Sänk/flyg ner

source: Enable/Disable Jetpack
hu_hu: Jetpack ki/be kapcsolás
ko: 제트팩 활성화/비활성화
sv_se: Aktivera/inaktivera jetpack

source: Deploy drilling rig
hu_hu: Olajfúró telepítése
ko: 드릴링 장비 배치
sv_se: Placera ut borrningsrigg

source: Collect drilling rig
hu_hu: Olajfúró begyűjtése
ko: 드릴링 장비를 수집
sv_se: Hämta borrningsrigg

source: Change Angle
hu_hu: Fok változtatása
ko: 각도 변경
sv_se: Ändra vinkel

source: Change Step Size
hu_hu: Lépésméret változtatása
ko: 단계 크기 변경
sv_se: Ändra stegstorlek

source: Toggle Height
hu_hu: Magasság változtatás
ko: 높이 전환
sv_se: Växla höjd

source: Rest
hu_hu: Pihenés
ko: 휴식
sv_se: Vila

source: [ press any key to exit ]
hu_hu: [ nyomd meg bármely gombot a kilépéshez ]
ko: [아무 키나 누르면 종료]
sv_se: [ tryck på valfri tangent för att avsluta ]

source: Untitled Savegame
hu_hu: Névtelen Játékmentés
ko: 제목없는 게임저장
sv_se: Namnlöst spardata

source: Use TTS to read the text
hu_hu: TTS használata a szöveg olvasásához
ko: TTS를 사용해 텍스트를 읽음
sv_se: Använd TTT för att läsa texten

source: Also read input text
hu_hu: Olvassa a bemeneti szöveget is
ko: 입력된 텍스트도 읽기
sv_se: Läs även inmatad text

source: Use TTS to read the input text
hu_hu: TTS használata a bemeneti szöveg olvasáshoz
ko: TTS로 입력된 텍스트를 읽음
sv_se: Använd TTT för att läsa inmatad text

source: Loading game...
hu_hu: Játék betöltés...
ko: 게임 불러오는 중...
sv_se: Läser in spel...

source: Could not start AdvSys game
hu_hu: Nem sikerült elindítani az AdvSys játékot
ko: AdvSys 게임을 시작하지 못함
sv_se: Kunde inte starta AdvSys-spel

source: Sorry, the savegame couldn't be restored
hu_hu: Sajnálom, a mentés nem állítható vissza
ko: 죄송합니다, 저장 게임을 복구할 수 없음
sv_se: Förlåt, det sparade spelet kunde inte återställas

source: Sorry, the savegame couldn't be created
hu_hu: Sajnálom, a mentést nem lehet létrehozni
ko: 죄송합니다, 저장 게임을 생성할 수 없음
sv_se: Förlåt, det sparade spelet kunde inte skapas

source: Speak up! I can't hear you!
hu_hu: Beszélj! Nem hallom!
ko: 더 크게 말하세요! 들리지 않습니다!
sv_se: Tala högre! Jag kan inte höra dig!

source: I don't know the word "%s".
hu_hu: Nem ismerem a "%s" szót.
ko: "%s" 단어를 모릅니다.
sv_se: Jag känner inte till ordet "%s".

source: I don't understand.
hu_hu: Nem értem.
ko: 이해하지 못했습니다.
sv_se: Jag förstår inte.

source: This is too short to be a valid Alan2 file.
hu_hu: Ez túl rövid érvényes Alan2 fájlnak.
ko: 이 파일은 유효한 Alan2 파일이라기에는 너무 짧습니다.
sv_se: Detta är för kort för att vara en giltig Alan2-fil.
