Repository: scummvm/scummvm
Catalog: po/*.po
Languages: hu_hu, ko, sv_se

source: This is not a valid Alan2 file.
hu_hu: Ez nem egy valós Alan2 fájl.
ko: 유효한 Alan2 파일이 아닙니다.
sv_se: Detta är inte en giltig Alan2-fil.

source: Savegame
hu_hu: Játékmentés
ko: 게임저장
sv_se: Sparat spel

source: Picture window toggled
hu_hu: Képablak átváltva
ko: 사진 창 전환됨
sv_se: Bildfönster växlades

source: This is too short to be a valid Glulx file.
hu_hu: Ez túl rövid hogy érvényes Glulx fájl legyen.
ko: 이 파일은 유효한 Glulx 파일이라기에는 너무 짧습니다.
sv_se: Detta är för kort för att vara en giltig Glulx-fil.

source: This is not a valid Glulx file.
hu_hu: Ez nem egy valós Glulx fájl.
ko: 유효한 Glulx 파일이 아닙니다.
sv_se: Detta är inte en giltig Glulx-fil.

source: This Glulx file is too old a version to execute.
hu_hu: Ez a Glulx fájl túl régi verziójú a végrehajtáshoz.
ko: 이 Glulx 파일은 실행하기에 너무 오래된 버전입니다.
sv_se: Versionen på denna Glulx-fil är för gammal för att köra.

source: This Glulx file is too new a version to execute.
hu_hu: Ez a Glulx fájl túl új verziójú a végrehajtáshoz.
ko: 이 Glulx 파일은 실행하기에 너무 새로운 버전입니다.
sv_se: Versionen på denna Glulx-fil är för ny för att köra.

source: Could not start Quest game
hu_hu: Nem sikerült elindítani a Quest játékot
ko: Quest 게임을 시작할 수 없음
sv_se: Kunde inte starta Quest-spel

source: Saved.
hu_hu: Mentett.
ko: 저장됨.
sv_se: Sparat.

source: Error writing save file
hu_hu: Hiba a mentésfájl írásakor
ko: 저장 파일 기록 오류
sv_se: Fel vid skrivning av sparningsfil

source: Incorrect rs file.
hu_hu: Helytelen rs fájl.
ko: 잘못된 rs 파일입니다.
sv_se: Felaktig rs-fil.

source: Save file created by different version.
hu_hu: Más verzióval létrehozott fájl mentés.
ko: 다른 버전으로 만들어진 파일을 저장합니다.
sv_se: Sparad fil skapad av annan version.

source: Failed to load saved game from file.
hu_hu: Nem sikerült a mentett játékállás betöltése fájlból.
ko: 파일에서 저장된 게임을 불러오는데 실패했습니다.
sv_se: Kunde inte läsa spardata från filen.

source: Failed to save game to file.
hu_hu: Nem sikerült a játékállás mentése fájlba.
ko: 게임을 파일에 저장하는데 실패했습니다.
sv_se: Kunde inte spara spelet till fil.

source: Failed to delete file.
hu_hu: Fájl törlés sikertelen.
ko: 파일 삭제에 실패했습니다.
sv_se: Kunde inte ta bort filen.

source: Fire
hu_hu: Tűz
ko: 발사
sv_se: Skjut

source: Magic
hu_hu: Varázslat
ko: 마법
sv_se: Magi

source: Thor dies
sv_se: Thor dör

source: Savegames are not available in demo mode
hu_hu: A mentés nem elérhető demo módban
ko: 데모 모드에서는 저장 게임을 사용할 수 없음
sv_se: Sparade spel är inte tillgängliga i demoläget

source: Menu / Skip
hu_hu: Menü / Ugrás
ko: 메뉴 / 건너뛰기
sv_se: Meny / Hoppa över

source: Speed up cutscene
sv_se: Snabba upp mellansekvens

source: ScummVM found some problems with your game data files. Running ScummVM nevertheless may cause game bugs or even crashes. Do you still want to run %s?
hu_hu: A ScummVM problémákat talált a játékadatfájljaival kapcsolatban. A ScummVM futtatása ezért játékhibákat vagy összeomlásokat okozhat. Szeretné mégis futtatni %s?
ko: ScummVM이 게임 데이터 파일에서 몇 가지 문제를 발견했습니다. 그럼에도 불구하고 ScummVM을 실행하면 게임 버그나 충돌이 발생할 수 있습니다. %s를 계속 실행하겠습니까?
sv_se: ScummVM hittade några problem med dina speldatafiler. Att fortsätta köra ScummVM ändå kan förorsaka krascher eller fel i spelet. Vill du fortfarande köra %s?

source: Use / Talk
sv_se: Använd/prata

source: Pick up / Put away
sv_se: Plocka upp/lägg undan

source: Skip dialog lines
hu_hu: A párbeszédsorok kihagyása
ko: 대화 줄 건너뛰기
sv_se: Hoppa över dialograder

source: Cycle objects up
sv_se: Bläddra genom objekt uppåt

source: Cycle objects down
sv_se: Bläddra genom objekt neråt

source: Quick room exit
sv_se: Snabb rumsutgång

source: Examine / Look
sv_se: Undersök/titta

source: Error: the game could not be saved.
hu_hu: Hiba: a játékot nem sikerült menteni.
ko: 오류: 게임을 저장하지 못함.
sv_se: Fel: spelet kunde inte sparas.

source: Input text
hu_hu: Szöveg bevitel
ko: 텍스트 입력
sv_se: Mata in text

source: The game data file %s may be corrupted. If you are sure it is not please provide the ScummVM team the following code, along with the file name, the language and a description of your game version (i.e. dvd-box or jewelcase): %s
hu_hu: A(z) %s játékadatfájl hibás lehet. Ha biztos vagy benne hogy nem, add meg a ScummVM csapatának a következő kódot, a fájl nevével, a nyelvével és a játék verziójának leírásával együtt (azaz dvd-box vagy ékszerdoboz): %s
ko: 게임 데이터 파일 %s이(가) 손상되었을 수 있습니다. 손상되지 않았다고 확신하는 경우 ScummVM 팀에 다음 코드와 파일 이름, 언어, 게임 버전에 대한 설명(예: DVD 박스 또는 보석 케이스)을 제공해 주세요. %s
sv_se: Speldatafilen %s kan vara skadad. Om du är säker på att den inte är det, tillhandahåll ScummVM-teamet följande kod, tillsammans med filnamnet, språket och en beskrivning av din spelversion (t.ex. dvd-box eller jewelcase): %s

source: Could not open the file %s for checking. It may be missing or you may not have the rights to open it. Go to %s to see a list of the needed files.
hu_hu: Nem sikerült megnyitni a %s fájlt ellenőrzésre. Lehet hogy hiányzik, vagy nincs jogod megnyitni. Menj ide %s hogy megnézd a szükséges fájlokat.
ko: %s 파일을 열 수 없습니다. 파일이 없거나 열 권한이 없을 수 있습니다. %s로 이동하여 필요한 파일 목록을 확인하세요.
sv_se: Kunde inte öppna filen %s för kontroll. Den kan saknas eller så kanske du inte har rättigheter att öppna den. Gå till %s för att se en lista över filerna som behövs.

source: ScummVM will now verify the game data files, to make sure you have the best gaming experience. This may take a while, please wait. Successive runs will not check them again.
hu_hu: A ScummVM most ellenőrzi a játék adatfájljait, hogy megbizonyosodjon a legjobb játékélményről. Ez eltarthat egy ideig, kérlek várj. A következő futtatások nem ellenőrzik őket újra.
ko: ScummVM은 이제 게임 데이터 파일을 확인하여 최상의 게임 경험을 보장합니다. 시간이 좀 걸릴 수 있으니 기다려 주세요. 연속 실행해도 다시 확인하지 않습니다.
sv_se: ScummVM kommer nu att verifiera speldatafilerna för att säkerställa att du får den bästa spelupplevelsen. Detta kan ta ett tag, vänta. Vid framtida körningar behöver kontrollen göras igen.

source: Load user patch (unsupported)
hu_hu: Felhasználói javítás betöltése (nem támogatott)
ko: 사용자 패치 불러오기 (지원되지 않음)
sv_se: Läs in användarpatch (stöds inte)

source: Load an user patch. Please note that the ScummVM team doesn't provide support for using such patches.
hu_hu: Felhasználói javítás betöltése. Felhívjuk figyelmét, hogy a ScummVM csapat nem nyújt támogatást az ilyen javítások használatához.
ko: 사용자 패치를 불러옵니다. ScummVM 팀은 이런 패치를 사용하는데 어떤 지원도 드릴 수 없음을 참고 바랍니다.
sv_se: Läs in en användarpatch. Observera att ScummVM-teamet inte tillhandahåller support för sådana patchar.

source: Escape from Monkey Island PS2 support required MPEG2 support, which is not compiled in
sv_se: Stöd för Escape from Monkey Island PS2 kräver MPEG2-stöd men har inte kompilerats in

source: Escape from Monkey Island support is not compiled in
hu_hu: Escape from Monkey Island támogatás nincs lefordítva
ko: 원숭이섬 탈출 지원이 컴파일 되지 않았음
sv_se: Stöd för Escape from Monkey Island har inte kompilerats in

source: The original patch of Grim Fandango is missing. Please download it from %s and put it in the game data files directory
hu_hu: A Grim Fandango eredeti javítása hiányzik. Kérlek, töltsd le innen %s és tedd a játék adatfájlok könyvtárába
ko: 그림 판당고의 원본 패치가 없습니다. 다음에서 다운로드하고 %s 게임 데이터 파일 디렉터리에 넣기
sv_se: Den ursprungliga patchen för Grim Fandango saknas. Hämta ner den från %s och lägg den i katalogen för speldatafiler

source: The original patch of Escape from Monkey Island is missing. Please download it from %s and put it in the game data files directory. Pay attention to download the correct version according to the game's language!
hu_hu: Az Escape from Monkey Island eredeti javítása hiányzik. Kérlek, töltsd le innen %s és tedd a játék adatfájlok könyvtárába. Ügyelj arra, hogy a játék nyelvének megfelelően töltsd le a megfelelő verziót!
ko: 원숭이 섬의 탈출의 원본 패치가 없습니다. %s에서 다운로드하고 게임 데이터 파일 디렉터리에 넣으세요. 게임 언어에 맞는 올바른 버전을 다운로드하는 데 주의하세요!
sv_se: Den ursprungliga patchen för Escape from Monkey Island saknas. Hämta ner den från %s och lägg den i katalogen för speldatafiler. Var uppmärksam på att hämta ner rätt version enligt spelets språk!

source: ERROR: Not enough music tracks found! Escape from Monkey Island has two versions of FullMonkeyMap.imt, you need to copy both files from both CDs to Textures/, and rename them as follows to get music-support in-game: CD 1: "FullMonkeyMap.imt" -> "FullMonkeyMap1.imt" CD 2: "FullMonkeyMap.imt" -> "FullMonkeyMap2.imt" Alternatively, a Steam or GOG copy has a combined FullMonkeyMap.imt
hu_hu: HIBA: Nincs elég zeneszám! Az Escape from Monkey Island-nak két FullMonkeyMap.imt verziója van, át kell másolnod mindkét fájlt mindkét CD-ről a Textures/ mappába és át kell nevezni az alábbiak szerint, hogy játékon belül zenei támogatást kapj: CD 1: "FullMonkeyMap.imt" -> "FullMonkeyMap1.imt" CD 2: "FullMonkeyMap.imt" -> "FullMonkeyMap2.imt" Alternatív megoldásként a Steam vagy a GOG másolat kombinált FullMonkeyMap.imt fájlját
ko: 오류: 음악 트랙이 충분하지 않습니다! 원숭이 섬의 탈출에는 두 가지 버전의 FullMonkeyMap.imt가 있고, 두 CD에서 두 파일을 모두 Textures/로 복사하고 다음과 같이 이름을 변경하여 게임 내에서 음악 지원을 받아야 합니다: CD 1: "FullMonkeyMap.imt" -> "FullMonkeyMap1.imt" CD 2: "FullMonkeyMap.imt" -> "FullMonkeyMap2.imt" 그렇지 않으면, 스팀 또는 GOG 사본에는 결합된 FullMonkeyMap.imt가 있습니다
sv_se: FEL: Hittade inte tillräckligt med musikspår! Escape from Monkey Island har två versioner av FullMonkeyMap.imt, du måste kopiera båda filerna från båda CD:arna till Textures/, och byta namn på dem som följer för att gå musikstöd i spelet: CD1: "FullMonkeyMap.imt" -> "FullMonkeyMap1.imt" CD2: "FullMonkeyMap.imt" -> "FullMonkeyMap2.imt" Alternativt har en Stream- eller GOG-kopia en kombinerad FullMonkeyMap.imt

source: Fast movie speed
hu_hu: Gyors filmsebesség
ko: 빠른 동영상 속도
sv_se: Snabb filmhastighet

source: Play movies at an increased speed
hu_hu: Filmek lejátszása nagyobb sebességgel
ko: 동영상을 더 빠른 속도로 재생
sv_se: Spela filmer i högre hastighet

source: Easier AI
hu_hu: Egyszerűbb MI
ko: 더 쉬워진 AI
sv_se: Enklare AI

source: Decrease the difficulty of AI puzzles
hu_hu: Csökkenti az MI rejtvények nehézségét
ko: AI 퍼즐의 난이도 낮추기
sv_se: Minska svårigheten för AI-pussel

source: Updated Credits Music
hu_hu: Frissített Stáblista Zene
ko: 업데이트된 크레딧 음악
sv_se: Uppdaterad eftertextmusik

source: Play the song The Final Hour during the credits instead of reusing MIDI songs
hu_hu: A MIDI-dalok újrafelhasználása helyett játssza le a The Final Hour című dalt a stáblista alatt
ko: 미디 노래를 재사용하는 대신 크레딧 중에 The Final Hour 노래를 재생
sv_se: Spela sången The Final Hour under eftertexterna istället för att återanvända MIDI-sånger

source: Slim Left/Right Hotspots
hu_hu: Karcsú bal/jobb hotspotok
ko: 슬림한 왼쪽/오른쪽 핫스팟
sv_se: Smala reaktiva områden vänster/höger

source: Shrinks the hotspots on the left and right sides for exiting puzzles
hu_hu: A bal és jobb oldalon lévő hotspotokat összezsugorítja a rejtvényekből való kilépéshez
ko: 퍼즐을 종료하기 위해 왼쪽과 오른쪽의 핫스팟을 줄임
sv_se: Förminskar reaktiva områden på vänster och höger sida för avslutande pussel

source: Speedrun Mode
hu_hu: Speedrun Mód
ko: 스피드런 모드
sv_se: Speedrun-läge

source: Affects the controls for fast forwarding the game
hu_hu: A játék gyors előrehaladásának vezérlőelemeit érinti
ko: 게임을 빠르게 전달하는 조작에 영향을 미침
sv_se: Påverkar kontrollerna för snabbspolning av spelet

source: GroovieV2 support is not compiled in
hu_hu: GroovieV2 támogatás nincs lefordítva
ko: GroovieV2 지원은 컴파일되지 않았음
sv_se: Stöd för GroovieV2 har inte kompilerats in

source: Groovie engine
hu_hu: Groovie motor
ko: 그루비 엔진
sv_se: Groovie-motor

source: Skip or fast forward scene
hu_hu: Jelenet átugrása vagy csévélése
ko: 장면 건너뛰기 또는 빨리 감기
sv_se: Hoppa över eller snabbspola scen

source: Reserved
hu_hu: Foglalt
ko: 예약됨
sv_se: Reserverad

source: Failed to save game
hu_hu: Játék mentés nem sikerült
ko: 게임 저장에 실패함
sv_se: Kunde inte spara spelet

source: Would you like to save or restore a game?
hu_hu: Szeretne menteni vagy visszaállítani egy játékállást?
ko: 게임을 저장하거나 복원하겠습니까?
sv_se: Vill du spara eller återställa ett spel?

source: The Minotaur minigame is not supported yet. Skipping
hu_hu: A Minótaurosz minijáték még nem támogatott. Kihagyás
ko: 미노타우르스 미니 게임은 아직 지원되지 않습니다. 건너뛰기
sv_se: Minispelet Minotaur stöds ännu inte. Hoppar över

source: The Medusa minigame is not supported yet. Skipping
hu_hu: A Medúza minijáték még nem támogatott. Kihagyás
ko: 메두사 미니 게임은 아직 지원되지 않습니다. 건너뛰기
sv_se: Minispelet Medusa stöds ännu inte. Hoppar över

source: The Troy minigame is not supported yet. Skipping
hu_hu: A Trója minijáték még nem támogatott. Kihagyás
ko: 트로이 미니 게임은 아직 지원하지 않습니다. 건너뛰기
sv_se: Minispelet Troy stöds ännu inte. Hoppar över

source: Enable cheat mode
hu_hu: Csalás mód engedélyezés
ko: 치트 모드 활성화
sv_se: Aktivera fuskläge

source: Debug info and level selection becomes available
hu_hu: Hibakeresési információ és pályaválasztás elérhetővé válik
ko: 디버그 정보 및 레벨 선택이 가능함
sv_se: Felsökningsinformation och nivåval blir tilgängligt

source: Clear waypoints
hu_hu: Útvonal-pontok törlése
ko: 변침점 지우기
sv_se: Töm vägpunkter

source: Debug
hu_hu: Hibakeresés
ko: 디버그
sv_se: Felsök

source: Gore Mode
hu_hu: Véres Mód
ko: 고어 모드
sv_se: Våldsamt läge

source: Enable Gore Mode when available
hu_hu: Véres mód engedélyezése ha lehetséges
ko: 사용 가능한 경우 고어 모드를 활성화
sv_se: Aktivera våldsamt läge om tillgängligt

source: Options menu
sv_se: Alternativmeny

source: Forward
hu_hu: Előre
ko: 앞으로
sv_se: Framåt

source: Backward
hu_hu: Hátra
ko: 뒤로
sv_se: Bakåt

source: Lean left
sv_se: Luta åt vänster

source: Lean right
sv_se: Luta åt höger

source: Crouch
hu_hu: Guggolás
ko: 웅크리기
sv_se: Huka

source: Interact mode
sv_se: Interaktionsläge

source: Look mode
sv_se: Titta-läge

source: Holster
hu_hu: Elrak
ko: 홀스터
sv_se: Hölstra

source: Notebook
hu_hu: Jegyzettömb
ko: 노트북
sv_se: Anteckningsbok

source: Personal notes
sv_se: Personliga anteckningar

source: Flashlight
hu_hu: Zseblámpa
ko: 손전등
sv_se: Ficklampa

source: Glowstick
hu_hu: Világító rúd
ko: 야광막대
sv_se: Ljusstav

source: Use Windows interface
sv_se: Använd Windows-gränssnitt

source: Use mouse and toolbar from Windows version
sv_se: Använd mus och verktygsfält från Windows-versionen

source: User help
hu_hu: Felhasználói segítség
ko: 사용자 도움말
sv_se: Användarhjälp

source: Toggle sound
hu_hu: Hang ki/be Kapcsolása
ko: 사운드 전환
sv_se: Växla ljud

source: Repeat last line
hu_hu: Utolsó sor megismétlése
ko: 마지막 줄 반복
sv_se: Upprepa senaste rad

source: Restore game
hu_hu: Játék visszaállítása
ko: 게임 복원
sv_se: Återställ spel

source: New game
hu_hu: Új játék
ko: 새 게임
sv_se: Nytt spel

source: Show inventory
hu_hu: Felszerelés megjelenítése
ko: 인벤토리 표시
sv_se: Visa översikt

source: Turbo mode
hu_hu: Turbó mód
ko: 터보 모드
sv_se: Turboläge

source: Move to top
hu_hu: Ugrás a tetejére
ko: 위로 이동
sv_se: Flytta överst

source: Move to bottom
hu_hu: Ugrás az aljára
ko: 아래로 이동
sv_se: Flytta nederst

source: Move to left
hu_hu: Ugrás balra
ko: 왼쪽으로 이동
sv_se: Flytta åt vänster

source: Move to right
hu_hu: Ugrás jobbra
ko: 오른쪽으로 이동
sv_se: Flytta åt höger

source: Move to top left
hu_hu: Ugrás bal fentre
ko: 왼쪽 상단으로 이동
sv_se: Flytta överst till vänster

source: Move to top right
hu_hu: Ugrás jobb fentre
ko: 오른쪽 상단으로 이동
sv_se: Flytta överst till höger

source: Move to bottom left
hu_hu: Ugrás bal alulra
ko: 왼쪽 하단으로 이동
sv_se: Flytta nederst till vänster

source: Move to bottom right
hu_hu: Ugrás jobb alulra
ko: 오른쪽 하단으로 이동
sv_se: Flytta nederst till höger

source: Enable original cheats
hu_hu: Eredeti csalások engedélyezése
ko: 원본 치트 활성화
sv_se: Aktivera ursprungliga fusk

source: Allow cheats using the C key.
hu_hu: Engedélyezi a csalásokat a C billentyűvel.
ko: C 키를 사용하여 치트를 허용합니다.
sv_se: Tillåt fusk med C-tangenten.

source: Enable infinite health cheat
hu_hu: Végtelen élet csalást engedélyezése
ko: 무한 체력 치트 활성화
sv_se: Aktivera fusk för oändlig hälsa

source: Player health will never decrease (except for game over scenes).
hu_hu: A játékos életereje soha nem fog csökkenni (kivéve a "játék vége" jeleneteket).
ko: 플레이어의 체력은 (게임 종료 장면을 제외하고) 결코 감소하지 않습니다.
sv_se: Spelarhälsan kommer aldrig att minska (förutom under spelets slutscener).

source: Enable infinite ammo cheat
hu_hu: Végtelen lőszer csalás engedélyezése
ko: 무한 탄약 치트 활성화
sv_se: Aktivera fusk för oändlig ammunition

source: Player ammo will never decrease.
hu_hu: A játékos lőszere soha nem fog csökkenni.
ko: 플레이어의 탄약은 감소하지 않습니다.
sv_se: Spelarens ammunition kommer aldrig att minska.

source: Unlock all levels
hu_hu: Minden pálya elérhetővé
ko: 모든 레벨 잠금 해제
sv_se: Lås upp alla nivåer

source: All levels will be available to play.
hu_hu: Minden pálya elérhetővé válik a játékos számára.
ko: 모든 레벨에서 플레이할 수 있습니다.
sv_se: Alla nivåer kommer att finnas tillgängliga att spela.

source: Enable restored content
hu_hu: Visszaállított tartalom engedélyezése
ko: 복원된 컨텐츠 활성화
sv_se: Aktivera återställt innehåll

source: Add additional content that is not enabled the original implementation.
hu_hu: További tartalmakat ad hozzá melyek nem voltak elérhetőek az eredeti implementációban.
ko: 원래 구현에서 활성화되지 않은 추가 콘텐츠를 추가합니다.
sv_se: Lägg till ytterligare innehåll som inte aktiverats i ursprungliga implementationen.

source: Intro keymappings
sv_se: Kortkommandon för intro

source: Primary shoot
sv_se: Primärt skott

source: Secondary shoot
sv_se: Sekundärt skott

source: Skip intro
hu_hu: Nyitóvideó átugrása
ko: 인트로 건너뛰기
sv_se: Hoppa över intro

source: Exit menu keymappings
sv_se: Kortkommandon för avslutningsmeny

source: Difficulty selection menu keymappings
sv_se: Kortkommandon för svårighetsgradsmeny

source: Retry menu keymappings
sv_se: Kortkommandon för omförsöksmeny

source: Skip level (cheat)
sv_se: Hoppa över nivå (fusk)

source: Kill player
sv_se: Döda spelare

source: Chump
sv_se: Tönt

source: Punk
sv_se: Slyngel

source: Badass
sv_se: Tuffing

source: Retry sector
sv_se: Försök igen

source: Restart territory
sv_se: Starta om territoriet

source: Begin new mission
sv_se: Påbörja nytt uppdrag

source: Pause keymappings
sv_se: Kortkommandon för paus

source: Direction keymappings
sv_se: Kortkommandon för riktning

source: Show credits
hu_hu: Stáblista megjelenítése
ko: 크레딧 표시
sv_se: Visa medverkande

source: Arm
hu_hu: Kar
ko: 무기
sv_se: Beväpna

source: Side step
sv_se: Sidosteg

source: Move cursor up
hu_hu: Kurzor mozgatás fel
ko: 커서를 위로 이동
sv_se: Flytta pekaren upp

source: Move cursor down
hu_hu: Kurzor mozgatás le
ko: 커서를 아래로 이동
sv_se: Flytta pekaren ner

source: Move cursor left
hu_hu: Kurzor mozgatás balra
ko: 커서를 왼쪽으로 이동
sv_se: Flytta pekaren åt vänster

source: Move cursor right
hu_hu: Kurzor mozgatás jobbra
ko: 커서를 오른쪽으로 이동
sv_se: Flytta pekaren åt höger

source: Abort
hu_hu: Megszakít
ko: 중단
sv_se: Avbryt

source: Missing language specific game code and/or resources.
hu_hu: Hiányzó nyelv specifikus játék kód és/vagy forrás.
ko: 언어별 게임 코드나 리소스가 없습니다.
sv_se: Saknar språkspecifik spelkod och/eller resurser.

source: Missing language specific game code and/or resources for this fan translation.
hu_hu: Hiányzó nyelv specifikus játék kód és/vagy forrás ennél a rajongói fordításnál.
ko: 이 팬 번역에는 언어별 게임 코드나 리소스가 없습니다.
sv_se: Saknar språkspecifik spelkod och/eller resurser för denna fan-översättning.

source: Demo plays simple animations without using Westwood's Engine.
hu_hu: A Demo egyszerű animációkat játszik le Westwood Motor használata nélkül.
ko: 데모는 웨스트우드의 엔진을 사용하지 않고 간단한 애니메이션을 재생합니다.
sv_se: Demo spelar upp enkla animationer utan att använda Westwoods motor.

source: You added the game incorrectly. Please add the root folder of the game.
hu_hu: Helytelenül adta hozzá a játékot. Kérem, adja hozzá a játék tőkönyvtárát.
ko: 게임을 잘못 추가했습니다. 게임의 루트 폴더를 추가해 주세요.
sv_se: Du har lagt till spelet felaktigt. Lägg till spelets rotmapp.

source: You added the game incorrectly. The GAME.DAT file is an ISO image and you need to extract the game data files from it.
hu_hu: Helytelenül adta hozzá a játékot. A GAME.DAT fájl egy ISO lemezkép, és ki kell tömöríteni belőle a játék adatfájljait.
ko: 게임을 잘못 추가했습니다. GAME.DAT 파일은 ISO 이미지이고 여기에서 게임 데이터 파일을 추출해야 합니다.
sv_se: Du har lagt till spelet felaktigt. Filen GAME.DAT är en ISO-avbildning och du måste extrahera speldatafilerna från den.

source: Studio audience
hu_hu: Stúdió közönség
ko: 스튜디오 관객
sv_se: Studiopublik

source: Enable studio audience
hu_hu: Stúdió közönség engedélyezése
ko: 스튜디오 관객을 활성화
sv_se: Aktivera studiopublik

source: Allow text and cutscenes to be skipped
hu_hu: Szöveg és átvezetők átugrásának támogatása
ko: 텍스트와 컷신을 건너뛸 수 있도록 허용
sv_se: Tillåt att text och mellansekvenser hoppas över

source: Helium mode
hu_hu: Hélium mód
ko: 헬륨 모드
sv_se: Helium-läge

source: Enable helium mode
hu_hu: Hélium mód engedélyezve
ko: 헬륨 모드를 활성화
sv_se: Aktivera heliumläge

source: Smooth scrolling
hu_hu: Finom görgetés
ko: 부드러운 스크롤
sv_se: Mjuk skärmrullning

source: Enable smooth scrolling when walking
hu_hu: Finom görgetés engedélyezése járás közben
ko: 걸을 때 부드러운 스크롤을 활성화
sv_se: Aktivera mjuk skärmrullning vid gångfart

source: Floating cursors
hu_hu: Lebegő kurzorok
ko: 플로팅 커서
sv_se: Flytande pekare

source: Enable floating cursors
hu_hu: Lebegő kurzorok engedélyezése
ko: 플로팅 커서를 활성화
sv_se: Aktivera flytande pekare

source: Suggest save names
hu_hu: Mentés név javaslata
ko: 저장 파일 이름 제안
sv_se: Föreslå sparade namn

source: Autogenerated naming suggestions for savegames
hu_hu: Automatikusan generált mentésnév javaslatok
ko: 저장 게임에 대한 자동 생성된 이름 제안
sv_se: Autogenererade namnförslag för sparade spel

source: HP bar graphs
hu_hu: HP sáv grafikák
ko: HP 바 그래프
sv_se: Livmätargrafer

source: Enable hit point bar graphs
hu_hu: Életerő sáv grafika engedélyezése
ko: 히트 포인트 바 그래프를 활성화
sv_se: Aktivera livmätare

source: Fight Button L/R Swap
hu_hu: Harc Gomb B/J csere
ko: 대결 버튼 L/R 바꾸기
sv_se: Växla slåssknapp L/R

source: Left button to attack, right button to pick up items
hu_hu: Bal gomb a támadás, jobb gomb a tárgyak felvétele
ko: 왼쪽 버튼으로 공격, 오른쪽 버튼으로 아이템 습득
sv_se: Vänsterknapp för att attackera, högerknapp för att ta upp objekt

source: Faithful AD&D rules
hu_hu: Pontos AD&D szabályok
ko: 충실한 AD&D 규칙
sv_se: Trogna AD&D-regler

source: - Eliminate HP gain round-off errors - Correct projectile weapon damage (per AD&D 2nd Edition rules) - Elves get +1 to hit with swords and bows (per official game manual)
sv_se: - Eliminera avrundningsfel vid HP-ökning - Korrigera skadan från projektilvapen (enligt reglerna i AD&D 2nd Edition) - Alver får +1 för träff med svärd och bågar (enligt den officiella spelmanualen)

source: Fix Ileria and Beohram NPCs
sv_se: Fix för NPCerna Ileria och Beohram

source: Make Ileria a female and Beohram a paladin
sv_se: Gör Ileria kvinnlig och Beohram till en paladin

source: Enhanced thrown weapon reload
sv_se: Förbättrad omladdning av kastvapen

source: Thrown weapons (daggers, darts, spears...) get replaced from belt and backpack inventory slots, with thrown weapons only
sv_se: Kastvapen (dolkar, pilar, spjut...) ersätts från bältet och ryggsäckens inventarieplatser, med endast kastvapen

source: Lands of Lore support is not compiled in
hu_hu: Lands of Lore támogatás nincs lefordítva
ko: Lands of Lore 지원은 컴파일되지 않았음
sv_se: Stöd för Lands of Lore har inte kompilerats in

source: EOB II FM-TOWNS requires support of 16bit color modes which has not been activated in your ScummVM build
hu_hu: Az EOB II FM-TOWNS 16 bites színmód támogatást igényel, amely nincs aktiválva ebben a ScummVM verzióban
ko: EOB II FM-TOWNS는 ScummVM 빌드에서 활성화되지 않은 16 비트 색상 모드 지원이 필요함
sv_se: EOB II FM-TOWNS kräver stöd för 16-bitars färglägen som inte har aktiverats i din ScummVM-byggversion

source: Eye of Beholder support is not compiled in
hu_hu: Eye of Beholder támogatás nincs lefordítva
ko: 주시자의 눈 지원이 컴파일되지 않았음
sv_se: Stöd för Eye of Beholder har inte kompilerats in

source: Move backwards
sv_se: Flytta bakåt

source: Open / Close inventory
sv_se: Öppna/Stäng översikt

source: Switch inventory / Character screen
sv_se: Växla skärm för inventarier/karaktär

source: Camp
hu_hu: Tábor
ko: 캠프
sv_se: Läger

source: Cast spell
sv_se: Kasta besvärjelse
