/* ScummVM - Graphic Adventure Engine
 *
 * ScummVM is the legal property of its developers, whose names
 * are too numerous to list here. Please refer to the COPYRIGHT
 * file distributed with this source distribution.
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *
 */

#include "mads/madsv2/forest/rooms/section3.h"
#include "mads/madsv2/forest/mads/words.h"
#include "mads/madsv2/forest/digi.h"
#include "mads/madsv2/forest/extra.h"
#include "mads/madsv2/forest/global.h"
#include "mads/madsv2/forest/journal.h"
#include "mads/madsv2/core/config.h"
#include "mads/madsv2/core/game.h"
#include "mads/madsv2/core/imath.h"
#include "mads/madsv2/core/inter.h"
#include "mads/madsv2/core/kernel.h"
#include "mads/madsv2/core/object.h"
#include "mads/madsv2/core/player.h"
#include "mads/madsv2/core/sprite.h"

namespace MADS {
namespace MADSV2 {
namespace Forest {
namespace Rooms {

struct Scratch {
	int16 sprite[10];                 // 0x00–0x13
	int16 sequence[10];               // 0x14–0x27
	int16 animation[10];              // 0x28–0x3B
	AnimationInfo animation_info[10]; // 0x3C–0x8B
	int16 _8c;                        // 0x8C
	int16 _8e;                        // 0x8E
	int16 _90;                        // 0x90
	int16 _92;                        // 0x92
	int16 _94;                        // 0x94
	int16 _96;                        // 0x96
	int16 _98;                        // 0x98
	int16 _9a;                        // 0x9A
	int16 _9c;                        // 0x9C
	int16 _9e;                        // 0x9E
	int16 _a0;                        // 0xA0
	int16 _a2;                        // 0xA2
	int16 _a4;                        // 0xA4
	int16 _a6;                        // 0xA6
	int16 _a8;                        // 0xA8
	int16 _aa;                        // 0xAA
	int16 _ac;                        // 0xAC
	int16 _ae;                        // 0xAE
	int16 _b0;                        // 0xB0
	int16 _b2;                        // 0xB2
	int16 _b4;                        // 0xB4
	int16 _b6;                        // 0xB6
	int16 _b8;                        // 0xB8
	int16 _ba;                        // 0xBA
	int16 _bc;                        // 0xBC
	int16 _be;                        // 0xBE
	int16 _c0;                        // 0xC0
	byte  _c2;                        // 0xC2
	byte  _c2hi;                      // 0xC3
	byte  _c4;                        // 0xC4
	byte  _c5;                        // 0xC5
	byte  _c6;                        // 0xC6
};

static Scratch scratch;

#define local  (&scratch)
#define ss     local->sprite
#define seq    local->sequence
#define aa     local->animation
#define aainfo scratch.animation_info


static void room_308_anim1() {
	int16 cur = kernel_anim[ss[4]].frame;
	if (cur == aainfo[0]._active)
		return;
	aainfo[0]._active = cur;

	switch (cur) {
	case 40:
		global[player_score] = 0;
		break;
	case 56:
	case 84:
		digi_initial_volume(60);
		digi_play_build(308, '_', 1, 3);
		break;
	case 65:
		digi_play_build(308, 'b', 1, 1);
		scratch._b4 = -1;
		break;
	case 70:
		global[g009] = 0;
		global_midi_play(9);
		break;
	case 88:
		digi_initial_volume(60);
		digi_play_build(308, '_', 3, 2);
		break;
	case 102:
		digi_play_build(308, '_', 6, 2);
		break;
	case 107:
		digi_play_build(308, 'b', 2, 1);
		scratch._b4 = -1;
		break;
	case 119:
		digi_play_build(101, '_', 2, 2);
		break;
	case 121:
		digi_play_build(308, 'e', 1, 1);
		scratch._b4 = -1;
		break;
